Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Addition World ## Level 6: `add_right_comm` Lean sometimes writes `a + b + c`. What does it mean? The convention is that if there are no brackets displayed in an addition formula, the brackets are around the left most `+` (Lean's addition is "left associative"). So the goal in this level is `(a + b) + c = (a + c) + b`. This isn't quite `add_assoc` or `add_comm`, it's something you'll have to prove by putting these two theorems together. If you hadn't picked up on this already, `rw add_assoc` will change `(x + y) + z` to `x + (y + z)`, but to change it back you will need `rw ← add_assoc`. Get the left arrow by typing `\l` then the space bar (note that this is L for left, not a number 1). Similarly, if `h : a = b` then `rw h` will change `a`'s to `b`'s and `rw ← h` will change `b`'s to `a`'s. Also, you can be (and will need to be, in this level) more precise about where to rewrite theorems. `rw add_comm,` will just find the first `? + ?` it sees and swap it around. You can target more specific additions like this: `rw add_comm a` will swap around additions of the form `a + ?`, and `rw add_comm a b,` will only swap additions of the form `a + b`. ## Where next? There are thirteen more levels about addition after this one, but before you can attempt them you need to learn some more tactics. So after this level you have a choice -- either move on to Multiplication World (which you can solve with the tactics you know) or try Function World (and learn some new ones). After solving this level, click "Main Menu" in the top left to take you back to the overworld, and make your choice. Other things, perhaps of interest to some players, are mentioned below the lemma.
de: # Welt der Addition ## Level 6: `add_right_comm` Lean schreibt manchmal `a + b + c`. Was meint es damit? Nach Konvention steht die Klammer immer um die Zahlen beim linken `+`, wenn keine Klammern geschrieben sind. Dies bedeutetm dass Leans Addition "Links - assoziativ" ist. Das Ziel dieses Level ist es also `(a + b) + c = (a + c) + b` zu beweisen. Das ist nicht ganz `add_assoc` oder `add_comm`, es ist etwas anderes, dass du durch Kombination dieser beiden Sätze beweisen kannst. Wenn du es nicht ohnehin schon weißt: `rw add_assoc` wird `(x + y) + z` zu `x + (y + z)` umschreiben. Um es aber zurückzuschreiben, wirst du `rw ← add_assoc` brauchen. (Den Pfeil nach links erhältst du mit `\l`, der Buchstabe ist ein kleines L, nicht eine 1). Ähnlich funktioniert auch: Gilt `h : a = b`, dann wird `rw h` alle `a`s in `b`s umschreiben und `rw ← h` alle `b`s zu `a`s. Außerdem kannst du genauer damit sein, wo die Sätze umgeschrieben werden sollen. Du wirst das in diesem Level auf jeden Fall brauchen. `rw add_comm` wird nur die erste Stelle `? + ?` finden und umdrehen. Du kannst dies präzisieren: `rw add_comm a,` wird nur Additionen der Form `a + ?` tauschen und `rw add_comm a b,` wird nur Additionen der Form `a + b` tauschen. ## Wie geht es weiter? Es gibt noch dreizehn weitere Levels zur Addition, aber bevor du diese lösen kannst, musst du noch mehr Taktiken lernen. Nach dieser Welt hast du also eine Wahl. Entweder gehst du zur Welt der Multiplikation (die kannst du mit den bisherigen Taktiken lösen), oder du versuchst dich an der Welt der Funktionen und lernst neue Taktiken kennen. Wenn du mit diesem Level fertig bist, kehre ins Hauptmenü zurück und entscheide dich. Ein paar weitere interessante Dinge stehen unter dem Lemma.

source: For all natural numbers $a, b$ and $c$, we have $$ a + b + c = a + c + b. $$
de: Für alle natürlichen Zahlen $a, b$ und $c$ gilt: $$ a + b + c = a + c + b. $$

source: If you have got this far, then you have become very good at manipulating equalities in Lean. You can also now collect four collectibles (or `instance`s, as Lean calls them) ``` mynat.add_semigroup -- (after level 2) mynat.add_monoid -- (after level 2) mynat.add_comm_semigroup mynat (after level 4) mynat.add_comm_monoid -- (after level 4) ``` In Multiplication World you will be able to collect such advanced collectibles as `mynat.comm_semiring` and `mynat.distrib`, and then move on to power world and the famous collectible at the end of it. One last thing -- didn't you think that solving this level `add_right_comm` was boring? Check out this AI that can do it for us. First we have to get the `add_comm_monoid` collectible, which we do by saying the magic words which make Lean's type class inference system give it to us.
de: Wenn du soweit gekommen bist, dann bist du wirklich gut darin geworden, Gleichungen in Lean zu manimpulieren. Du kannst jetzt auf vier "Sammlerstücke" zugreifen (oder `Instanzen`, wie Lean sie nennt). ``` mynat.add_semigroup -- (nach Level 2) mynat.add_monoid -- (nach Level 2) mynat.add_comm_semigroup mynat (nach Level 4) mynat.add_comm_monoid -- (nach Level 4) ``` In der Welt der Multiplikation wirst du fortgeschrittene Sammlerstücke wie `mynat.comm_semiring`oder `mynat.distrib` finden. Danach kannst du weiter zur Welt der Potenzen und das berühmte Sammlerstück an ihrem Ende einsammeln. Eine letzte Sache noch -- hast du nicht gedacht, dass das Lösen dieses Levels `add_right_comm` eher langweilig war? Dann solltest du dir diese AI ansehen, die das für uns erledigen kann. Zuerst brauchen wir `add_comm_monoid`, was wir mit den magischen Worten erhalten können, die Leans Typklassen Inferenzmaschine uns zur Verfügung stellt.

source: Now the `simp` AI becomes accessible (it's just an advanced tactic really), and can nail some really tedious-for-a-human-to-solve goals. For example check out this one-line proof:
de: Die `simp`AI ist jetzt verfügbar (es ist eigentlich nur eine fortgeschrittene Taktik) und kann einige wirklich lästige Ziele (zumindest für Menschen) lösen. Sieh dir zum Beispiel diesen Einzeiler an:

source: Imagine having to do that one by hand! The AI closes the goal because it knows how to use associativity and commutativity sensibly in a commutative monoid. You are now done with addition world. Go back to the main menu (top left) and decide whether to press on with multiplication world and power world (which can be solved with `rw`, `refl` and `induction`), or to go on to Function World where you can learn the tactics needed to prove goals of the form $P\implies Q$, thus enabling you to solve more advanced addition world levels such as $a+t=b+t\implies a=b$. Note that Function World is more challenging mathematically; but if you can do Addition World you can surely do Multiplication World and Power World.
de: Stell dir vor, du müsstest das händisch machen! Die AI löst alle Ziele, weil es die Assoziativitäts- und Kommutativitätsbeweise in einem kommutativen Monoid verwenden kann. Du bist jetzt mit der Welt der Addition fertig. Geh zurück ins Hauptmenü (oben links) und entscheide dich, ob du mit der Welt der Multiplikation und der Welt der Potenzen weitermachen willst (die mit `rw`, `refl`und `Induktion` beweisen kannst), oder du gehst weiter zur Welt der Funktionen, wo du Taktiken lernen wirst, um Ziele der Form $P\implies Q$ zu lösen. Dadurch kannst du fortgeschrittenere Levels für die Addition lösen, wie zum Beispiel $a+t=b+t\implies a=b$. Beachte, dass die Welt der Funktionen mathematisch gesehen anspruchsvoller ist; aber wenn du die Welt der Addition geschafft hast, ist die Welt der Multiplikation und der Potenzen kein Problem für dich.

source: ## Summary The `simp` tactic is a high-level tactic which tries to prove equalities using facts in its database (such as `add_assoc` and `add_comm`). ## Details The `simp` tactic does basic automation. By level 6 of Addition World you have proved enough about addition for `simp` to be able to solve all equalities whose proofs involve a tedious number of rewrites of `add_assoc` and `add_comm`, and by level 9 of Multiplication World the same is true of `mul_assoc` and `mul_comm`. ### Example: If our goal is this: ``` ⊢ a + b + c + d + e = c + (b + e + a) + d ``` and you have completed addition world, then you've proved enough about addition to solve this level with `simp`. Note however that you can't prove `add_assoc` with `simp`, because `add_assoc` is an ingredient to get `simp` working. ### Example: If our goal is this: ``` ⊢ a * b * c = c * b * a ``` then as long as you've completed Multiplication World, `simp` will close this goal.
de: ## Zusammenfassung Die `simp`Taktik ist eine fortgeschrittene Taktik, die Gleichungen mit den Sätzen in ihrer Datenbank (wie `add_assoc`und `add_comm`) löst. ## Details Die `simp` Taktik automatisiert auf einem simplen Level. Von Level 6 an hast du genug über die Addition bewiesen, sodass `simp` es schafft, alle Beweise zu bewältigen, die eine enervierende Anzahl an `rw` Operationen wie `rw add_assoc`und `rw add_comm`benötigt. Ab dem neunten Level der Welt der Multiplikation gilt dasselbe für `mul_assoc`und `mul_comm`. ### Beispiel: Wenn unser Ziel: ``` ⊢ a + b + c + d + e = c + (b + e + a) + d ``` ist und du die Welt der Addition geschafft hast, dann kannst du obiges Ziel mit `simp` lösen. Du kannst allerdings nicht `add_assoc` mit `simp` beweisen, weil `add_assoc` eine "Zutat" für `simp`ist. ### Beispiel: Wenn unser Ziel: ``` ⊢ a * b * c = c * b * a ``` ist, dann wird `simp` dieses Ziel erfüllen, wenn du die Welt der Multiplikation abgeschlossen hast.

source: Multiplication world
de: Welt der Multiplikation

source: import mynat.mul -- import the definition of multiplication on mynat
de: import mynat.mul -- importiert die Definition der Multiplikation für mynat

source: # Multiplication World A new import! This import gives you the definition of multiplication on your natural numbers. It is defined by recursion, just like addition. Here are the two new axioms: * `mul_zero (a : mynat) : a * 0 = 0` * `mul_succ (a b : mynat) : a * succ(b) = a * b + a` In words, we define multiplication by "induction on the second variable", with `a * 0` defined to be `0` and, if we know `a * b`, then `a` times the number after `b` is defined to be `a * b + a`. You can keep all the theorems you proved about addition, but for multiplication, those two results above are you've got right now. I would recommend that you sort out the bar on the left. Fold up everything, and then unfold just Theorem Statements -> Multiplication World. This will remind you of your two new theorems, both of which are true by definition. If you want to be reminded of the theorems you have proved about addition, you can just open up the Addition World theorem statements and take a look. If you don't want to keep opening and closing these menus, why not think a bit about the logic behind the naming of the proofs? After a while you might find that you can guess the name of the proof you want. Anyway, what's going on in multiplication world? Like addition, we need to go for the proofs that multiplication is commutative and associative, but as well as that we will need to prove facts about the relationship between multiplication and addition, for example `a * (b + c) = a * b + a * c`, so now there is a lot more to do. Good luck! We are given `mul_zero`, and the first thing to prove is `zero_mul`. Like `zero_add`, we of course prove it by induction. ## Level 1: `zero_mul`
de: # Welt der Multiplikation Ein neuer Import! Dieser Import definiert uns die Multiplikation auf unseren natürlichen Zahlen. Sie ist rekursiv definiert, genauso wie die Addition. Hier sind die zwei neue Axiome: * `mul_zero (a : mynat) : a * 0 = 0` * `mul_succ (a b : mynat) : a * succ(b) = a * b + a` In anderen Worten, wir definieren die Multiplikation durch "Induktion über die zweite Variable ", wobei `a * 0` als `0`definiert ist. Wenn wir `a * b` wissen, dann ist `a`mal der Nachfolger von `b` definiert als `a * b + a`. Du kannst weiterhin alle Sätze verwenden, die du für die Addition bewiesen hast, aber für die Multiplikation ist das, was oben steht, erstmal alles. Ich würde dir empfehlen, dass du die Box auf der linken Seite ordest bzw. zuklappst. Aktuell brauchen wir nur die Sätze der Multiplikation unter Sätze -> Welt der Multiplikation. Das wird dich an die beiden neuen Sätze erinnern. Wenn du an die Sätze aus der Welt der Addition erinnert werden willst, klappe das entsprechende Menü einfach wieder aus. Wenn du nicht immer die Menüs auf- und zuklappen willst, kannst du auch noch ein wenig über die Logik der Beweisnamen nachdenken. Nach einer Weile kannst du sicher die Namen des Beweises, den du brauchst, raten. Was passiert jetzt in der Welt der Multiplikation? Wie bei der Addition müssen wir für die Multiplikation nachweisen, dass sie kommutativ und assoziativ ist. Außerdem müssen wir aber einige Dinge über die Beziehung zwischen Multiplikation und Addition beweisen, zum Beispiel: `a * (b + c) = a * b + a * c`. Es ist also sehr viel mehr zu tun. Viel Glück! Wir haben `mul_zero`gegeben und das Erste, was wir beweisen müssen, ist `zero_mul`. Wie `zero_add` können wir es natürlich mit Induktion beweisen. ## Level 1: `zero_mul`

source: For all natural numbers $m$, we have $$ 0 \times m = 0. $$
de: Für alle natürlichen Zahlen $m$ gilt: $$ 0 \times m = 0. $$

source: # Multiplication World ## Level 2: `mul_one` Remember that you can see everything you have proved so far about multiplication in the drop-down box on the left (and that this list will grow as we proceed). In this level we'll need to use * `one_eq_succ_zero : 1 = succ(0)` which was mentioned back in Addition World and which will be a useful thing to rewrite right now, as we begin to prove a couple of lemmas about how `1` behaves with respect to multiplication.
de: # Welt der Multiplikation ## Level 2: `mul_one` Denk daran, dass du alles, was du bisher über die Multiplikation bewiesen hast, links in der dropw-down Box sehen kannst (diese Liste wird noch wachsen). In diesem Level werden wir * `one_eq_succ_zero : 1 = succ(0)` verwenden, was zum ersten Mal in der Welt der Addition vorkam. Es wird jetzt zum zweiten Mal für das Umschreiben nützlich werden, da wir jetzt einige Lemmas über das Verhalten der `1` bei Multiplikation beweisen.

source: For any natural number $m$, we have $$ m \times 1 = m. $$
de: Für alle natürlichen Zahlen $m$ gilt: $$ m \times 1 = m. $$

source: # Multiplication World ## Level 3: `one_mul` These proofs from addition world might be useful here: * `one_eq_succ_zero : 1 = succ(0)` * `succ_eq_add_one a : succ(a) = a + 1` We just proved `mul_one`, now let's prove `one_mul`. Then we will have proved, in fancy terms, that 1 is a "left and right identity" for multiplication (just like we showed that 0 is a left and right identity for addition with `add_zero` and `zero_add`).
de: # Welt der Multiplikation ## Level 3: `one_mul` Die folgenden Beweis aus der Welt der Addition könnten hier nützlich sein: * `one_eq_succ_zero : 1 = succ(0)` * `succ_eq_add_one a : succ(a) = a + 1` Wir haben gerade `mul_one`bewiesen, jetzt geht es an `one_mul`. Wenn wir damit fertig sind haben wir, in schlauen Worten, bewiesen, dass für die Multiplikation die 1 ein "links- und rechtsneutrales" Element ist. (Das haben wir auch schon für die 0 für die Addition gezeigt, mit `add_zero` und `zero_add)

source: For any natural number $m$, we have $$ 1 \times m = m. $$
de: Für alle natürlichen Zahlen $m$ gilt: $$ 1 \times m = m. $$

source: # Multiplication World ## Level 4: `mul_add` Where are we going? Well we want to prove `mul_comm` and `mul_assoc`, i.e. that `a * b = b * a` and `(a * b) * c = a * (b * c)`. But we *also* want to establish the way multiplication interacts with addition, i.e. we want to prove that we can "expand out the brackets" and show `a * (b + c) = (a * b) + (a * c)`. The technical term for this is "left distributivity of multiplication over addition" (there is also right distributivity, which we'll get to later). Note the name of this proof -- `mul_add`. And note the left hand side -- `a * (b + c)`, a multiplication and then an addition. I think `mul_add` is much easier to remember than "left_distrib", an alternative name for the proof of this lemma.
de: # Welt der Multiplikation ## Level 4: `mul_add` Wo geht der Weg hin? Wir wollen `mul_comm` und `mul_assoc` beweisen, also `a * b = b * a` und `(a * b) * c = a * (b * c)`. Aber wir wollen *auch* festlegen, wie die Multiplikation mit der Addition interagiert, zum Beispiel wollen wir zeigen, wie man "ausklammert" und `a * (b + c) = (a * b) + (a * c)`zeigen. Der technische Name für diese Tatsache ist die "Links-Distributitvität" von Multiplikation und Addition (es gibt auch die Rechts-Distributivität, aber dazu kommen wir später noch). Beachte auch diesmal wieder den Namen des Beweises -- `mul_add` und die linke Seite -- `a * (b + c)`. Zuerst eine Multiplikation und dann eine Addition. Ich denke `mul_add` ist deutlich einfacher zu merken als "left_distrib", ein alternativer Name für den Beweis dieses Lemma.

source: Multiplication is distributive over addition. In other words, for all natural numbers $a$, $b$ and $t$, we have $$ t(a + b) = ta + tb. $$
de: Die Multiplikation ist distributiv bezüglich der Addition. Anders gesagt, für alle natürlichen Zahllen $a$, $b$ und $t$ gilt: $$ t(a + b) = ta + tb. $$

source: def left_distrib := mul_add -- the "proper" name for this lemma
de: def left_distrib := mul_add -- der "vernünftige" Name für dieses Lemma

source: # Multiplication World ## Level 5: `mul_assoc` We now have enough to prove that multiplication is associative. ## Random tactic hints 1) Did you know you can do `repeat {rw mul_succ}`? 2) Did you know you can do `rwa [hd, mul_add]`? I learnt that trick from Ken Lee. Ken spotted that `rwa` will do the rewrites and will then check to see if the goal can be proved by `refl`, and if it can, it will close it! [It will also close goals which are exactly equal to hypotheses, which will be helpful later on.]
de: # Welt der Multiplikation ## Level 5: `mul_assoc` Wir haben jetzt genug Material, um zu zeigen, dass die Multiplikation assoziativ ist. ## Taktik Hinweise 1) Wusstest du, dass du `repeat {rw mul_succ}` schreiben kannst? 2) Hast du gewusst, dass du `rwa [hd, mul_add]`schreiben kannst? Ich habe diesen Trick von ken Lee. Ken hat herausgefunden, dass `rwa` das Ziel umschreiben wird und dann überprüft, ob es mit `refl` bewiesen werden kann. Wenn es so ist, dann wird es automatisch geschlossen! [Es werden auch Ziele geschlossen, die äquivalent zur Hypothese sind, was später nützlich sein wird.]

source: Multiplication is associative. In other words, for all natural numbers $a$, $b$ and $c$, we have $$ (ab)c = a(bc). $$
de: Die Multiplikation ist assoziativ. Mit anderen Worten, für alle natürlichen Zahlen $a$, $b$ und $c$ gilt: $$ (ab)c = a(bc). $$

source: A mathematician could now remark that you have proved that the natural numbers form a monoid under multiplication.
de: Ein mathematiker würde jetzt sagen, dass du bewiesen hast, dass die natürlichen Zahlen mit der Multiplikation einen Monoid bilden.

source: # Multiplication World ## Level 6: `succ_mul` We now begin our journey to `mul_comm`, the proof that `a * b = b * a`. We'll get there in level 8. Until we're there, it is frustrating but true that we cannot assume commutativity. We have `mul_succ` but we're going to need `succ_mul` (guess what it says -- maybe you are getting the hang of Lean's naming conventions). Remember also that we have tools like * `add_right_comm a b c : a + b + c = a + c + b` These things are the tools we need to slowly build up the results which we will need to do mathematics "normally". We also now have access to Lean's `simp` tactic, which will solve any goal which just needs a bunch of rewrites of `add_assoc` and `add_comm`. Use if you're getting lazy!
de: # Welt der Multiplikation ## Level 6: `succ_mul` Wir beginnen jetzt unsere Reise zu `mul_comm`, also dem Beweis, dass `a * b = b * a` gilt. Wir werden das in Level 8 beweisen. Bis wir soweit sind, ist es frustrierend, aber leider wahr, dass wir die Kommutativität nicht einfach annehmen können. Wir haben `mul_succ`, werden aber auch `succ_mul` brauchen (rate doch mal was es aussagt -- ich bin sicher du hast Leans Benennungen inzwischen verstanden). Denk auch an Werkzeuge wie * `add_right_comm a b c : a + b + c = a + c + b` Diese Werkzeuge sind das, was wir brauchen werden, um langsam aber sicher die Ergebnisse aufzubauen, die es uns erlauben werden, Mathematik "normal" zu betreiben. Wir haben außerdem Zugriff auf Leans `simp` Taktik, die jedes Ziel beweist, dass nur ein paar mal das Umschreiben mit `add_assoc`oder `add_comm` erfordern. Benutze es, wenn du faul wirst!

source: For all natural numbers $a$ and $b$, we have $$ \operatorname{succ}(a) \times b = ab + b. $$
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $$ \operatorname{succ}(a) \times b = ab + b. $$

source: # Multiplication World ## Level 7: `add_mul` We proved `mul_add` already, but because we don't have commutativity yet we also need to prove `add_mul`. We have a bunch of tools now, so this won't be too hard. You know what -- you can do this one by induction on any of the variables. Try them all! Which works best? If you can't face doing all the commutativity and associativity, remember the high-powered `simp` tactic mentioned at the bottom of Addition World level 6, which will solve any puzzle which needs only commutativity and associativity. If your goal looks like `a+(b+c)=c+b+a` or something, don't mess around doing it explicitly with `add_comm` and `add_assoc`, just try `simp`.
de: # Welt der Multiplikation ## Level 7: `add_mul` Wir haben schon `mul_add` bewiesen, aber da wir noch keine Kommutativität haben, müssen wir `add_mul`auch beweisen. Wir haben bereits jede Menge Werkzeuge, es wird also nicht allzu schwer werden. Weißt du was -- du kannst diesen Beweis durch Induktion über eine beliebige Variable führen. Versuche sie alle! Welche funktioniert am Besten? Wenn du die ganzen Kommutativitäts- und Assoziativitätsbeweise selbst schreiben willst, denk auch an die mächtige `simp` Taktik, die in der Welt der Addition (Level 6) steht. Wenn dein Ziel wie `a+(b+c)=c+b+a` oder etwas Ähnliches aussieht, versuche es nicht mit `add_comm` oder `add_assoc`, sondern verwende einfach `simp`.

source: Addition is distributive over multiplication. In other words, for all natural numbers $a$, $b$ and $t$, we have $$ (a + b) \times t = at + bt. $$
de: Die Addition ist ditributiv bezüglich der Multiplikation. Mit anderen Worten, für alle natürlichen Zahlen $a$, $b$ und $t$ gilt: $$ (a + b) \times t = at + bt. $$

source: A mathematician would now say that you have proved that the natural numbers are a semiring. This sounds like a respectable result.
de: Eine Mathematiker würde jetzt sagen, dass wir bewiesen haben, dass die natürlichen Zahlen ein Halbring ist. Das klingt wie ein respektables Ergebnis.

source: def right_distrib := add_mul -- alternative name
de: def right_distrib := add_mul -- ein alternativer Name

source: Lean would add that you have also proved that they are a `distrib`. However this concept has no mathematical name at all -- this says something about the regard with which mathematicians hold this collectible. This is an artefact of the set-up of collectibles in Lean. You consider politely declining Lean's offer of a `distrib` collectible. You are dreaming of the big collectible at the end of power world.
de: Lean würde hinzufügen, dass du auch bewiesen hast, das sie `distrib` sind. Dieses Konzept hat aber keinen mathematischen Namen -- es sagt etwas über den Wert den Mathematiker diesem Sammlerstück zuweisen. Es ist ein Relikt aus der Liste der Sammlerstücke von Lean. Du wirst Leans Angebot für ein `distrib`Sammlerstück höflich ablehnen. Du träumst ohnehin vom großen Sammlerstück am Ende der Welt der Potenzen.
