Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Multiplication World ## Level 8: `mul_comm` Finally, the boss level of multiplication world. But (assuming you didn't cheat) you are well-prepared for it -- you have `zero_mul` and `mul_zero`, as well as `succ_mul` and `mul_succ`. After this level you can of course throw away one of each pair if you like, but I would recommend you hold on to them, sometimes it's convenient to have exactly the right tools to do a job.
de: # Welt der Multiplikation ## Level 8: `mul_comm` Endlich, dass Bosslevel der Welt der Multiplikation. Aber (wenn man annimmt, dass du nicht geschummelt hast) du bist gut vorbereitet -- du hast `zero_mul` und `mul_zero`, genauso wie `succ_mul`und `mul_succ`. Nach diesem Level kannst du natürlich jeweils eins von beiden wegwerfen, wenn du willst. Aber ich würde empfehlen sie zu behalten, denn manchmal ist es praktisch, genau das richtige Werkzeug zu haben, um einen Job zu erledigen.

source: Multiplication is commutative.
de: Die Multiplikation ist kommutativ.

source: You've now proved that the natural numbers are a commutative semiring! That's the last collectible in Multiplication World.
de: Du hast jetzt bewiesen, dass die natürlichen Zahlen ein kommutativer Halbring sind! Das ist das letzte Sammlerstück in der Welt der Multiplikation.

source: But don't leave multiplication just yet -- prove `mul_left_comm`, the last level of the world, and then we can beef up the power of `simp`.
de: Verlasse die Welt der Multiplikation aber noch nicht -- beweise `mul_left_comm`, das letzte Level dieser Welt. Damit können wir `simp` sogar noch stärker machen.

source: # Multiplication World ## Level 9: `mul_left_comm` You are equipped with * `mul_assoc (a b c : mynat) : (a * b) * c = a * (b * c)` * `mul_comm (a b : mynat) : a * b = b * a` Re-read the docs for `rw` so you know all the tricks. You can see them in the "tactics" drop-down menu on the left.
de: # Welt der Multiplikation Du bist mit * `mul_assoc (a b c : mynat) : (a * b) * c = a * (b * c)` * `mul_comm (a b : mynat) : a * b = b * a` ausgestattet. Lies dir die Dokumentation für `rw` durch, damit du alle Tricks kennst. Du kannst sie im "Taktiken" Menü links nachsehen.

source: For all natural numbers $a$ $b$ and $c$, we have $$a(bc)=b(ac)$$
de: Für alle natürlichen Zahlen $a$, $b$ und $c$ gilt: $$a(bc)=b(ac)$$

source: And now I whisper a magic incantation
de: Ich flüstere jetzt eine magische Beschwörung

source: and all of a sudden Lean can automatically do levels which are very boring for a human, for example
de: und plötzlich kann Lean ganz automatisch Levels lösen, die für einen Menschen sehr sehr langweilig sind, zum Beispiel:

source: If you feel like attempting Advanced Multiplication world you'll have to do Function World and the Proposition Worlds first. These worlds assume a certain amount of mathematical maturity (perhaps 1st year undergraduate level). Your other possibility is Power World, with the "final boss".
de: Wenn du dich in die Welt der fortgeschrittenen Multiplikation stürzen willst, wirst du zuerst die Welt der Funktionen und die Welt der Aussagen lösen müssen. Diese Welten benötigen ein gewisses Maß an mathematischer Vorbildung (vielleicht etwa erstes Jahr Grundstudium). Dein anderer Weg ist die Welt der Potenzen, mit dem "Endboss".

source: Power world
de: Welt der Potenzen

source: import mynat.pow -- new import
de: mport mynat.pow -- neuer Import

source: # Power World A new world with seven levels. And a new import! This import gives you the power to make powers of your natural numbers. It is defined by recursion, just like addition and multiplication. Here are the two new axioms: * `pow_zero (a : mynat) : a ^ 0 = 1` * `pow_succ (a b : mynat) : a ^ succ(b) = a ^ b * a` The power function has various relations to addition and multiplication. If you have gone through levels 1--6 of addition world and levels 1--9 of multiplication world, you should have no trouble with this world: The usual tactics `induction`, `rw` and `refl` should see you through. You might want to fiddle with the drop-down menus on the left so you can see which theorems of Power World you have proved at any given time. Addition and multiplication -- we have a solid API for them now, i.e. if you need something about addition or multiplication, it's probably already in the library we have built. Collectibles are indication that we are proving the right things. The levels in this world were designed by Sian Carey, a UROP student at Imperial College London, funded by a Mary Lister McCammon Fellowship, in the summer of 2019. Thanks Sian! ## Level 1: `zero_pow_zero`
de: Welt der Potenzen Eine neue Welt mit sieben levels. Und einem neuen Import! Wenn du die ersten 6 Level der Welt der Addition und die ersten 9 Level der Welt der Multiplikation geschafft hast, solltest du mit dieser Welt keine Probleme haben. Die üblichen Taktiken `induction`, `rw` und `refl` sollten hier völlig ausreichen. Du könntest etwas mit den drop-down Menüs auf der linken Seite herumspielen, um die Sätze für die Welt der Potenzen zu sehen, die du bisher bewiesen hast. Für die Addition und Multiplikation haben wir inzwischen eine recht solide API. Wenn du also etwas brauchst, wird es wahrscheinlich schon in unserer Bibliothek sein. Sammlerstücke sind ein klares Zeichen dafür, dass wir die richtigen Dinge beweisen. Die Level dieser Welt sind von Sian Carey im Sommer 2019 entwickelt worden, einem UROP Studenten des Imperial College London, der durch die Mary Lister McCammon Stiftung unterstützt wird. Danke Sian! ## Level 1: `zero_pow_zero`

source: # Power World ## Level 2: `zero_pow_succ`
de: # Welt der Potenzen ## Level 2: `zero_pow_succ`

source: For all naturals $m$, $0 ^{succ (m)} = 0$.
de: Für alle natürlichen zahlen $m$ gilt: $0 ^{succ (m)} = 0$.

source: # Power World ## Level 3: `pow_one`
de: # Welt der Potenzen ## Level 3: `pow_one`

source: For all naturals $a$, $a ^ 1 = a$.
de: Für alle natürlichen Zahlen $a$ gilt: $a ^ 1 = a$.

source: # Power World ## Level 4: `one_pow`
de: # Welt der Potenzen ## Level 4: `one_pow`

source: For all naturals $m$, $1 ^ m = 1$.
de: Für alle natürlichen Zahlen $m$ gilt: $1^m = 1$.

source: # Power World ## Level 5: `pow_add`
de: # Welt der Potenzen ## Level 5: `pow_add`

source: For all naturals $a$, $m$, $n$, we have $a^{m + n} = a ^ m a ^ n$.
de: für alle natürlichen Zahlen $a$, $m$, $n$ gilt: $a^{m + n} = a ^ m a ^ n$.

source: # Power World ## Level 6: `mul_pow` You might find the tip at the end of level 9 of Multiplication World useful in this one. You can go to the main menu and pop back into Multiplication World and take a look -- you won't lose any of your proofs. You'll only lose proofs if you reload the page.
de: # Welt der Potenzen ## Level 6: `mul_pow` Der Tip am Ende des neunten Levels der Welt der Multiplikation könnte für dieses Level ebenfalls nützlich sein. Du kannst über das Hauptmenü zurückgehen und nachsehen -- du wirst keinen Fortschritt oder Beweis dadurch verlieren. Du verlierst sie nur, wenn du die Seite neu lädst.

source: For all naturals $a$, $b$, $n$, we have $(ab) ^ n = a ^ nb ^ n$.
de: Für alle natürlichen Zahlen $a$, $b$ und $n$ gilt: $(ab) ^ n = a ^ nb ^ n$.

source: # Power World ## Level 7: `pow_pow`
de: # Welt der Potenzen ## Level 7: `pow_pow`

source: Boss level! What will the collectible be?
de: Boss Level! Was wird das Sammlerstück sein?

source: For all naturals $a$, $m$, $n$, we have $(a ^ m) ^ n = a ^ {mn}$.
de: Für alle natürlichen Zahlen $a$, $m$ und $n$ gilt: $(a ^ m) ^ n = a ^ {mn}$.

source: Apparently Lean can't find a collectible, even though you feel like you just finished power world so you must have proved *something*. What should the collectible for this level be called?
de: Scheinbar kann Lean kein Sammlerstück finden, auch wenn du das Gefühl hast, dass du die Welt der Potenzen gerade geschafft hast, also *irgendwas* bewiesen haben musst. Wie sollte das Sammlerstück für dieses Level genannt werden?

source: But what is this? It's one of those twists where there's another boss after the boss you thought was the final boss! Go to the next level!
de: Aber was ist jetzt los? Es ist einer dieser Wendepunkte, wo ein weiter Boss nach dem Boss auftaucht, obwohl du dachtest der erste war der Endboss! Geh weiter zum nächsten Level!

source: # Power World
de: # Welt der Potenzen

source: ## Level 8: `add_squared` [final boss music] You see something written on the stone dungeon wall: ``` begin rw two_eq_succ_one, rw one_eq_succ_zero, repeat {rw pow_succ}, ... ``` and you can't make out the last two lines because there's a kind of thing in the way that will magically disappear but only when you've beaten the boss.
de: ## Level 8: ' add_squared' [Endboss Musik] Du siehst etwas auf der steinernen Dungeonwand: ``` begin rw two_eq_succ_one, rw one_eq_succ_zero, repeat {rw pow_succ}, ... ``` Die letzten zwei Zeilen kannst du nicht entziffern, weil irgendetwas im Weg ist, dass magisch verschwinden wird, aber nur dann, wenn du den Boss besiegst.

source: For all naturals $a$ and $b$, we have $$(a+b)^2=a^2+b^2+2ab.$$
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $$(a+b)^2=a^2+b^2+2ab.$$

source: As the boss lies smouldering, you notice on the dungeon wall that <a href="https://twitter.com/XenaProject/status/1190453646904958976?s=20/" target="blank"> two more lines of code are now visible under the first three...</a> (Twitter.com) I just beat this level with 27 single rewrites followed by a `refl`. Can you do any better? (The current rewrite record is 25 -- see <a href="https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/function.20with.20random.20definition/near/179723073" target="blank">here</a> (needs zulip login)). If you beat it then well done! Do you fancy doing $(a+b)^3$ now? You might want to read <a href="https://xenaproject.wordpress.com/2018/06/13/ab3/" target="blank"> this Xena Project blog post</a> before you start though.
de: Als der Boss schwelend vor dir liegt, kannst du auf der Dungeonwand zwei weitere Zeilen erkennen <a href="https://twitter.com/XenaProject/status/1190453646904958976?s=20/" target="blank"> Sie sind jetzt unter den ersten drei erkennbar. </a> (Twitter.com) Ich habe dieses Level mit 27 Umschreibungen gelöst, gefolgt von einem `refl`. Kannst du es besser? (Der aktuelle Rekord liegt bei 25 -- siehe: <a href="https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/function.20with.20random.20definition/near/179723073" target="blank">hier</a> (braucht einen zulip login)). Wenn du es geschafft hast: gut gemacht! Du könntest vielleicht $(a+b)^3$ schlagen wollen? Falls ja, willst du vermutlich folgendes lesen: <a href="https://xenaproject.wordpress.com/2018/06/13/ab3/" target="blank"> Xena Project blog post</a>

source: If you got this far -- very well done! If you only learnt the three tactics `rw`, `induction` and `refl` then there are now more tactics to learn; go back to the main menu and choose Function World. The main thing we really want to impress upon people is that we believe that *all of pure mathematics* can be done in this new way. A system called Coq (which is very like Lean) has <a href="https://hal.inria.fr/hal-00816699" target="blank"> checked the proof of the Feit-Thompson theorem</a> (hundreds of pages of group theory) and Lean has a <a href="https://leanprover-community.github.io/lean-perfectoid-spaces/" target="blank"> definition of perfectoid spaces</a> (a very complex modern mathematical structure). I believe that these systems will one day cause a paradigm shift in the way mathematics is done, but first we need to build what we know, or at least build enough to state what we mathematicians believe. If you want to get involved, come and join us at the <a href="https://leanprover.zulipchat.com" target="blank">Zulip Lean chat</a>. The #new members stream is a great place to start asking questions. To come (possibly): the real number game, the group theory game, the integer game, the natural number game 2,... . Alternatively see <a href="http://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/FAQ.html" target="blank">the FAQ</a> for some more ideas about what to do next.
de: Wenn du soweit gekommen bist -- sehr gut! Wenn du bisher nur die Taktiken `rw`, `induction`und `refl`gelernt hast, dann warten jetzt noch mehr auf dich! Geh zurück ins Hauptmenü und betrete die Welt der Funktionen Der Knackpunkt, den wir allen leuten hier zeigen wollen ist, dass wir glauben, dass *alle reine Mathematik* in dieser neuen Art und Weise geschrieben werden kann. Ein System namens Coq (sehr ähnlich zu Lean) hat <a href="https://hal.inria.fr/hal-00816699" target="blank"> den Beweis des Satzes von Feit -Thompson überprüft. </a> (Hunderte Seiten von Gruppentheorie). Außerdem hat Lean <a href="https://leanprover-community.github.io/lean-perfectoid-spaces/" target="blank"> eine Definition für perfectoid spaces</a> (eine sehr komplexe und moderne mathematische Struktur). Ich glaubem dass diese Programme eines Tages einen Paradigmenwechsel in der Art, wie wir Mathematik betreiben, schaffen werden. Zuerst müssen wir aber alles, was wir bisher wissen, mit diesen System reproduzieren, oder zumindest soviel, dass wir ausdrücken können, was die meisten Mathematiker glauben. Wenn du dich einbringen möchtest, dann trete einfach dem us at the <a href="https://leanprover.zulipchat.com" target="blank">Zulip Lean chat</a> bei. Der #new members Teil ist ein großartiger Ort, um erste Fragen zu stellen. In der Zukunft (vermtulich): das Spiel der reellen Zahlen, das Gruppentheorie Spiel, Das Ganzzahlenspiel, das Spiel der natürlichen Zahlen - zweiter Teil, ... Alternativ, sieh hier nach <a href="http://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/FAQ.html" target="blank">FAQ</a> wenn du mehr Ideen haben möchtest, wie es weitergehen könnte.

source: Function world
de: Welt der Funktionen

source: # Function world. If you have beaten Addition World, then you have got quite good at manipulating equalities in Lean using the `rw` tactic. But there are plenty of levels later on which will require you to manipulate functions, and `rw` is not the tool for you here. To manipulate functions effectively, we need to learn about a new collection of tactics, namely `exact`, `intro`, `have` and `apply`. These tactics are specially designed for dealing with functions. Of course we are ultimately interested in using these tactics to prove theorems about the natural numbers &ndash; but in this world there is little point in working with specific sets like `mynat`, everything works for general sets. So our notation for this level is: $P$, $Q$, $R$ and so on denote general sets, and $h$, $j$, $k$ and so on denote general functions between them. What we will learn in this world is how to use functions in Lean to push elements from set to set. A word of warning &ndash; even though there's no harm at all in thinking of $P$ being a set and $p$ being an element, you will not see Lean using the notation $p\in P$, because internally Lean stores $P$ as a "Type" and $p$ as a "term", and it uses `p : P` to mean "$p$ is a term of type $P$", Lean's way of expressing the idea that $p$ is an element of the set $P$. You have seen this already &ndash; Lean has been writing `n : mynat` to mean that $n$ is a natural number. ## A new kind of goal. All through addition world, our goals have been theorems, and it was our job to find the proofs. **The levels in function world aren't theorems**. This is the only world where the levels aren't theorems in fact. In function world the object of a level is to create an element of the set in the goal. The goal will look like `⊢ X` with $X$ a set and you get rid of the goal by constructing an element of $X$. I don't know if you noticed this, but you finished essentially every goal of Addition World (and Multiplication World and Power World, if you played them) with `refl`. This tactic is no use to us here. We are going to have to learn a new way of solving goals &ndash; the `exact` tactic. If you delete the sorry below then your local context will look like this: ``` P Q : Type, p : P, h : P → Q ⊢ Q ``` In this situation, we have sets $P$ and $Q$ (but Lean calls them types), and an element $p$ of $P$ (written `p : P` but meaning $p\in P$). We also have a function $h$ from $P$ to $Q$, and our goal is to construct an element of the set $Q$. It's clear what to do *mathematically* to solve this goal -- we can make an element of $Q$ by applying the function $h$ to the element $p$. But how to do it in Lean? There are at least two ways to explain this idea to Lean, and here we will learn about one of them, namely the method which uses the `exact` tactic. ## The `exact` tactic. If you can explicitly see how to make an element of your goal set, i.e. you have a formula for it, then you can just write `exact <formula>` and this will close the goal. ### Example If your local context looks like this ``` P Q : Type, p : P, h : P → Q ⊢ Q ``` then $h(p)$ is an element of $Q$ so you can just write `exact h(p),` to close the goal. ## Important note Note that `exact h(P),` won't work (with a capital $P$); this is a common error I see from beginners. $P$ is not an element of $P$, it's $p$ that is an element of $P$. ## Level 1: the `exact` tactic.
de: # Welt der Funktionen. Wenn die die Welt der Addition geschafft hast, dann bist du inzwischen wirklich gut darin, mit Lean Gleichungen mit der `rw` Taktik zu lösen. Es gibt aber viele Level später, die zur Lösung das Anwenden von Funktionen notwendig machen. Dafür ist `rw` nicht geeignet. Um Funktionen effektiv zu benutzen, müssen wir einiges über eine neue Sammlung von Taktiken lernen, nämlich `exact`, `intro`, `have` und `apply`. Diese Taktiken sind speziell darauf zugeschnitte, sich mit Funktionen zu beschäftgen. Natürlich wird es irgendwann unser Ziel sein mit diesen Taktiken wiederum Sätze über die natürlichen Zahlen zu beweisen. In dieser Welt aber gibt es keinen Grund dafür, mit einer speziellen Menge wie `mynat` zu arbeiten. Alles was wir hier machen funktioniert für eine beliebige allgemeine Menge. In diesem Level gilt für unsere Notation: $P$, $Q$, $R$, usw. sind beliebige Mengen und $h$, $j$, $k$, etc. sind allgemeine Funktionen zwischen ihnen. Was wir in dieser Welt lernen werden ist, wie wirFunktionen in Lean benutzen können um Elemente zwischen den Mengen hin und herzuschieben. Eine kleine Warnung &ndash; Auch wenn es gar kein Problem ist über $P$ als Menge und $p$ als Element zu denken, wirst du in Lean nicht die Notation $p\in P$ sehen, weil Lean intern $P$ als "Typ" und $p$ als "Term" speichert. Es benutzt `p : P` um zu sagen "$p$ ist ein Term von Typ $P$", Leans Weg um die Idee auszudrücken, dass $p$ ein Element der Menge $P$ ist. Das hast du bereits gesehen &ndash; Lean hat `n : mynat` geschrieben, um zu sagen, dass $n$ eine natürliche Zahl ist. ## Eine neue Art von Ziel. In der gesamten Welt der Addition waren unsere Ziele Sätze und es war unsere Aufgabe Beweise für sie zu finden. **Die Level in der Welt der Funktionen sind keine Sätze**. Tatsächlich ist dies die einzige Welt, in der die Level keine Sätze sind. In der Welt der Funktionen ist das Ziel eines Levels, ein Element der Menge im Ziel zu generieren. Das Ziel wird aussehen wie `⊢ X` wobei $X$ eine Menge ist und du das Ziel erfüllst, indem du ein Element von $X$ konstruierst. Ich weiß nicht, ob es dir aufgefallen ist, aber du hast im Prinzip jedes Ziel in der Welt der Addition (und Multiplikation und Potenz, wenn, du sie gespielt hast) mit `refl` gelöst. Diese Taktik hilft uns hier nicht weiter. Wir werden einen neuen Weg finden müssen, um Ziele zu erfüllen; die `exact`Taktik. Wenn du das sorry unten löscht, dann wird deine Box rechts oben so aussehen: ``` P Q : Type, p : P, h : P → Q ⊢ Q ``` Wir haben also die Mengen $P$ und $Q$ (Lean nennt sie nur Typen) und ein Element $p$ von $P$ (geschrieben als `p : P`, aber gemeint ist $p \in P$). Wir haben außerdem eine Funktion $h$ von $P$ nach $Q$ gegeben und unser Ziel ist es, ein Element der Menge $Q$ anzugeben. Es ist klar, wie wir *mathematisch* dieses Ziel erfüllen würden -- wir können ein Element von $Q$ erhalten, indem wir die Funktion $h$ auf das Element $p$ anwenden. Aber wie funktioniert das in Lean? Es gibt mindestens zwei Wege, wie wir diese Idee Lean begreiflich machen können und hier werden wir eine der beiden Möglichkeiten lernen. Nämlich die Methode, die die `exact` Taktik benutzt. ## Die `exact` Taktik. Wenn du explizit sehen kannst, wie du ein Element der Zielmenge angeben kannst, du also z.B. eine Formel für sie hast, dann kannst du einfach `exact <formula>` schreiben. Das wird dein Ziel direkt erfüllen! ### Beispiel Wenn dein Kontext so aussieht, ``` P Q : Type, p : P, h : P → Q ⊢ Q ``` dann ist $h(p)$ ein Element von $Q$, also kannst du einfach `exact h(p),` schreiben, um das Ziel zu erfüllen. ## Wichtiger Hinweis: Beachte, dass `exact h(P)` nicht funktionieren wird (mit einem großen $P$); das ist ein häufiger Fehler, den Anfänger machen. $P$ ist kein Element von $P$, es ist $p$, das ein Element von $P$ ist. ## Level 1: die `exact` Taktik.

source: Given an element of $P$ and a function from $P$ to $Q$, we define an element of $Q$.
de: Gegeben ist ein Element von $P$ und eine Funktion von $P$ nach $Q$ und wir suchen ein Element von $Q$.

source: ## Summary If the goal is `⊢ X` then `exact x` will close the goal if and only if `x` is a term of type `X`. ## Details Say $P$, $Q$ and $R$ are types (i.e., what a mathematician might think of as either sets or propositions), and the local context looks like this: ``` p : P, h : P → Q, j : Q → R ⊢ R ``` If you can spot how to make a term of type `R`, then you can just make it and say you're done using the `exact` tactic together with the formula you have spotted. For example the above goal could be solved with `exact j(h(p)),` because $j(h(p))$ is easily checked to be a term of type $R$ (i.e., an element of the set $R$, or a proof of the proposition $R$).
de: ## Zusammenfassung Wenn das Ziel `⊢ X` lautet, dann wird `exact x` dieses Ziel genau dann erfüllen, wenn `x`ein Term vpm Typ `X` ist. Details Seien $P$, $Q$ und $R$ Typen (Mathematiker würden sie als Mengen oder Aussagen sehen) und unser Kontext sieht so aus: ``` p : P, h : P → Q, j : Q → R ⊢ R ``` Wenn du siehst, wie du einen Term vom Typ `R` bauen kannst, dann kannst du ihn zusammensetzen und mit der `exact` Taktik kombinieren. Im obigen Beispiel würde das so aussehen: `exact j(h(p)),` Dies liegt daran, dass $j(h(p))$ leicht als Term für den Typ $R$ (also ein Element der Menge $R$ oder ein Beweis für die Aussage $R$) erkannt werden kann.

source: import mynat.add -- + on mynat
de: import mynat.add -- + auf mynat

source: import mynat.mul -- * on mynat
de: import mynat.mul -- * auf mynat
