Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Addition World. Welcome to Addition World. If you've done all four levels in tutorial world and know about `rw` and `refl`, then you're in the right place. Here's a reminder of the things you're now equipped with which we'll need in this world. ## Data: * a type called `mynat` * a term `0 : mynat`, interpreted as the number zero. * a function `succ : mynat → mynat`, with `succ n` interpreted as "the number after `n`". * Usual numerical notation 0,1,2 etc (although 2 onwards will be of no use to us until much later ;-) ). * Addition (with notation `a + b`). ## Theorems: * `add_zero (a : mynat) : a + 0 = a`. Use with `rw add_zero`. * `add_succ (a b : mynat) : a + succ(b) = succ(a + b)`. Use with `rw add_succ`. * The principle of mathematical induction. Use with `induction` (see below) ## Tactics: * `refl` : proves goals of the form `X = X` * `rw h` : if h is a proof of `A = B`, changes all A's in the goal to B's. * `induction n with d hd` : we're going to learn this right now. # Important thing: This is a *really* good time to check you understand about the box on the left with the drop down menus. All the theorems and all the tactics above are documented there. You can find all you need to know about what theorems you have collected in Theorem statements -> Addition world. Have a click around and check that you can find statements of the theorems above, and explanations of the tactics above. As we go through the game, these lists will grow. The box on the left will prove invaluable as the number of theorems we prove gets bigger. On the other hand, we only need to learn one more tactic to really start going places, so let's learn about that tactic right now. ## Level 1: the `induction` tactic. OK so let's see induction in action. We're going to prove `zero_add (n : mynat) : 0 + n = n`. That is: for all natural numbers $n$, $0+n=n$. Wait $-$ what is going on here? Didn't we already prove that adding zero to $n$ gave us $n$? No we didn't! We proved $n + 0 = n$, and that proof was called `add_zero`. We're now trying to establish `zero_add`, the proof that $0 + n = n$. But aren't these two theorems the same? No they're not! It is *true* that `x + y = y + x`, but we haven't *proved* it yet, and in fact we will need both `add_zero` and `zero_add` in order to prove this. In fact `x + y = y + x` is the boss level for addition world, and `induction` is the only other tactic you'll need to beat it. Now `add_zero` is one of Peano's axioms, so we don't need to prove it, we already have it (indeed, if you've opened the Addition World theorem statements on the left, you can even see it). To prove `0 + n = n` we need to use induction on $n$. While we're here, note that `zero_add` is about zero add something, and `add_zero` is about something add zero. The names of the proofs tell you what the theorems are. Anyway, let's prove `0 + n = n`. Delete `sorry` and replace it with `induction n with d hd,` and **don't forget the comma**. Hit enter, wait for Lean to finish thinking, and let's see what we have. When Lean has finished thinking, we see that we now have *two goals*! The induction tactic has generated for us a base case with `n = 0` (the goal at the top) and an inductive step (the goal underneath). The golden rule: **Tactics operate on the first goal** -- the goal at the top. So let's just worry about that top goal now, the base case `⊢ 0 + 0 = 0`. Remember that `add_zero` (the proof we have already) is the proof of `x + 0 = x` (for any $x$) so we can try `rw add_zero,` . What do you think the goal will change to? Remember to just keep focussing on the top goal, ignore the other one for now, it's not changing and we're not working on it. You should be able to solve the top goal yourself now with `refl`. When you solved this base case goal, we are now be back down to one goal -- the inductive step. Take a look at the text below the lemma to see an explanation of this goal.
de: # Welt der Addition. Herzlich Willkommen in der Welt der Addition. Wenn du alle vier Tutorial Levels gespielt hast und über `rw`und `refl` Bescheid weißt, bist du hier richtig. Hier eine kleine Erinnerung für alles, was du für diese Welt jetzt brauchst. ## Daten: * einen Typ, der `mynat`genannt wird * ein Term `0 : mynat `, der als die Zahl Null interpretiert wird. * eine Funktion `succ : mynat → mynat`, wobei `succ n` als " der Nachfolger von `n` " interpretiert wird. * Die übliche arithmetische Notation 0,1,2, usw. (auch wenn wir Zahlen größer als 1 erst sehr viel später brauchen werden ;-)). * Die Addition (mit der Schreibweise `a + b`). ) ## Sätze: * `add_zero (a : mynat) : a + 0 = a`. Verwendung: `rw add_zero`. * `add_succ (a b : mynat) : a + succ(b) = succ(a + b)`. Verwendung `rw add_succ`. * Das Prinzip der vollständigen Induktion. Zu verwenden mit `induction` (siehe unten) ## Taktiken: * `refl` : beweist Ziele der Form `X = X` * `rw h` : wenn h ein Beweis für `A = B`ist, werden all A's im Ziel mit B's ersetzt. * `induction n with d hd` : das lernen wir genau jetzt!. # Wichtig: Jetzt wäre eine *wirklich* gute Gelegenheit zu überprüfen, ob du die Box auf der linken Seite mit dem Menü verstehst. Alle Sätze und Taktiken sind dort dokumentiert. Du kannst alles, was du über Sätze wissen musst im Abschnitt 'Sätze' -> Welt der Addition finden. Sieh dich ein wenig um und überprüfe, dass du die Aussagen der Sätze und Taktiken und deren Erklärungen von oben findest. Während du das Spiel erkundest, wird diese Liste wachsen. Die Box links wird von unschätzbarem Wert sein, sobald die Anzahl der Sätze größer wird. Auf der anderen Seite werden wir nur noch eine Taktik lernen müssen, umwirklich vorwärts zu kommen. Also los geht's. ## Level 1: die `induction` Taktik. Ok, sehen wir uns die Induktion in Aktion an. Wir werden folgendes beweisen: `zero_add (n : mynat) : 0 + n = n`. Für alle natürlichen Zahlen $n$ gilt $0 + n = n$. Moment $-$ was ist hier los? Haben wir nicht schon bewiesen, dass die Addition von Null und $n$ wieder $n$ ergibt? Nein, das haben wir nicht! Wir haben nur $n + 0 = n$ gezeigt und dieser Beweis hieß `add_zero`. Wir werden jetzt versuchen `zero_add` einzuführen, den Beweis dafür, dass $0 + n = n$ Aber sind diese zwei Sätze nicht dasselbe? Nein, sind sie nicht! Es ist *wahr*, dass `x + y = y + x`gilt, aber wir haben es noch nicht *bewiesen*. Wir werden tatsächlich sowohl `add_zero` als auch `zero_add` für diesen Beweis brauchen. Tatsächlich ist `x + y ? y + x`das Boss Level für diese Welt der Addition. Die vollständige Induktion ist die einzige andere Taktik, die wir dafür brauchen werden. `add_zero` ist eines von Peanos Axiomen, also müssen wir es nicht beweisen, wir haben es schon zur Verfügung (tatsächlich, wenn du die Sätze links im Menü geöffnet hast, kannst du es sehen). Um `0 + n = n`zu beweisen brauchen wir die Induktion über $n$. Während wir dabei sind, der Satz `zero_add` handelt von Null und etwas anderem und `add_zero` handelt von einer anderen Zahl und Null. Die Namen der Beweise beinhalten also die Aussagen der Sätze. Wie auch immer, auf zum Beweis von `0 + n = n`. Lösche das `sorry`und ersetze es mit `induction n with d hd,` und **vergiss das Komma nicht**. Drücke auf enter und warte darauf, dassLean aufhört zu denken. Dann sehen wir uns an, was wir haben. Sobald Lean fertig gedacht hat können wir erkennen, dass wir jetzt *zwei Ziele* haben! Die Induktionstaktik hat uns einen Basisfall für `n = 0` erzeugt (das obere Ziel), wie auch einen Induktionsschritt (das Ziel darunter). Die goldene Regel: **Taktiken operieren auf dem ersten Ziel** -- also dem oberen Ziel. Beschäftigen wir uns also erstmal nur mit diesem Ziel, dem Basisfall `⊢ 0 + 0 = 0`. Denk daran, dass `add_zero`(diesen Beweis haben wir schon) der Beweis für `x + 0 = x` ist. (für ein beliebiges $x$!) Wir können also folgendes versuchen: `rw add_zero,` Was glaubst du, wie das das Ziel verändern wird? Denk daran, wir konzentrieren uns zuerst nur auf das obere Ziel und ignorieren das andere bisher. Es wird sich nicht verändern und wir arbeiten nicht daran. Du solltest das obere Ziel jetzt selbst mit `refl` lösen können. Wenn du den basisfall gelöst hast haben wir nur noch ein Ziel - den Induktionsschritt. Sieh dir den Text unter dem Lemma an, um die Erklärung für dieses Ziel zu lesen.

source: For all natural numbers $n$, we have $$0 + n = n.$$
de: Für alle natürlichen Zahlen $n$ gilt: $$0 + n = n.$$

source: We're in the successor case, and your top right box should look something like this: ``` case mynat.succ d : mynat, hd : 0 + d = d ⊢ 0 + succ d = succ d ``` *Important:* make sure that you only have one goal at this point. You should have proved `0 + 0 = 0` by now. Tactics only operate on the top goal. The first line just reminds us we're doing the inductive step. We have a fixed natural number `d`, and the inductive hypothesis `hd : 0 + d = d` saying that we have a proof of `0 + d = d`. Our goal is to prove `0 + succ d = succ d`. In words, we're showing that if the lemma is true for `d`, then it's also true for the number after `d`. That's the inductive step. Once we've proved this inductive step, we will have proved `zero_add` by the principle of mathematical induction. To prove our goal, we need to use `add_succ`. We know that `add_succ 0 d` is the result that `0 + succ d = succ (0 + d)`, so the first thing we need to do is to replace the left hand side `0 + succ d` of our goal with the right hand side. We do this with the `rw` command. You can write `rw add_succ,` (or even `rw add_succ 0 d,` if you want to give Lean all the inputs instead of making it figure them out itself). Don't forget the comma though. Hit enter. The goal should change to `⊢ succ (0 + d) = succ d` Now remember our inductive hypothesis `hd : 0 + d = d`. We need to rewrite this too! Type `rw hd,` (don't forget the comma). The goal will now change to `⊢ succ d = succ d` This goal can be solved with the `refl` tactic. After you apply it, Lean will inform you that there are no goals left. You are done! ## Now venture off on your own. Those three tactics -- * `induction n with d hd,` * `rw h,` * `refl,` will get you quite a long way through this game. Using only these tactics you can beat Addition World level 4 (the boss level of Addition World), all of Multiplication World including the boss level `a * b = b * a`, and even all of Power World including the fiendish final boss. This route will give you a good grounding in these three basic tactics; after that, if you are still interested, there are other worlds to master, where you can learn more tactics. But we're getting ahead of ourselves, you still have to beat the rest of Addition World. We're going to stop explaining stuff carefully now. If you get stuck or want to know more about Lean (e.g. how to do much harder maths in Lean), ask in `#new members` at <a href="https://leanprover.zulipchat.com" target="blank">the Lean chat</a> (login required, real name preferred). Kevin or Mohammad or one of the other people there might be able to help. Good luck! Click on "next level" to solve some levels on your own.
de: Wir sind im Nachfolger-Fall und die Box rechts oben sollte etwa so aussehen: ``` case mynat.succ d : mynat, hd : 0 + d = d ⊢ 0 + succ d = succ d ``` *Wichtig:* gehe sicher, dass du im Moment nur noch ein Ziel hast. Du solltest `0 + 0 = 0` inzwischen bewiesen haben. Taktiken funktionieren nur für das oberste Ziel. Die erste Zeile erinnert uns nur daran, dass wir beim Induktionsschritt sind. Wir wählen eine natürliche Zahl `d` beliebig, aber fest und betrachten die Induktionsvoraussetzung `hd : 0 + d = d`, die uns mitteilt, dass wir einen Beweis für `0 + d = d` haben. Unser Ziel ist es, zu beweisen, dass `0 + succ d = succ d` gilt. In Worten: Wenn das Lemma für `d` wahr ist, dann ist es auch für alle Zahlen nach `d` wahr. Das entspricht dem Induktionsschritt. Sobald wir diesen bewiesen haben, haben wir `zero_add` mit Hilfe der vollständigen Induktion bewiesen. Um das Ziel zu erreichen müssen wir `add_succ` verwenden. Wir wissen, dass `add_succ 0 d` das Ergebnis ist, das `0 + succ d = succ (0 + d)` gilt. Unser erste Schritt ist es also, die linke Seite `0 + succ d` unseres Ziels mit der rechten Seite zu ersetzen. Wir erreichen das mit dem `rw` Befehl. Man schreibt: `rw add_succ,` (oder sogar `rw add_succ 0 d,` wenn du es Lean genau sagen willst, anstatt ihm das Denken zu überlassen). Vergiss das Komma nicht und drücke auf Enter. Das Ziel sollte jetzt so aussehen: `⊢ succ (0 + d) = succ d` Jetzt müssen wir uns an die Induktionsvoraussetzung `hd : 0 + d = d` erinnern. Wir müssen diese auch mit `rw` einsetzen! `rw hd,` (Vergiss das Komma nicht!). Das Ziel wird jetzt zu: to `⊢ succ d = succ d` Dieses Ziel können wir mit `refl` beweisen. Nachdem du es angewandt hast, wird Lean dich wissen lassen, dass keine Ziele mehr übrig sind. Du bist fertig! ## Ab hier gehst du alleine auf deine Reise. Die folgenden drei Taktiken -- * `induction n with d hd,` * `rw h,` * `refl,` werden dich sehr weit durch dieses Spiel tragen. Mit nur diesen drei Taktiken kannst du das vierte Level dieser Welt (das Boss level der Welt der Addition), die gesamte Welt der Multiplikation mit ihrem Bosslevel `a * b = b * a`, und sogar die gesamte Welt der Potenzen mit ihrem teuflischen Endboss lösen. Dieser Weg wird dir eine gute Grundlage in den drei grundlegenden Taktiken geben. Wenn du danach immer noch interessiert bist, gibt es andere Welten zu meistern, dort kannst du noch mehr Taktiken lernen. Aber eins nach dem anderen, du musst zunächst den Rest dieser Welt lösen! Ab sofort wird nicht mehr alles so genau erklärt, wie bisher. Wenn du feststeckst oder mehr über Lean wissen willst (z.B. wie man viel schwerere Mathematik in Lean schreibt), frage einfach in `#new members`unter <a href="https://leanprover.zulipchat.com" target="blank">der Lean chat</a> nach. (Ein login wird benötigt, ein echter Name wird bevorzugt). Kevin or Mohammad oder einer der anderen dort sollte dir helfen können. Viel Glück! Klicke auf "Nächstes Level", um mehr Levels alleine zu lösen.

source: # Addition world Don't forget to use the drop down boxes on the left to see your tactics and what you have proved so far. ## Level 2: `add_assoc` -- associativity of addition. It's well-known that (1 + 2) + 3 = 1 + (2 + 3) -- if we have three numbers to add up, it doesn't matter which of the additions we do first. This fact is called *associativity of addition* by mathematicians, and it is *not* obvious. For example, subtraction really is not associative: $(6 - 2) - 1$ is really not equal to $6 - (2 - 1)$. We are going to have to prove that addition, as defined the way we've defined it, is associative. See if you can prove associativity of addition. Hint: because addition was defined by recursion on the right-most variable, use induction on the right-most variable (try other variables at your peril!). Note that when Lean writes `a + b + c`, it means `(a + b) + c`. If it wants to talk about `a + (b + c)` it will put the brackets in explictly. Reminder: you are done when you see "Proof complete!" in the top right, and an empty box (no errors) in the bottom right. You can move between levels and worlds (i.e. you can go back and review old stuff) without losing anything. Once you're done with associativity (sub-boss), we can move on to commutativity (boss).
de: # Welt der Addition Vergiss nicht das dropdown Menü auf der linken Seite zu verwenden, um die Taktiken und alles, was du bisher bewiesen hast, zu sehen. ## Level 2: `add_assoc` -- Die Assoziativität der Addition Es ist allgemein bekannt, dass (1 + 2) + 3 = 1 + (2 + 3) gilt -- wenn wir drei Zahlen addieren, spielt es keine Rolle, welche der Additionen wir zuerst ausführen. Diese Tatsache wird von Mathematikern *Assoziativität der Addition* genannt und ist *nicht* offensichtlich. Zum Beispiel ist die Subtraktion nicht assoziativ: $(6 - 2) - 1$ ist nicht dasselbe wie $6 - (2 - 1)$. Wir müssen beweisen, dass die Addition -- so wie wir sie definiert haben -- assoziativ ist. Versuche jetzt zu beweisen, dass die Addition assoziativ ist. Hinweis: da die Addition durch Rekursion auf der Variable ganz rechts definiert wurde, solltest du die Induktion auf dieser durchführen (verwende andere Variablen auf eigene Gefahr. Beachte außerdem, dass Lean `a + b + c` als `(a + b) + c` interpretiert. Wenn es `a + (b + c)` meint, wird es die Klammern explizit anzeigen. Erinnerung: du bist fertig, wenn du " Satz bewiesen!" oben rechts und eine leere Fehlerbox unten rechts siehst. Du kannst dich zwischen levels und Welten bewegen (also zurückgehen, um altes noch einmal zu sehen) ohne etwas zu verlieren. Sobald du mit der Assoziativität (Zwischenboss) fertig bist kannst du zur Kommutativität vordrignen (Endboss).

source: On the set of natural numbers, addition is associative. In other words, for all natural numbers $a, b$ and $c$, we have $$ (a + b) + c = a + (b + c). $$
de: Die Addition von natürlichen Zahlen ist assoziativ. Mit anderen Worten, für alle natürlichen Zahlen $a, b$ und $c$ gilt: $$ (a + b) + c = a + (b + c). $$

source: # Addition World ## Level 3: `succ_add` Oh no! On the way to `add_comm`, a wild `succ_add` appears. `succ_add` is the proof that `succ(a) + b = succ(a + b)` for `a` and `b` in your natural number type. We need to prove this now, because we will need to use this result in our proof that `a + b = b + a` in the next level. NB: think about why computer scientists called this result `succ_add` . There is a logic to all the names. Note that if you want to be more precise about exactly where you want to rewrite something like `add_succ` (the proof you already have), you can do things like `rw add_succ (succ a)` or `rw add_succ (succ a) d`, telling Lean explicitly what to use for the input variables for the function `add_succ`. Indeed, `add_succ` is a function -- it takes as input two variables `a` and `b` and outputs a proof that `a + succ(b) = succ(a + b)`. The tactic `rw add_succ` just says to Lean "guess what the variables are".
de: # Welt der Addition ## Level 3: `succ_add` Oh nein! Auf dem Weg zu `add_comm` ist ein wildes `succ_add` erschienen. `succ_add` ist der Beweis dafür, dass für zwei natürlichen Zahlen `a` und `b` gilt: `succ(a) + b = succ(a + b)`. Wir werden dies jetzt beweisen, da wir dieses Ergebnis für unseren Beweis für `a + b = b + a` im nächsten Level brauchen. Nebenbei: denk darüber nach, warum Informatiker dieses Ergebnis `succ_add` nennen. Alle Namen folgen derselben Logik. Beachte, dass du Lean genauer sagen kannst, was du umschreiben willst, wenn du `add_succ` (den Beweis, den du schon hast) anwenden willst. Du kannst zum Beispiel schreiben: `rw add_succ (succ a)` oder `rw add_succ (succ a) d`. Mit diesen Befehlen sagst du Lean genau, welche Eingabevariable du für die Funktion `add_succ` haben möchtest. Tatsächlich ist `add_succ` eine Funktion -- es nimmt als Eingabe zwei Variablen `a` und `b` und macht daraus einen Beweis., dass gilt: `a + succ(b) = succ(a + b)`. Die Taktik `rw add_succ` sagt Lean nur: "Rate, was die Variablen sind."

source: For all natural numbers $a, b$, we have $$ \operatorname{succ}(a) + b = \operatorname{succ}(a + b). $$
de: Für alle natürlichen Zahlen $a, b$ gilt: $$ \operatorname{succ}(a) + b = \operatorname{succ}(a + b). $$

source: # Addition World ## Level 4: `add_comm` (boss level) [boss battle music] Look in Theorem statements -> Addition world to see the proofs you have. These should be enough.
de: # Welt der Addition ## Level 4: `add_comm` (Bosslevel) [Bossmusik] Sieh in die Sätze auf der linken Seite (Welt der Addition), um zu sehen, welche Beweise du hast. Sie sollten ausreichen.

source: On the set of natural numbers, addition is commutative. In other words, for all natural numbers $a$ and $b$, we have $$ a + b = b + a. $$
de: Die Addition auf den natürlichen Zahlen ist kommutativ, oder: Für alle natürlichen Zahlen $a$ und $b$ gilt: $$ a + b = b + a. $$

source: If you got this far -- nice! You're nearly ready to make a choice: Multiplication World or Function World. But there are just a couple more useful lemmas in Addition World which you should prove first. Press on to level 5.
de: Wenn du soweit gekommen bist -- sehr schön! Du bist fast soweit, dich zu entscheiden: Die Welt der Multiplikation, oder die Welt der Funktionen. Aber es gibt noch einige weitere nützliche Lemmas in der Welt der Addition, die du zuerst beweisen solltest. Also auf zu Level 5.

source: # Addition World ## Level 5: `succ_eq_add_one` I've just added `one_eq_succ_zero` (a proof of `1 = succ(0)`) to your list of theorems; this is true by definition of $1$, but we didn't need it until now. Levels 5 and 6 are the two last levels in Addition World. Level 5 involves the number $1$. When you see a $1$ in your goal, you can write `rw one_eq_succ_zero` to get back to something which only mentions `0`. This is a good move because $0$ is easier for us to manipulate than $1$ right now, because we have some theorems about $0$ (`zero_add`, `add_zero`), but, other than `1 = succ(0)`, no theorems at all which mention $1$. Let's prove one now.
de: # Welt der Addition ## Level 5: `succ_eq_add_one` Ich habe gerade `one_eq_succ_zero` (einen Bweis für '1 = succ(0)` zu deiner Liste von Beweisen hinzugefügt. Das gilt für die Definition von $1$, aber wir haben es bisher nicht gebraucht. Die Levels 5 und 6 sind die letzten beiden Level in der Welt der Addition. Das fünfte Level behandelt die Zahl $1$, wenn du eine $1$ in deinem Ziel siehst, kannst du `rw one_eq_succ_zero` schreiben, um wieder zu etwas mit $0$ zurückzukommen. Das ist eine gute Strategie, weil $0$ für uns einfacher zu verändern ist als $1$. Wir haben nämlich viele Sätze über die $0$ (`zero_add`, `add_zero`), aber abgesehen von `1 = succ(0)` haben wir keine Sätze, die $1$ erwähnen. Beweisen wir jetzt einen!

source: For any natural number $n$, we have $$ \operatorname{succ}(n) = n+1. $$
de: Für eine beliebige natürliche Zahl $n$ gilt: $$ \operatorname{succ}(n) = n+1. $$
