Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Proposition world. ## Level 4: `apply`. Let's do the same level again: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/implies_diag.jpg) We are given a proof $p$ of $P$ and our goal is to find a proof of $U$, or in other words to find a path through the maze that links $P$ to $U$. In level 3 we solved this by using `have`s to move forward, from $P$ to $Q$ to $T$ to $U$. Using the `apply` tactic we can instead construct the path backwards, moving from $U$ to $T$ to $Q$ to $P$. Our goal is to prove $U$. But $l:T\implies U$ is an implication which we are assuming, so it would suffice to prove $T$. Tell Lean this by starting the proof below with `apply l,` and notice that our assumptions don't change but *the goal changes* from `⊢ U` to `⊢ T`. Keep `apply`ing implications until your goal is `P`, and try not to get lost! Now solve this goal with `exact p`. Note: you will need to learn the difference between `exact p` (which works) and `exact P` (which doesn't, because $P$ is not a proof of $P$).
de: # Welt der Aussagen. ## Level 4: `apply`. Lass uns dasselbe Level noch einmal machen: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/implies_diag.jpg) Wir haben einen Beweis $p$ von $P$ gegeben und unser Ziel ist es, einen Beweis von $U$ zu finden. Mit anderen Worten: wir suchen einen Pfad durch das Labyrinthm der $P$ und $U$ verbindet. Im dritten Level haben wir dies mit der `have`Taktik gelöst, um uns vorwärts durch das Labyrinth zu bewegen, von $P$ über $Q$ und $T$ zu $U$. Wenn wir die `apply`Taktik verwenden, konstruieren wir den Weg rückwärts, also von $U$ über $T$ und $Q$ zu $P$. Unser Ziel ist es $U$ zu beweisen. Allerdings ist $l:T\implies U$ ist eine Implikation, die wir schon annehmen. Es ist also ausreichend, $T$ zu beweisen. Wir sagen das Lean, indem wir den Beweis wie folgt starten: `apply l,` Wir können jetzt sehen, dass unsere Annahmen sich nicht verändern, aber *das Ziel verändert sich*. von `⊢ U` zu `⊢ T`. Mache weiter mit `apply`, bis dein Ziel `P` ist und versuche, nicht verloren zu gehen! Löse das letzte Ziel mit `exact p`. Hinweis: Du wirst den Unterschied zwischen `exact p` (das funktioniert) und `exact P` (das nicht funktioniert, weil $P$ kein Beweis von $P$ ist) lernen müssen!

source: We can solve a maze.
de: Wir können ein Labyrinth lösen.

source: # Proposition world. ## Level 5 : `P → (Q → P)`. In this level, our goal is to construct an implication, like in level 2. ``` ⊢ P → (Q → P) ``` So $P$ and $Q$ are propositions, and our goal is to prove that $P\implies(Q\implies P)$. We don't know whether $P$, $Q$ are true or false, so initially this seems like a bit of a tall order. But let's give it a go. Delete the `sorry` and let's think about how to proceed. Our goal is `P → X` for some true/false statement $X$, and if our goal is to construct an implication then we almost always want to use the `intro` tactic from level 2, Lean's version of "assume $P$", or more precisely "assume $p$ is a proof of $P$". So let's start with `intro p,` and we then find ourselves in this state: ``` P Q : Prop, p : P ⊢ Q → P ``` We now have a proof $p$ of $P$ and we are supposed to be constructing a proof of $Q\implies P$. So let's assume that $Q$ is true and try and prove that $P$ is true. We assume $Q$ like this: `intro q,` and now we have to prove $P$, but have a proof handy: `exact p,`
de: # Welt der Aussagen. ## Level 5 : `P → (Q → P)`. In diesem Level ist es unser Ziel eine Implikation wie in level 2 zu konstruieren. ``` ⊢ P → (Q → P) ``` $P$ und $Q$ sind Aussagen und unser Ziel ist es zu zeigen, dass gilt: $P\implies(Q\implies P)$. Wir wissen nicht, ob $P$ und $Q$ wahr oder falsch sind. Auf den ersten Blick ist dies also wieder eine schwere Aufgabe. Aber wir versuchen es! Lösche das `sorry` und wir denken darüber nach, wie es weitergeht. Unser Ziel ist `P → X` für eine wahre oder falsche Aussage $X$. Wenn es unser Ziel ist, eine Implikation zu beweisen, dann wollen wir eigentlich immer die `intro` Taktik aus Level 2 verwenden, also Leans Version von "Wir nehmen an, $P$ ist wahr". Oder noch genauer: "Wir nehmen an, $p$ ist ein Beweis von $P$". Fangen wir also an: `intro p,` Wir finden uns in folgendem Zustand wieder: ``` P Q : Prop, p : P ⊢ Q → P ``` Wir haben jetzt einen Beweis $p$ von $P$ und wir sollen einen Beweis konstruieren, sodass gilt: $Q\implies P$. Nehmen wir also an, dass $Q$ wahr ist und versuchen zu bweisen, dass $P$ wahr ist. Das geht so: `intro q,` Jetzt müssen wir nur noch $P$ beweisen, aber wir haben einen Beweis zur Hand! `exact p,`

source: For any propositions $P$ and $Q$, we always have $P\implies(Q\implies P)$.
de: Für beliebige Aussagen $P$ und $Q$ gilt immer $P\implies(Q\implies P)$.

source: A mathematician would treat the proposition $P\implies(Q\implies P)$ as the same as the proposition $P\land Q\implies P$, because to give a proof of either of these is just to give a method which takes a proof of $P$ and a proof of $Q$, and returns a proof of $P$. Thinking of the goal as $P\land Q\implies P$ we see why it is provable. ## Did you notice? I wrote `P → (Q → P)` but Lean just writes `P → Q → P`. This is because computer scientists adopt the convention that `→` is *right associative*, which is a fancy way of saying "when we write `P → Q → R`, we mean `P → (Q → R)`. Mathematicians would never dream of writing something as ambiguous as $P\implies Q\implies R$ (they are not really interested in proving abstract propositions, they would rather work with concrete ones such as Fermat's Last Theorem), so they do not have a convention for where the brackets go. It's important to remember Lean's convention though, or else you will get confused. If your goal is `P → Q → R` then you need to know whether `intro h` will create `h : P` or `h : P → Q`. Make sure you understand which one.
de: Ein mathematiker würde die Aussagen $P\implies(Q\implies P)$ wie die Aussage $P\land Q\implies P$ behandeln. Dies liegt daran, dass es für beides ausreichend ist, eine Methode anzugehen, die einen Beweis von $P$ und einen Beweis von $Q$ nimmt und einen Beweis von $P$ zurückgibt. Wir denken an unser Ziel als $P\land Q\implies P$ und sehen, warum es beweisbar ist. ## Hast du es bemerkt? Ich habe `P → (Q → P)` geschrieben, aber Lean schreibt nur `P → Q → P`. Das liegt daran, dass Informatiker die Konvention benutzen, dass `→` rechtsassoziativ ist. Das ist wieder nur eine schlaue Art zu sagen: " wenn wir `P → Q → R` schreiben, dann meinen wir `P → (Q → R)` " Mathematiker würden niemals auch nur davon träumen etwas so zweideutiges wie $P\implies Q\implies R$ zu schreiben. (Sie sind ohnehin nicht daran interessiert so abstrakte Aussagen zu beweisen. Sie arbeiten lieber mit konkreten Aussagen wie Fermats letztem Satz. Es gibt also keine Konvention, wohin die Klammern kommen. Es ist aber wichtig sich zu merken, dass Lean eine Konvention hat, oder man wird verwirrt. Wenn dein Ziel `P → Q → R` ist, dann musst du wissen, dass `intro h` entweder `h : P` oder `h : P → Q` erzeugt. Vergewissere dich, dass du das richtige gedacht hast.

source: # Proposition world. ## Level 6: `(P → (Q → R)) → ((P → Q) → (P → R))`. You can solve this level completely just using `intro`, `apply` and `exact`, but if you want to argue forwards instead of backwards then don't forget that you can do things like `have j : Q → R := f p` if `f : P → (Q → R)` and `p : P`. I recommend that you start with `intro f` rather than `intro p` because even though the goal starts `P → ...`, the brackets mean that the goal is not the statement that `P` implies anything, it's the statement that $P\implies (Q\implies R)$ implies something. In fact I'd recommend that you started with `intros f h p`, which introduces three variables at once. You then find that your your goal is `⊢ R`. If you try `have j : Q → R := f p` now then you can `apply j`. Alternatively you can `apply (f p)` directly. What happens if you just try `apply f`? Can you figure out what just happened? This is a little `apply` easter egg. Why is it mathematically valid?
de: # Welt der Aussagen. ## Level 6: `(P → (Q → R)) → ((P → Q) → (P → R))`. Du kannst dieses Level komplett lösen, indem du nur `intro`, `apply`, und `exact` verwendest. Aber wenn du vorwärts statt rückwärts argumentieren willst, dann vergiss nicht, dass du zum Beispiel `have j : Q → R := f p` if `f : P → (Q → R)` verwenden kannst oder `p : P`. Ich empfehle, dass du mit `intro f` anstelle von `intro p`beginnst. Das liegt daran, dass das Ziel zwar mit `P → ...` beginnt, die Klammern aber bedeuten, dass das Ziel nicht ist, dass die Aussage $P$ irgendetwas impliziert. Tatsächlich würde ich sogar empfehlen mit `intros f h p` zu beginnen, was alle drei Variablen auf einmal einführt. Dein Ziel ist dann `⊢ R`. Wenn du `have j : Q → R := f p`versuchst, dann kannst du `apply j` verwenden. Allternativ funktioniert auch `apply (f p)` direkt. Was passiert, wenn du nur `apply f` versuchst? Kannst du dir vorstellen, was gerade passiert ist? Es ist ein kleines `apply` easter egg. Warum ist es mathematisch sinnvoll?

source: If $P$ and $Q$ and $R$ are true/false statements, then $$(P\implies(Q\implies R))\implies((P\implies Q)\implies(P\implies R)).$$
de: Wenn $P$, $Q$ und $R$ Wahr/Falsch Aussagen sind, dann gilt:$$(P\implies(Q\implies R))\implies((P\implies Q)\implies(P\implies R)).$$

source: # Function world. ## Level 7: `(P → Q) → ((Q → R) → (P → R))` If you start with `intro hpq` and then `intro hqr` the dust will clear a bit and the level will look like this: ``` P Q R : Prop, hpq : P → Q, hqr : Q → R ⊢ P → R ``` So this level is really about showing transitivity of $\implies$, if you like that sort of language.
de: # Welt der Aussagen. ## Level 7: `(P → Q) → ((Q → R) → (P → R))` Wenn du mit `intro hpq` und dann `intro hqr` beginnst, wird sich der Rauch etwas lichten und das Level sieht so aus: ``` P Q R : Prop, hpq : P → Q, hqr : Q → R ⊢ P → R ``` Das Level beschäftigt sich also mit der Transitivität von $\implies$, wenn du diese Art der Sprache magst.

source: From $P\implies Q$ and $Q\implies R$ we can deduce $P\implies R$.
de: Aus $P\implies Q$ und $Q\implies R$ können wir $P\implies R$ folgern.

source: # Proposition world. ## Level 8 : `(P → Q) → (¬ Q → ¬ P)` There is a false proposition `false`, with no proof. It is easy to check that $\lnot Q$ is equivalent to $Q\implies {\tt false}$, and in the natural number game we call this `not_iff_imp_false (P : Prop) : ¬ P ↔ (P → false)` So you can start the proof of the contrapositive below with `repeat {rw not_iff_imp_false},` to get rid of the two occurences of `¬`, and I'm sure you can take it from there (note that we just added `not_iff_imp_false` to the theorem statements in the menu on the left). At some point your goal might be to prove `false`. At that point I guess you must be proving something by contradiction. Or are you?
de: # Welt der Aussagen. ## Level 8 : `(P → Q) → (¬ Q → ¬ P)` Es gibt eine falsche Aussage `faksch`, ohne einen Beweis. Es ist leicht einzusehen, dass $\lnot Q$ äquivalent zu $Q\implies {\tt false}$ ist. Im Spiel der natürlichen Zahlen nennen wir das: `not_iff_imp_false (P : Prop) : ¬ P ↔ (P → false)` Wir können den Beweis der Kontraposition unten also starten: `repeat {rw not_iff_imp_false},` Wir werden damit das zweimalige Auftreten von `¬` los. Ich bin sicher, dass du es von hier aus schaffst. (Beachte, dass wir `not_iff_imp_false`zu den vorhandenen Aussagen im Menü links hinzugefügt haben. Eventuell wird es an einem bestimmten Punkt dein Ziel sein `falsch`zu beweisen. Dann musst du offensichtlich etwas durch Widerspruch beweisen, wirklich?

source: If $P$ and $Q$ are propositions, and $P\implies Q$, then $\lnot Q\implies \lnot P$.
de: Sind $P$ und $Q$ Aussagen und gilt $P \implies Q$, dann gilt auch: $\lnot Q\implies \lnot P$.

source: ## Technical note All of that rewriting you did with `rw` in addition world was rewriting hypothesis of the form `h : X = Y`, but you can also `rw h` if `h : P ↔ Q` (because propositional extensionality says that if $P\iff Q$ then $P=Q$, and mathematicians use this whether or not they notice.)
de: ## Technische Anmerkung: Das Umschreiben mit `rw` in der Welt der Addition hat Hypothesen der Form `h : X = Y` umgeschrieben. Man kann aber auch `rw h` schreiben, wenn gilt: `h : P ↔ Q` (Das liegt daran, dass aus $P\iff Q$ auch $P=Q$ folgt. Mathematiker benutzen das, sogar wenn sie es nicht bemerken.)

source: # Proposition world. ## Level 9: a big maze. Lean's "congruence closure" tactic `cc` is good at mazes. You might want to try it now. Perhaps I should have mentioned it earlier.
de: # Welt der Aussagen. ## Level 9: ein großes Labyrintg. Lean's "congruence closure" Taktik ist gut für Labyrinthe. Du könntest sie jetzt ausprobieren. Vielleicht hätte ich sie früher erwähnen sollen $\ldots$

source: There is a way through the following maze.
de: Es gibt einen Weg durch das folgende Labyrinth.

source: Now move onto advanced proposition world, where you will see how to prove goals such as `P ∧ Q` ($P$ and $Q$), `P ∨ Q` ($P$ or $Q$), `P ↔ Q` ($P\iff Q$). You will need to learn five more tactics: `split`, `cases`, `left`, `right`, and `exfalso`, but they are all straightforward, and furthermore they are essentially the last tactics you need to learn in order to complete all the levels of the Natural Number Game, including all the 17 levels of Inequality World.
de: Es geht jetzt mit der forgeschrittenen Welt der Aussagen weiter, dort wirst du sehen, wie Ziele der Form `P ∧ Q` ($P$ and $Q$) bewiesen werden können, oder auch `P ∨ Q` ($P$ or $Q$), `P ↔ Q` ($P\iff Q$). Du musst dazu fünf weitere Taktiken lernen: `split`, `cases`, `left`, `right` und `exfalso`. Sie sind aber alle recht geradlinig und außerdem im Prinzip die letzten Taktiken, die du lernen musst, um alle Level des Spiels zu bewältigen, inklusive der 17 Level der Welt der Ungleichungen.

source: Advanced Proposition world
de: Fortgeschrittene Welt der Aussagen

source: # Advanced proposition world. In this world we will learn five key tactics needed to solve all the levels of the Natural Number Game, namely `split`, `cases`, `left`, `right`, and `exfalso`. These, and `use` (which we'll get to in Inequality World) are all the tactics you will need to beat all the levels of the game. ## Level 1: the `split` tactic. The logical symbol `∧` means "and". If $P$ and $Q$ are propositions, then $P\land Q$ is the proposition "$P$ and $Q$". If your *goal* is `P ∧ Q` then you can make progress with the `split` tactic, which turns one goal `⊢ P ∧ Q` into two goals, namely `⊢ P` and `⊢ Q`. In the level below, after a `split`, you will be able to finish off the goals with the `exact` tactic.
de: # Fortgeschrittene Welt der Aussagen. In dieser Welt lernen wir fünf weitere Schlüsseltaktiken, die benötigt werden, um alle Level des Spiels zu lösen, nämlich `split`, `cases`, `left`, `right` und `exfalso`. Na ja, diese Taktiken und `use` (das in der Welt der Ungleichheit eingeführt wird) ## Level 1: die `split` Taktik. Das logische Symbol `∧` bedeutet "und". Wenn $P$ und $Q$ Aussagen sind, dann ist $P\land Q$ die Aussage "$P$ und $Q$". Wenn dein *Ziel* `P ∧ Q` ist, dann kannst du mit der `split`Taktik Fortschritte machen, da sie Ziele der Form `⊢ P ∧ Q` in zwei Ziele teilt, nämlich `⊢ P` und `⊢ Q` Im untenstehenden Level wirst du nach dem `split` alle Ziele mit `exact` lösen können.

source: If $P$ and $Q$ are true, then $P\land Q$ is true.
de: Wenn $P$ und $Q$ wahr sind, dann ist $P\land Q$ wahr.

source: ## Summary: If the goal is `P ∧ Q` or `P ↔ Q` then `split` will break it into two goals. ## Details If `P Q : Prop` and the goal is `⊢ P ∧ Q`, then `split` will change it into two goals, namely `⊢ P` and `⊢ Q`. If `P Q : Prop` and the goal is `⊢ P ↔ Q`, then `split` will change it into two goals, namely `⊢ P → Q` and `⊢ Q → P`. ## Example: If your local context (the top right window) looks like this ``` a b : mynat, ⊢ a = b ↔ a + 3 = b + 3 ``` then after `split,` it will look like this: ``` 2 goals a b : mynat ⊢ a = b → a + 3 = b + 3 a b : mynat ⊢ a + 3 = b + 3 → a = b
de: ## Zusammenfassung: Wenn das Ziel `P ∧ Q` oder `P ↔ Q` ist, dann wird `split` diese in zwei Teilziele zerlegen. ## Details Wenn gilt: `P Q : Prop` und `⊢ P ∧ Q`, dann wird `split` es in zwei Ziele zerlegen, nämlich `⊢ P` und `⊢ Q`. Wenn gilt: `P Q : Prop` und `⊢ P ↔ Q`, dann wird `split` es in zwei Ziele zerlegen, nämlich `⊢ P → Q` und `⊢ Q → P`. ## Beispiel: Wenn dein lokaler Kontext (rechts oben) so aussieht: ``` a b : mynat, ⊢ a = b ↔ a + 3 = b + 3 ``` dann wird `split,` es in folgendes zerlegen: ``` 2 goals a b : mynat ⊢ a = b → a + 3 = b + 3 a b : mynat ⊢ a + 3 = b + 3 → a = b

source: # Advanced proposition world. ## Level 2: the `cases` tactic. If `P ∧ Q` is in the goal, then we can make progress with `split`. But what if `P ∧ Q` is a hypothesis? In this case, the `cases` tactic will enable us to extract proofs of `P` and `Q` from this hypothesis. The lemma below asks us to prove `P ∧ Q → Q ∧ P`, that is, symmetry of the "and" relation. The obvious first move is `intro h,` because the goal is an implication and this tactic is guaranteed to make progress. Now `h : P ∧ Q` is a hypothesis, and `cases h with p q,` will change `h`, the proof of `P ∧ Q`, into two proofs `p : P` and `q : Q`. From there, `split` and `exact` will get you home.
de: Fortgeschrittene Welt der Aussagen. ## Level 2: die `cases` Taktik. Wenn das Ziel `P ∧ Q` ist, dann können wir mit `split` Fortschritte machen. Was ist aber, wenn `P ∧ Q` eine Hypothese ist? In diese Fall kann die `cases`Taktik weiterhelfen und uns ermöglichen, Beweise von `P`und `Q` aus dieser Hypothese zu extrahieren. Das untenstehende Lemma lässt uns `P ∧ Q → Q ∧ P` beweisen. Dies entspricht der Symmetrie der "und" Relation. Es geht logischerweise los mit: `intro h,` Das Ziel eine Implikation ist und diese Taktik macht garantiert Fortschritte. Jetzt ist `h : P ∧ Q` eine Hypothese und `cases h with p q,` wird das `h` verändern. Der Beweis von `P ∧ Q` wird in zwei Beweise geteilt. `p : P` und `q : Q`. Von hier aus sind `split` und `exact` ausreichend.

source: If $P$ and $Q$ are true/false statements, then $P\land Q\implies Q\land P$.
de: Wenn $P$ und $Q$ Wahr/Falsch Aussagen sind, dann gilt $P\land Q\implies Q\land P$.

source: ## Summary: `cases` is a tactic which works on hypotheses. If `h : P ∧ Q` or `h : P ↔ Q` is a hypothesis then `cases h with h1 h2` will remove `h` from the list of hypotheses and replace it with the "ingredients" of `h`, i.e. `h1 : P` and `h2 : Q`, or `h1 : P → Q` and `h2 : Q → P`. Also works with `h : P ∨ Q` and `n : mynat`. ## Details How does one prove `P ∧ Q`? The way to do it is to prove `P` and to prove `Q`. There are hence two ingredients which go into a proof of `P ∧ Q`, and the `cases` tactic extracts them. More precisely, if the local context contains ``` h : P ∧ Q` ``` then after the tactic `cases h with p q,` the local context will change to ``` p : P, q : Q ``` and `h` will disappear. Similarly `h : P ↔ Q` is proved by proving `P → Q` and `Q → P`, and `cases h with hpq hqp` will delete our assumption `h` and replace it with ``` hpq : P → Q, hqp : Q → P ``` Be warned though -- `rw h` works with `h : P ↔ Q` (`rw` works with `=` and `↔`), whereas you cannot rewrite with an implication. `cases` also works with hypotheses of the form `P ∨ Q` and even with `n : mynat`. Here the situation is different however. To prove `P ∨ Q` you need to give either a proof of `P` *or* a proof of `Q`, so if `h : P ∨ Q` then `cases h with p q` will change one goal into two, one with `p : P` and the other with `q : Q`. Similarly, each natural is either `0` or `succ(d)` for `d` another natural, so if `n : mynat` then `cases n with d` also turns one goal into two, one with `n = 0` and the other with `d : mynat` and `n = succ(d)`.
de: ## Zusammenfassung: `cases` ist eine Taktik, die für Hypothesen geeignet ist. Wenn `h : P ∧ Q` oder h : P ↔ Q` eine Hypothese ist, dann wird `cases h with h1 h2` das `h` entfernen und es mit den "Zutaten" von `h` ersetzen, also z.B. `h1 : P` und `h2 : Q oder `h1 : P → Q` und `h2 : Q → P`. Es funktioniert auch mit `h : P ∨ Q` und `n : mynat`. ## Details Wie beweist man `P ∧ Q`? Um das zu erreichen muss man `P` und `Q` beweisen. Es gibt deswegen zwei Zutaten, die wir in den Beweis stecken und die `cases` Taktik extrahiert diese. Noch genauer, wenn der Kontext ``` h : P ∧ Q` ``` enthält, dann wird die Taktik `cases h with p q,` den Kontext wie folgt verändern: ``` p : P, q : Q ``` `h` ist verschwunden! `h : P ↔ Q` wird ganz ähnlich bewiesen, indem man `P → Q` und `Q → P` verwendet. Wendet man dann `cases h with hpq hqp` an, wird unsere Annahme `h` verschwinden und durch ``` hpq : P → Q, hqp : Q → P ``` ersetzt werden. Aber sei gewarnt -- `rw h` funktioniert mit `h : P ↔ Q` (`rw ` kann allgemein mit `= `und `↔` funktionieren!), allerdings nicht mit Implikationen! `cases` kann auch Hypothesen der Form `P ∨ Q` und sogar `n : mynat` auflösen. Hier ist die Situation aber eine andere. Um `P ∨ Q` zu beweisen muss ein Beweis für `P` *oder* ein Beweis von `Q` gefunden werden. Wenn also `h : P ∨ Q` gilt, dann wird `cases h with p q` ein Ziel in zwei verwandeln: `p : P` und `q : Q` Ähnlich gesehen ist jede natürliche Zahl entweder `0` oder `succ(d)` für eine andere natürliche Zahl `d`. Wenn also gilt `n : mynat`, dann wird `cases n with d` ein Ziel in zwei verwandeln: `n = 0` und `d : mynat` mit `n = succ(d)`.

source: # Advanced proposition world. ## Level 3: and_trans.
de: # Fortgeschrittene Welt der Aussagen. ## Level 3: and_trans.

source: If $P$, $Q$ and $R$ are true/false statements, then $P\land Q$ and $Q\land R$ together imply $P\land R$.
de: Wenn $P$, $Q$ und $R$ Wahr/Falsch Aussagen sind, dann implizieren $P\land Q$ und $Q\land R$ together imply $P\land R$.

source: # Advanced proposition world. ## Level 4: `iff_trans`. The mathematical statement $P\iff Q$ is equivalent to $(P\implies Q)\land(Q\implies P)$. The `cases` and `split` tactics work on hypotheses and goals (respectively) of the form `P ↔ Q`. If you need to write an `↔` arrow you can do so by typing `\iff`, but you shouldn't need to. After an initial `intro h,` you can type `cases h with hpq hqp` to break `h : P ↔ Q` into its constituent parts.
de: # Fortgeschrittene Welt der Aussagen. ## Level 4: `iff_trans`. Die mathematische Aussage $P\iff Q$ ist äquivalent zu $(P\implies Q)\land(Q\implies P)$ Die `cases` und `split` Taktiken operieren auf Hypothesen und Zielen der Form `P ↔ Q` Wenn du einen `↔` Pfeil schreiben willst kannst du das mit `\iff`. Du solltest das aber gar nicht müssen. Nach einem ersten `intro h,` kannst du mit `cases h with hpq hqp` weitermachen, um `h : P ↔ Q` in seine Teile aufzuteilen.

source: If $P$, $Q$ and $R$ are true/false statements, then $P\iff Q$ and $Q\iff R$ together imply $P\iff R$.
de: Wenn $P$, $Q$ und $R$ Wahr/Falsch Aussagen sind, dann implizieren $P\iff Q$ und $Q\iff R$ zusammen $P\iff R$.
