Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Inequality world. A new import, giving us a new definition. If `a` and `b` are naturals, `a ≤ b` is *defined* to mean `∃ (c : mynat), b = a + c` The upside-down E means "there exists". So in words, $a\le b$ if and only if there exists a natural $c$ such that $b=a+c$. If you really want to change an `a ≤ b` to `∃ c, b = a + c` then you can do so with `rw le_iff_exists_add`: ``` le_iff_exists_add (a b : mynat) : a ≤ b ↔ ∃ (c : mynat), b = a + c ``` But because `a ≤ b` is *defined as* `∃ (c : mynat), b = a + c`, you do not need to `rw le_iff_exists_add`, you can just pretend when you see `a ≤ b` that it says `∃ (c : mynat), b = a + c`. You will see a concrete example of this below. A new construction like `∃` means that we need to learn how to manipulate it. There are two situations. Firstly we need to know how to solve a goal of the form `⊢ ∃ c, ...`, and secondly we need to know how to use a hypothesis of the form `∃ c, ...`. ## Level 1: the `use` tactic. The goal below is to prove $x\le 1+x$ for any natural number $x$. First let's turn the goal explicitly into an existence problem with `rw le_iff_exists_add,` and now the goal has become `∃ c : mynat, 1 + x = x + c`. Clearly this statement is true, and the proof is that $c=1$ will work (we also need the fact that addition is commutative, but we proved that a long time ago). How do we make progress with this goal? The `use` tactic can be used on goals of the form `∃ c, ...`. The idea is that we choose which natural number we want to use, and then we use it. So try `use 1,` and now the goal becomes `⊢ 1 + x = x + 1`. You can solve this by `exact add_comm 1 x`, or if you are lazy you can just use the `ring` tactic, which is a powerful AI which will solve any equality in algebra which can be proved using the standard rules of addition and multiplication. Now look at your proof. We're going to remove a line. ## Important An important time-saver here is to note that because `a ≤ b` is *defined* as `∃ c : mynat, b = a + c`, you *do not need to write* `rw le_iff_exists_add`. The `use` tactic will work directly on a goal of the form `a ≤ b`. Just use the difference `b - a` (note that we have not defined subtraction so this does not formally make sense, but you can do the calculation in your head). If you have written `rw le_iff_exists_add` below, then just put two minus signs `--` before it and comment it out. See that the proof still compiles.
de: # Welt der Ungleichheit. Ein neuer Import gibt uns eine neue Definition. Wenn `a`und `b` natürliche Zahlen sind, dann ist `a ≤ b` *definiert* als `∃ (c : mynat), b = a + c` Das umgekehrte E bedeutet "ex existiert", also bedeutet $a\le b$ in Prinzip: a ist kleiner als b, genau dann wenn es eine natürliche Zahl $c$ gibt, mit $b=a+c$. Wenn du wirklich ein `a ≤ b` verwandeln willst in `∃ c, b = a + c`, dann kannst du das mit `rw le_iff_exists_add` erledigen: ``` le_iff_exists_add (a b : mynat) : a ≤ b ↔ ∃ (c : mynat), b = a + c ``` Da `a ≤ b` aber als `∃ (c : mynat), b = a + c` *definiert ist* musst du `rw le_iff_exists_add` nicht verwenden, sondern einfach annehmen, dass dort `∃ (c : mynat), b = a + c` steht. Ein genaues Beispiel steht unten. Ein neuer Operator wie `∃` bedeutet, dass wir lernen müssen ihn zu manipulieren. Es gibt zwei Situationen. Die eine ist: wir müssen wissen, wie wir ein Ziel der Form `⊢ ∃ c, ...` erfüllen können, und die zweite ist: wir müssen wissen, wie wir eine Hypothese der Form `∃ c, ...` verwenden. ## Level 1: die `use` Taktik. Das Ziel in diesem Level ist es, $x\le 1+x$ für eine beliebge natürliche Zahl $x$ zu beweisen. Lass uns zuerst das Ziel in ein Existenzproblem verändern: `rw le_iff_exists_add,` Jetzt haben wir: `∃ c : mynat, 1 + x = x + c`. Diese Aussage ist offensichtlich wahr und der Beweis $c=1$ wird funktionieren (wir brauchen auch die Tatsache, dass die Addition kommutativ ist, aber wir haben das schon lange bewiesen). Wie geht es jetzt aber weiter? Die `use` Taktik kann auf Ziele der Form `∃ c, ...` angewendet werden. Die Idee ist, dass wir die natürliche Zahl auswählen, die wir verwenden wollen. Versuch: `use 1,` Jetzt haben wir das Ziel `⊢ 1 + x = x + 1`. Weiter geht es mit `exact add_comm 1 x`, oder wenn du faul bist kannst du die `ring` Taktik verwenden, die eine mächtige künstliche Intelligenz ist, die eine beliebige Gleichheit der Algebra lösen kann, die mit den klassischen Regeln der Addition und Multiplikation bewiesen werden kann. Sieh dir jetzt den Beweis an. Wir werden eine Zeile entfernen. ## Important ## Wichtig Um Zeit zu sparen brauchen wir hier nicht `rw le_iff_exists_add` zu schreiben, da `a ≤ b` als `∃ c : mynat, b = a + c` *definiert ist*. Die `use`Taktik arbeitet direkt auf einem Ziel der Form `a ≤ b`. Verwende die Differenz `b-a` (wir haben die Subtraktion nicht definiert, also macht es formal keinen Sinn, aber du kannst die Berechnung auch im Kopf durchführen). Wenn du `rw le_iff_exists_add` verwendet hast, dann schreibe zwei Minus- zeichen davor und kommentiere es aus. Der Beweis kompiliert immer noch!

source: If $x$ is a natural number, then $x\le 1+x$.
de: Ist $x$ eine natürliche Zahl, dann gilt $x\le 1+x$.

source: # Inequality world. Here's a nice easy one. ## Level 2: le_refl
de: # Welt der Ungleichheit. Hier kommt ein schönes, leichtes Level. ## Level 2: le_refl

source: The $\le$ relation is reflexive. In other words, if $x$ is a natural number, then $x\le x$.
de: Die $\le$ Relation ist reflexiv. Mit anderen Worten: ist $x$ eine natürliche Zahl, dann gilt: $x\le x$.

source: ## Upgrading the `refl` tactic Now with the following incantation (NB thanks to master wizard Reid Barton for correcting my spell)...
de: ## Verbesserung der `refl` Taktik Mit der folgenden Beschwörung (Vielen Dank an den Erzmagier Reid Barton für die Verbesserung des Spruchs)...

source: ...we find that the `refl` tactic will close all goals of the form `a ≤ a` as well as all goals of the form `a = a`.
de: ... erfahren wir, dass die `refl` Taktik alle Ziele der Form `a ≤ a` und `a=a` erfüllen kann.

source: ## Pro tip Did you skip `rw le_iff_exists_add` in your proof of `le_refl` above? Instead of `rw add_zero` or `ring` or `exact add_zero x` at the end there, what happens if you just try `refl`? The *definition* of `x + 0` is `x`, so you don't need to `rw add_zero` either! The proof ``` use 0, refl, ``` works. The same remarks are true of `add_succ`, `mul_zero`, `mul_succ`, `pow_zero` and `pow_succ`. All of those theorems are true *by definition*. The same is *not* true however of `zero_add`; the theorem `0 + x = x` was proved by induction on `x`, and in particular it is not true by *definition*. Definitional equality is of great importance to computer scientists, but mathematicians are much more fluid with their idea of a definition -- a concept can simultaneously have three equivalent definitions in a maths talk, as long as they're all logically equivalent. In Lean, a definition is *one thing*, and definitional equality is a subtle concept which depends on exactly which definition you chose. `add_comm` is certainly not true by definition, which means that if we had decided to define `a ≤ b` by `∃ c, b = c + a` (rather than `a + c`) all the same theorems would be true, but `refl` would work in different places. `refl` closes a goal of the form `X = Y` if `X` and `Y` are definitionally equal.
de: ## Profi Tipp Hast du `rw le_iff_exists_add` in deinem beweis für `le_refl` pbersprungen= Wenn du statt `rw add_zero` oder ` ring` oder `exact_zero x` am Ende nur `refl` verwendest, was passiert dann? Die Definition von `x+0`ist ?x?, also brauchst du auch kein `rw add_zero`! Folgender Beweis funktioniert: ``` use 0, refl, ``` Dasselbe gilt auch für `add_succ`, `mul_zero` , `pow_zero` und `pow_succ`. Alle diese Sätze sind wahr nach *Definition*. Das gleiche gilt aber *nicht* für `zero_add`; Der Satz `0+x=x` wurde durch Induktion über `x` bewiesen, es ist also nicht wahr nur nach der *Definition*. Die Gleichheit nach Definition ist von großer Bedeutung für Informatiker, aber Mathematiker sehen dies etwas weniger strikt -- ein Konzept kann gleichzeitig drei äquivalente Definitionen in der Mathematik haben, solange diese auch logisch äquivalent sind. In Lean ist eine Definition *eine* Sache. Und die die Gleichheit nach Definition ist ein subtiles Konzept, das auf der Definition basiert, die gewählt wurde. `add_comm`z.B. ist sicherlich nicht nach Definition wahr, was bedeutet, dass wir auch `a ≤ b` durch `∃ c, b = c + a` hätten definieren können (Im Gegensatz zu `a + c`). Dann wären alle Sätze immer noch wahr, aber `refl` würde an anderen Stellen verwendet werden. `refl` erfüllt ein Ziel der Form `X = Y` wenn `X` und `Y`gleich sind nach Definition.

source: # Inequality world. ## Level 3: `le_succ_of_le` We have seen how the `use` tactic makes progress on goals of the form `⊢ ∃ c, ...`. But what do we do when we have a *hypothesis* of the form `h : ∃ c, ...`? The hypothesis claims that there exists some natural number `c` with some property. How are we going to get to that natural number `c`? It turns out that the `cases` tactic can be used (just like it was used to extract information from `∧` and `∨` and `↔` hypotheses). Let me talk you through the proof of $a\le b\implies a\le\operatorname{succ}(b)$. The goal is an implication so we clearly want to start with `intro h,` . After this, if you *want*, you can do something like `rw le_iff_exists_add at h ⊢,` (get the sideways T with `\|-` then space). This changes the `≤` into its `∃` form in `h` and the goal -- but if you are happy with just *imagining* the `∃` whenever you read a `≤` then you don't need to do this line. Our hypothesis `h` is now `∃ (c : mynat), b = a + c` (or `a ≤ b` if you elected not to do the definitional rewriting) so `cases h with c hc,` gives you the natural number `c` and the hypothesis `hc : b = a + c`. Now use `use` wisely and you're home.
de: # Welt der Ungleichheit. ## Level 3: `le_succ_of_le` Wir haben gesehen, dass die `use` Taktik gute Fortschritte macht bei Zielen von der Form `⊢ ∃ c, ...`. Aber was, wenn wir eine *Hypothese* dieser Form haben. Die Hypothese behauptet dann, dass es eine natürliche Zahl `c` gibt, die eine gewisse Eigenschaft erfüllt. Wie bekommen wir diese speziele natürliche Zahl `c`? Hier kann auch wieder die `cases` Taktik verwendet werden (genau so, wie sie schon beim Extrahieren von Information aus `∧`, `∨` und `↔` Hypothesen verwendet wurde). Sehen wir uns den Beweis von $a\le b\implies a\le\operatorname{succ}(b)$ an. Das Ziel ist eine Implikation, also starten wir mit `intro h,` Danach kannst du, wenn du *willst*, folgendes machen: `rw le_iff_exists_add at h ⊢,` (das "gekippte T" bekommst du mit `\|-` und dann Eingabe). Das wird das `≤` in die `∃` Form bringen, sowohl in der Hypothese als auch im Ziel -- aber wenn du damit zufrieden bist, dir das `∃` *vorzustellen*, wenn du ein `≤` liest, dann brauchst du diese Zeile nicht. Unsere Hypothese `h` sieht jetzt so aus: `∃ (c : mynat), b = a + c` (oder `a ≤ b`, wenn du das Umschreiben nach Definition nicht verwendet hast. Weiter geht es mit: `cases h with c hc,` Jetzt haben wir die natürliche Zahl `c` und die Hypothese `hc : b = a + c`. Verwende jetzt `use` weise und du bist am Ziel.

source: For all naturals $a$, $b$, if $a\leq b$ then $a\leq \operatorname{succ}(b)$.
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: ist $a\leq b$, dann ist $a\leq \operatorname{succ}(b)$.

source: Did you use `succ c` or `c + 1` or `1 + c`? Those numbers are all equal, right? So it doesn't matter which one you use, right? Here's an interesting question. If you copy the proof below into the box above, and then fill in the `???` below with `succ c`, will this proof compile? (move your cursor to after the final comma to see what Lean thinks). What about if you `use 1 + c`? What about if you `use c + 1`? Can you work out what is going on? Does it help if I tell you that the *definition* of `1` is `succ 0`? ``` theorem le_succ (a b : mynat) : a ≤ b → a ≤ (succ b) := begin [nat_num_game] intro h, cases h with c hc, rw hc, use ???, refl, end ```
de: Hast du `succ c` oder `c+1` oder `1+c` verwendet? All diese Zahlen sind identisch, oder? Es spielt also keine Rolle, welche man verwendet, oder? Eine interessante Frage: wenn du den Beweis unten in die Box oben kopierst und dann die `???` mit `succ c` ersetzt, wird der Beweis kompilieren? (Bewege deine Maus hinter die letzte Zeile, um zu sehen, was Lean denkt). Was passiert wenn du `use 1 + c` verwendest? Oder `use c + 1`? Kannst du herausfinden, was passiert?. Vielleicht hilft es zu verstehen, dass die *Definition* von `1` gerade `succ 0` ist. of `1` is `succ 0`? ``` theorem le_succ (a b : mynat) : a ≤ b → a ≤ (succ b) := begin [nat_num_game] intro h, cases h with c hc, rw hc, use ???, refl, end ```

source: # Inequality world. ## Level 4: `zero_le` Another easy one.
de: # Welt der Ungleichheit. ## Level 4: `zero_le` Noch ein einfaches Level.

source: For all naturals $a$, $0\leq a$.
de: Für alle natürlichen Zahlen $a$ gilt $0\leq a$.

source: # Inequality world. ## Level 5: `le_trans` Another straightforward one.
de: # Welt der Ungleichheit. ## Level 5: `le_trans` Geradeaus durch!.

source: ≤ is transitive. In other words, if $a\leq b$ and $b\leq c$ then $a\leq c$.
de: ≤ ist transitiv. Mit anderen Worten, wenn $a\leq b$ und $b\leg c$ gilt, dann gilt auch $a \leq c$.

source: Congratulations -- you just got a collectible. You proved that the natural numbers are a preorder.
de: Herzlichen Glückwunsch -- du hast gerade etwas für die Sammlung bekommen. Du hast bewiesen, dass die natürlichen Zahlen eine Quasiordnung sind.

source: # Inequality world. ## Level 6: `le_antisymm` In Advanced Addition World you proved `eq_zero_of_add_right_eq_self (a b : mynat) : a + b = a → b = 0`. This might be useful in this level. Another tip: if you want to create a new hypothesis, you can use the `have` tactic. For example, if you have a hypothesis `hd : a + (c + d) = a` and you want a hypothesis `h : c + d = 0` then you can write `have h := eq_zero_of_add_right_eq_self hd,`
de: # Welt der Ungleichheit. ## Level 6: `le_antisymm` In der fortgeschrittenen Welt der Addition hast du folgendes bewiesen: `eq_zero_of_add_right_eq_self (a b : mynat) : a + b = a → b = 0`. Das könnte dir hier nützen! Noch ein Tipp: wenn du eine neue Hypothese erzeugen willst, kannst du `have` benutzen. Zum Beispiel: wenn du die Hypothese `hd : a + (c + d) = a` hast und noch eine der Form `h : c + d = 0` haben willst, dann kannst du schreiben: `have h := eq_zero_of_add_right_eq_self hd,`

source: $\le$ is antisymmetric. In other words, if $a\le b$ and $b\le a$ then $a = b$.
de: $\le$ ist antisymmetrisch. Mit anderen Worten: gilt $a\le b$ und $b\le a$, dann ist$a=b$.

source: Congratulations -- you just proved that the natural numbers are a partial order!
de: Glückwunsch -- du hast gerade bewiesen, dass die natürlichen Zahlen partiell geordnet sind!

source: # Inequality world ## Level 7: `le_zero` We proved `add_right_eq_zero` back in advanced addition world. Remember that you can do things like `have h2 := add_right_eq_zero h1` if `h1 : a + c = 0`.
de: # Welt der Ungleichheit. ## Level 7: `le_zero` Wir haben in der fortgeschrittenen Welt der Addition `add_right_eq_zero` bewiesen. Denk daran, dass du folgendes tun kannst: `have h2 := add_right_eq_zero h1`, wenn gilt: `h1 : a + c = 0`.

source: For all naturals $a$, if $a\le 0$ then $a = 0$.
de: Für alle natürlichen zahlen $a$ gilt: ist $a\le 0$, dann ist $a=0$- "

source: # Inequality world. ## Level 8: `succ_le_succ` Another straightforward one.
de: # Welt der Ungleichheit. ## Level 8: `succ_le_succ` Wieder eins der Art: mit dem Kopf durch die Tür.

source: For all naturals $a$ and $b$, if $a\le b$, then $\operatorname{succ}(a)\le\operatorname{succ}(b)$.
de: Für alle natürlichen zahlen $a$ und $b$ gilt: ist $a\le b$, dann gilt: $\operatorname{succ}(a)\le \operatorname{succ}(b)$.

source: # Inequality world. ## Level 9: `le_total`
de: # Welt der Ungleichheit. ## Level 9: `le_total`

source: For all naturals $a$ and $b$, either $a\le b$ or $b\le a$.
de: Für alle natürlichen Zahlen $a$ und $b$ gilt entweder $a\le b$ oder $b\le a$.

source: -- Another collectible: the naturals are a linear order.
de: -- Wieder eine Trophäe: die natürlichen Zahlen sind total geordnet.

source: # Inequality world. ## Level 10: `le_succ_self` Can you find the two-line proof?
de: # Welt der Ungleichheit. ## Level 10: `le_succ_self` Kannst du den Zweizeiler für diesen beweis finden?

source: For all naturals $a$, $a\le\operatorname{succ}(a).$
de: Für alle natürlichen Zahlen $a$ gilt: $a\le\operatorname{succ}(a).$

source: # Inequality world. ## Level 11: `add_le_add_right` If you're faced with a goal of the form `forall t, ...`, then the next line is "so let $t$ be arbitrary". The way to do this in Lean is `intro t`.
de: # Welt der Ungleichheit. ## Level 11: `add_le_add_right` Wenn du mit einem Ziel der Form `forall t, ...` konfrontiert wirst, dann sollte die nächste Zeile "lass $t$ beliebig sein" lauten. Das kannst du mit `intro t` erreichen .

source: For all naturals $a$ and $b$, $a\le b$ implies that for all naturals $t$, $a+t\le b+t$.
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $a\le b$ impliziert, dass für alle natürlichen Zahlen $t$ gilt: $a+t\le b+t$.

source: # Inequality world. ## Level 12: `le_of_succ_le_succ`
de: # Welt der Ungleichheit. ## Level 12: `le_of_succ_le_succ`

source: For all naturals $a$ and $b$, $\operatorname{succ}(a)\le\operatorname{succ}(b)\implies a\le b.$
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $\operatorname{succ}(a)\le\operatorname{succ}(b)\implies a\le b.$

source: # Inequality world. ## Level 13: `not_succ_le_self` Turns out that `¬ P` is *by definition* `P → false`, so you can just start this one with `intro h` if you like. ## Pro tip: ``` conv begin to_lhs, rw hc, end, ``` is an incantation which rewrites `hc` only on the left hand side of the goal. Look carefully at the commas. You don't need to use `conv` to solve this, but it's a helpful trick when `rw` is rewriting too much.
de: # Welt der Ungleichheit. ## Level 13: `not_succ_le_self` Wir wissen, dass `¬ P` *nach Definition* gleich `P → false` ist. Du kannst hier also einfach mit `intro h` starten, wenn du möchtest. ## Profi Tipp: ``` conv begin to_lhs, rw hc, end, ``` Das ist eine Beschwörung, die `hc` nur auf der linken Seite des Ziels umschreibt. Schau dir die Kommata genau an. Du brauchst `conv` nicht, um das zu lösen, aber es ist ein nütlicher Trick, wenn `rw` zuviel umschreibt.

source: For all naturals $a$, $\operatorname{succ}(a)$ is not at most $a$.
de: Für alle natürlichen Zahlen $a$ ist $\operatorname{succ}(a)$ nicht höchstens $a$.

source: # Inequality world. ## Level 14: `add_le_add_left` I know these are easy and we've done several already, but this is one of the axioms for an ordered commutative monoid! The nature of formalising is that we should formalise all "obvious" lemmas, and then when we're actually using $\le$ in real life, everything will be there. Note also, of course, that all of these lemmas are already formalised in Lean's maths library already, for Lean's inbuilt natural numbers.
de: # Welt der Ungleichheit. ## Level 14: `add_le_add_left` Ich weiß, dass dieses Level einfach ist und wir davon schon einige gemacht haben. Dieses Level ist aber eines der Axiome für einen geordneten, kommutativen Monoiden! Es liegt in der Natur des Formalisierens, dass wir alle "offensichtlichen" Lemmata formalisieren sollten. Wenn wir dann tatsächlich $\le$ verwenden, sind alle Werkzeuge da. Beachte natürliche auch, dass alle diese Lemmata schon in Leans mathlib formalisiert sind, für die eingebauten natürlichen Zahlen.

source: If $a\le b$ then for all $t$, $t+a\le t+b$.
de: Ist $a\le b$, dann gilt für alle $t$: $t+a\le t+b$.

source: --import mynat.lt -- definition of <
de: -- import mynat.lt -- die Definition von <

source: # Inequality world. ## Level 15: introducing `<` To get the remaining collectibles in this world, we need to give a definition of `<`. By default, the definition of `a < b` in Lean, once `≤` is defined, is this: `a < b := a ≤ b ∧ ¬ (b ≤ a)` . But a much more usable definition would be this: `a < b := succ(a) ≤ b` . Let's prove that these two definitions are the same
de: # Welt der Ungleichheit. ## Level 15: das neue `<` Um die restlichen Trophäen dieser Welt einsammeln zu können, brauchen wir eine Definition für `<`. Standardmäßig ist die Definition von `a < b` in Lean (wenn `≤` definiert ist): `a < b := a ≤ b ∧ ¬ (b ≤ a)` Noch nützlicher ist aber folgende Definition: `a < b := succ(a) ≤ b` Lass uns beweisen, dass diese beiden Definitionen äquivalent sind.

source: For all naturals $a$ and $b$, $$a\le b\land\lnot(b\le a)\implies\operatorname{succ}(a)\le b.$$
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $$a\le b\land\lnot(b\le a)\implies\operatorname{succ}(a)\le b.$$

source: # Inequality world. ## Level 16: equivalence of two definitions of `<` Now let's go the other way.
de: # Welt der Ungleichheit. ## Level 16: Äquivalenz der zwei Definitionen von `<` Jetzt die andere Richtung.

source: For all naturals $a$ and $b$, $$ \operatorname{succ}(a)\le b \implies a\le b\land\lnot(b\le a).$$
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $$ \operatorname{succ}(a)\le b \implies a\le b\land\lnot(b\le a).$$

source: Now for the payoff.
de: Und jetzt holen wir unseren Preis ab.

source: # Inequality world. ## Level 17: definition of `<` OK so we are going to *define* `a < b` by `a ≤ b ∧ ¬ (b ≤ a)`, and given `lt_aux_one a b` and `lt_aux_two a b` it should now just be a few lines to prove `a < b ↔ succ(a) ≤ b`.
de: # Welt der Ungleichheit. ## Level 17: Die Definition von `<` Endlichen werden wir `a < b` durch `a ≤ b ∧ ¬ (b ≤ a)` *definieren* . Da wir auch schon `lt_aux_one a b` und `lt_aux_two a b` haben, sollte es nur ein paar Zeilen Arbeit erfordern, dass `a < b ↔ succ(a) ≤ b` gilt.

source: -- incantation so that we can use `<` notation:
de: -- eine Beschwörung, sodass wir die `<` Notation benutzen können:

source: For all naturals $a$ and $b$, $$a<b\iff\operatorname{succ}(a)\le b.$$
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $$a<b\iff\operatorname{succ}(a)\le b.$$

source: For now -- that's it. In the next version of the natural number game we will go on and make the natural numbers into an `ordered_cancel_comm_monoid`, which is the most exotic of all the structures defined on the natural numbers in Lean 3.4.2. Interested in playing levels involving other kinds of mathematics? Look <a href="https://github.com/ImperialCollegeLondon/natural_number_game/blob/master/WHATS_NEXT.md" target="blank">here</a> for more ideas about what to do next. Interested in learning more? Join us on the <a href="https://leanprover.zulipchat.com/" target="blank">Zulip Lean chat</a> and ask questions in the `#new members` stream. Real names preferred. Be nice.
de: Und jetzt -- wars das. In der nächsten Version des Spiels werden wir weitergehen und die natürlichen Zahlen in einen `ordered_cancel_comm_monoid` verwandeln, was der exotischsten aller Strukturen entspricht, die auf den natürlichen Zahlen in Lean 3.4.2 definiert sind. Wenn du daran interessiert bist andere Level zu speielen, die eine andere Art von Mathematik behandeln, dann sieh doch <a href="https://github.com/ImperialCollegeLondon/natural_number_game/blob/master/WHATS_NEXT.md" target="blank">hier</a> nach, wenn du Ideen brauchst wo es hingehen soll. Willst du mehr lernen? Dann tritt unserem <a href="https://leanprover.zulipchat.com/" target="blank">Zulip Lean chat</a> bei. Du kannst Fragem im `new members`stream stellen. Reale Namen werden bevorzugt. Sei nett!
