Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Function world. ## Level 6: `(P → (Q → R)) → ((P → Q) → (P → R))`. You can solve this level completely just using `intro`, `apply` and `exact`, but if you want to argue forwards instead of backwards then don't forget that you can do things like `have j : Q → R := f p,` if `f : P → (Q → R)` and `p : P`. Remember the trick with the colon in `have`: we could just write `have j := f p,` but this way we can be sure that `j` is what we actually expect it to be. I recommend that you start with `intro f` rather than `intro p` because even though the goal starts `P → ...`, the brackets mean that the goal is not a function from `P` to anything, it's a function from `P → (Q → R)` to something. In fact you can save time by starting with `intros f h p`, which introduces three variables at once, although you'd better then look at your tactic state to check that you called all those new terms sensible things. After all the intros, you find that your your goal is `⊢ R`. If you try `have j : Q → R := f p` now then you can `apply j`. Alternatively you can `apply (f p)` directly. What happens if you just try `apply f`? Can you figure out what just happened? This is a little `apply` easter egg. Why is it mathematically valid?
de: # Welt der Funktionen ## Level 6: `(P → (Q → R)) → ((P → Q) → (P → R))`. Du kannst diese Level komplett mit `intro`, `apply` und `exact` lösen. Wemm du vorwärts statt rückwärts argumentieren willst, dann vergiss nicht, dass du auch solche Dinge tun kannst: `have j : Q → R := f p,` if `f : P → (Q → R)` and `p : P`. Denk an den Trick mit dem Doppelpunkt in `have`: Wir könnten nur `have j := f p,` schreiben, aber andernfalls können wir sicher sein, dass `j` genau das ist, was wir auch erwarten. Ich empfehle, dass du mit `intro f` startest und nicht mit `intro p`. Das Ziel startet zwar mit `P → ...`, die Klammern bedeuten aber, dass das Ziel keine Funktion von `P` irgendwohin ist, sondern eine Funktion von `P → (Q → R)` irgendwohin! Tatsächlich kannst du dir Zeit sparen, indem du mit `intros f h p` startest. Dadurch werden drei Variablen auf einmal erzeugt, allerdings solltest du besser genau hinsehen und überprüfen, ob alle diese neuen Terme wirklich vernünftige Dinge sind. Nach den ganzen Intros ist unser Ziel `⊢ R`. Wenn du `have j : Q → R := f p` versuchst, kannst du danach `apply j` schreiben. Alternativ funktioniert auch `apply (f p)` direkt. Was passiert, wenn du nur `apply f` versuchst? Kannst du dir vorstellen, was gerade passiert ist? Es ist ein kleines `apply` easter egg. Warum ist es mathematisch sinnvoll?

source: Whatever the sets $P$ and $Q$ and $R$ are, we make an element of $\operatorname{Hom}(\operatorname{Hom}(P,\operatorname{Hom}(Q,R)), \operatorname{Hom}(\operatorname{Hom}(P,Q),\operatorname{Hom}(P,R)))$.
de: Seien $P$ und $Q$ und $R$ beliebige Mengen, dann bauen wir ein Element von $\operatorname{Hom}(\operatorname{Hom}(P,\operatorname{Hom}(Q,R)), \operatorname{Hom}(\operatorname{Hom}(P,Q),\operatorname{Hom}(P,R)))$.

source: # Function world. ## Level 7: `(P → Q) → ((Q → F) → (P → F))` Have you noticed that, in stark contrast to earlier worlds, we are not amassing a large collection of useful theorems? We really are just constructing abstract levels with sets and functions, and then solving them and never using the results ever again. Here's another one, which should hopefully be very easy for you now. Advanced mathematician viewers will know it as contravariance of $\operatorname{Hom}(\cdot,F)$ functor.
de: # Welt der Funktionen. ## Level 7: `(P → Q) → ((Q → F) → (P → F))` Hast du bemerkt, dass wir im Gegensatz zu früheren Welten kein große Menge an nützlichen Sätzen angefhäuft haben? We haben eigentlich nur abstrakte Level mit Mengen und Funktionen bearbeitet und diese dann gelöst, ohne auf die vorhergehenden Ergebnisse Bezug zu nehmen. Hier ist jetzt ein weiteres Problem, dass hofentlich sehr einfach für dich ist. Fortgeschrittene Mathematiker werden es natürlich als die Kontravarianz des $\operatorname{Hom}(\cdot,F)$ Funktors erkennen.

source: Whatever the sets $P$ and $Q$ and $F$ are, we make an element of $\operatorname{Hom}(\operatorname{Hom}(P,Q), \operatorname{Hom}(\operatorname{Hom}(Q,F),\operatorname{Hom}(P,F)))$.
de: Seien $P$, $Q$ und $F$ beliebige Mengen, dann bauen wir Element von $\operatorname{Hom}(\operatorname{Hom}(P,Q), \operatorname{Hom}(\operatorname{Hom}(Q,F),\operatorname{Hom}(P,F)))$.

source: # Function world. ## Level 8: `(P → Q) → ((Q → empty) → (P → empty))` Level 8 is the same as level 7, except we have replaced the set $F$ with the empty set $\emptyset$. The same proof will work (after all, our previous proof worked for all sets, and the empty set is a set). But note that if you start with `intro f, intro h, intro p,` (which can incidentally be shortened to `intros f h p`), then the local context looks like this: ``` P Q : Type, f : P → Q, h : Q → empty, p : P ⊢ empty ``` and your job is to construct an element of the empty set! This on the face of it seems hard, but what is going on is that our hypotheses (we have an element of $P$, and functions $P\to Q$ and $Q\to\emptyset$) are themselves contradictory, so I guess we are doing some kind of proof by contradiction at this point? However, if your next line is `apply h` then all of a sudden the goal seems like it might be possible again. If this is confusing, note that the proof of the previous world worked for all sets $F$, so in particular it worked for the empty set, you just probably weren't really thinking about this case explicitly beforehand. [Technical note to constructivists: I know that we are not doing a proof by contradiction. But how else do you explain to a classical mathematician that their goal is to prove something false and this is OK because their hypotheses don't add up?]
de: # Welt der Funktionen. ## Level 8: `(P → Q) → ((Q → empty) → (P → empty))` Level 9 ist im Prinzip dasselbe Level wie Level 7. Wir haben aber die Menge $F$ mit der leeren menge $\emptyset$ ersetzt. Der Beweis wird genau wie vorher funktionieren. (Unser vorheriger Beweis hat schließlich für alle Mengen funktioniert und die leere Menge ist eine Menge!) Beachte aber, dass der lokale Kontext wie folgt aussieht, wenn du mit `intro f, intro h, intro p,` (kurz `intros f h p`) beginnst: ``` P Q : Type, f : P → Q, h : Q → empty, p : P ⊢ empty ``` Dein Job ist es jetzt, ein Element der leeren Menge zu konstruieren! Das sieht, wieder einmal, recht kompliziert aus, aber was wirklich passiert ist, dass unsere Hypothesen (wir haben ein Element von $P$ und Funktionen $P \to Q$ und $Q \to \emptyset$) in sich schon widersprüchlich sind. Wir führen also einen Beweis durch Widerspruch an dieser Stelle? Sollte deine nächste Zeile `apply h`sein, dann sieht dein Ziel plötzlich wieder machbar aus. Sollte dich das verwirren, dann beachte, dass der Beweis der vorherigen Welt für alle Mengen $F$ funktioniert hat. Insbesondere also auch für die leere Menge, wir haben nur nicht an diesen Fall direkt gedacht! [Technische Notiz für Konstruktivisten: Ich weiß, dass wir hier nicht wirklich einen Beweis durch Widerspruch durchführen. Aber wie sollte man sonst einem klassischen Mathematiker erklären, dass es ihr Ziel ist, etwas falsches zu beweisen und das es in Ordnung ist, weil ihre Hypothesen nicht zusammenpassen?]

source: Whatever the sets $P$ and $Q$ are, we make an element of $\operatorname{Hom}(\operatorname{Hom}(P,Q), \operatorname{Hom}(\operatorname{Hom}(Q,\emptyset),\operatorname{Hom}(P,\emptyset)))$.
de: Seien $P$ und $Q$ beliebige Mengen, dann bauen wir ein Element von $\operatorname{Hom}(\operatorname{Hom}(P,Q), \operatorname{Hom}(\operatorname{Hom}(Q,\emptyset),\operatorname{Hom}(P,\emptyset)))$.

source: # Function world. ## Level 9: a big maze. I asked around on Zulip and apparently there is not a tactic for this, perhaps because this level is rather artificial. In world 6 we will see a variant of this example which can be solved by a tactic. It would be an interesting project to make a tactic which could solve this sort of level in Lean. You can of course work both forwards and backwards, or you could crack and draw a picture.
de: # Welt der Funktionen. ## Level 9: ein großes Labyrinth. I habe auf Zulip herumgefragt und scheinbar gibt es keine Taktik hierfür. Vielleicht liegt es daran, dass dieses Level eher künstlich ist. In Welt Nummer 6 werden wir eine Variante dieses Beispiels sein, das mit einer Taktik lösbar ist. Es wäre ein interessantes Projekt, eine Taktik zu entwickeln, die diese Art Level in Lean lösen kann. Du kannst natürlich vorwärts oder rückwärts arbeiten, oder aufgeben und ein Bild malen!

source: Given a bunch of functions, we can define another one.
de: Haben wir einige Funktionen, so können wir eine neue definieren.

source: That's the end of Function World! Next it's Proposition world, and the tactics you've learnt in Function World are enough to solve all nine levels! In fact, the levels in Proposition world might look strangely familiar$\ldots$.
de: Dies ist das Ende der Welt der Funktionen! Als nächstes sind wir in der Welt der Aussagen und die Taktiken, die du in der Welt der Funktionen gelernt hast, sind ausreichend, um alle neun Level zu lösen! Tatsächlich sollten die Level seltsam bekannt aussehen $\ldots$.

source: Proposition world
de: Welt der Aussagen

source: # Proposition world. A Proposition is a true/false statement, like `2 + 2 = 4` or `2 + 2 = 5`. Just like we can have concrete sets in Lean like `mynat`, and abstract sets called things like `X`, we can also have concrete propositions like `2 + 2 = 5` and abstract propositions called things like `P`. Mathematicians are very good at conflating a theorem with its proof. They might say "now use theorem 12 and we're done". What they really mean is "now use the proof of theorem 12..." (i.e. the fact that we proved it already). Particularly problematic is the fact that mathematicians use the word Proposition to mean "a relatively straightforward statement which is true" and computer scientists use it to mean "a statement of arbitrary complexity, which might be true or false". Computer scientists are far more careful about distinguishing between a proposition and a proof. For example: `x + 0 = x` is a proposition, and `add_zero x` is its proof. The convention we'll use is capital letters for propositions and small letters for proofs. In this world you will see the local context in the following kind of state: ``` P : Prop p : P ``` Here `P` is the true/false statement (the statement of proposition), and `p` is its proof. It's like `P` being the set and `p` being the element. In fact computer scientists sometimes think about the following analogy: propositions are like sets, and their proofs are like their elements. ## What's going on in this world? We're going to learn about manipulating propositions and proofs. Fortunately, we don't need to learn a bunch of new tactics -- the ones we just learnt (`exact`, `intro`, `have`, `apply`) will be perfect. The levels in proposition world are "back to normal", we're proving theorems, not constructing elements of sets. Or are we? If you delete the sorry below then your local context will look like this: ``` P Q : Prop, p : P, h : P → Q ⊢ Q ``` In this situation, we have true/false statements $P$ and $Q$, a proof $p$ of $P$, and $h$ is the hypothesis that $P\implies Q$. Our goal is to construct a proof of $Q$. It's clear what to do *mathematically* to solve this goal, $P$ is true and $P$ implies $Q$ so $Q$ is true. But how to do it in Lean? Adopting a point of view wholly unfamiliar to many mathematicians, Lean interprets the hypothesis $h$ as a function from proofs of $P$ to proofs of $Q$, so the rather surprising approach `exact h(p),` works to close the goal. Note that `exact h(P),` (with a capital P) won't work; this is a common error I see from beginners. "We're trying to solve `P` so it's exactly `P`". The goal states the *theorem*, your job is to construct the *proof*. $P$ is not a proof of $P$, it's $p$ that is a proof of $P$. In Lean, Propositions, like sets, are types, and proofs, like elements of sets, are terms. ## Level 1: the `exact` tactic.
de: # Proposition world. Eine Aussage kann wahr oder falsch sein, wie `2 + 2 = 4` oder `2 + 2 = 5`. Genauso wie wir konkrete Mengen in Lean haben können wie `mynat`und abstrakte Mengen wie `X`, können wir auch konkrete Aussagen haben wie `2 + 2 = 5` und abstrakte Aussagen wie `P` Mathematiker sind sehr gut darin, ihre Sätze mit dem Beweis zu verschmelzen. Sie sagen zum Beispiel: "Wir verwenden jetzt Satz 12 und sind fertig " Was sie aber wirklich meinen ist: "Jetzt verwenden wir den Beweis von Satz 12 und sind fertig " (also die Tatsache, dass dieser Satz schon bewiesen ist!) Die Tatsache, dass Mathematiker das Wort Aussage im Sinne von " es ist eine Aussage von beliebiger Komplexität, die wahr oder falsch ist" verwenden ist besonders problematisch. Informatiker sind in der Regel wesentlich vorsichtiger in dieser Beziehung. Zum Beispiel: `x+0=x` ist eine Aussage und `add_zero x' ist der Beweis. Wir werden die Konvention verwenden, dass Großbuchstaben für Aussagen und Kleinbuchstaben für Beweise stehen. In dieser Welt wird der lokale Kontext oft so aussehen: ``` P : Prop p : P ``` `P` ist dabei die Wahr/Falsch Aussage und `p` der zugehörige Beweis. Es ist wie mit der Menge `P` und dem Element der Menge `p`. Tatsächlich ist für Informatiker die folgende Analogie oft sehr nützlich: Aussagen sind wie Mengen und Beweise sind wie deren Elemente. ## Was passiert in dieser Welt? Wir werden lernen, wie wir Aussagen und Beweise manipulieren können. Glücklicherweise müssen wir keine neuen Taktiken lernen -- die Taktiken Aus der Welt der Funktionen sind perfekt (`exact`, `intro`, `have`, `apply`). n Die Level in der Welt der Aussagen sind wieder "wie gewohnt ". Wir beweisen Sätze und konstruieren keine Elemente von Mengen... oder doch? Wenn du das sorry löscht, dann wird dein Kontext so aussehen: ``` P Q : Prop, p : P, h : P → Q ⊢ Q ``` In dieser Situation haben wir die Wahr/Falsch Aussagen $P$ und $Q$. Außerdem einen Beweis $p$ von $P$ und eine Hypothese $h$, die aussagt $P \implies Q$ Unser Ziel ist ein Beweis von $q$. Es ist also klar, was zu tun ist! Zumindest aus mathematischer Sichtweise, wenn $P$ wahr ist und aus $P$ auch $Q$ folgt, dann ist $Q$ automatisch wahr. Wie funktioniert das aber in Lean? Wir stellen uns auf einen Standpunkt, der für viele Mathematiker völlig ungewohnt ist. Lean interpretiert die Hypothese $h$ als eine Funktion, die von den Beweisen von $P$ in die Beweise von $Q$ abbildet, der überraschende Ansatz `exact h(p),` bringt uns also nahe ans Ziel! Beachte, dass `exact h(P)` (mit einem großen P) nicht funktioniert; Es ist wieder ein üblicher Fehler von Anfängern "Wir versuchen `P` zu beweisen, also ist es exact `P` ". Das Ziel zeigt den *Satz*, dein Job ist es den *Beweis* zu konstruieren. $P$ ist kein beweis von $P$, sondern $p$. In Lean sind Aussagen, wie Mengen, Typen und Beweise, wie Elemente von Mengen, sind Terme. ## Level 1: die `exact` Taktik.

source: If $P$ is true, and $P\implies Q$ is also true, then $Q$ is true.
de: Wenn $P$ waht ist und $P \implies Q$ ebenfalls wahr ist, dann ist $Q$ wahr.

source: # Proposition world. ## Level 2: `intro`. Let's prove an implication. Let $P$ be a true/false statement, and let's prove that $P\implies P$. If you delete the `sorry` you will see that our goal is `P → P`. Constructing a term of type `P → P` (which is what solving this goal *means*) in this case amounts to proving that $P\implies P$, and computer scientists think of this as coming up with a function which sends proofs of $P$ to proofs of $P$. To define an implication $P\implies Q$ we need to choose an arbitrary proof $p : P$ of $P$ and then, perhaps using $p$, construct a proof of $Q$. The Lean way to say "let's assume $P$ is true" is `intro p`, i.e., "let's assume we have a proof of $P$". ## Note for worriers. Those of you who know something about the subtle differences between truth and provability discovered by Goedel -- these are not relevant here. Imagine we are working in a fixed model of mathematics, and when I say "proof" I actually mean "truth in the model", or "proof in the metatheory". ## Rule of thumb: If your goal is to prove `P → Q` (i.e. that $P\implies Q$) then `intro p`, meaning "assume $p$ is a proof of $P$", will make progress. To solve the goal below, you have to come up with a function from `P` (thought of as the set of proofs of $P$!) to itself. Start with `intro p,` (i.e. "let $p$ be a proof of $P$") and note that our local context now looks like this: ``` P : Prop, p : P ⊢ P ``` Our job now is to construct a proof of $P$. But $p$ is a proof of $P$. So `exact p,` will close the goal. Note that `exact P` will not work -- don't confuse a true/false statement (which could be false!) with a proof. We will stick with the convention of capital letters for propositions and small letters for proofs.
de: # Welt der Aussagen. ## Level 2: `intro`. Lass uns eine Implikation beweisen. Sei $P$ eine Wahr/Falsch Aussage. Wir wollen beweisen, dass $P\implies P$ gilt. Wenn du das sorry löscht, dann wirst du sehen, dass unser Ziel `P → P` lautet. Einen Term vom Typ `P → P` zu konstruieren (das ist es, was es *bedeutet*, dieses Ziel zu erfüllen) ist in diesem Fall gleichbedeutend damit zu beweisen, dass $P \implies P$ gilt. Informatiker würden denken: wir suchen eine Funktion, die die Beweise von $P$ auf die Beweise von $P$ abbildet. Um eine Implikation $P\implies Q$ zu definieren brauchen wir einen beliebigen Beweis $p : P$ von $P$ und dann, vielleicht unter Verwendung von $p$, konstruieren wir einen Beweis von $Q$. Lean sagt "lass uns annehmen, dass $P$ wahr ist" mit `intro p`, also etwa "Wir nehmen an, wir haben einen Beweis für $P$". ## Anmerkung für alle Besorgten. An diejenigen von euch, die etwas über die subtilen Unterschiede zwischen Wahrheit und Beweisbarkeit, die von Goedel entdeckt wurden, wissen -- sie sind hier nicht relevant. Wir können uns vorstellen, dass wir in einem fixierten Modell der Mathematik arbeiten und wenn ich "Beweis" sage, dann meine ich eigentlich "wahr innerhalb meines Modells", oder "Beweis in der Metatheorie". Daumenregel: Wenn es dein Ziel ist `P → Q` (also z.B. $P\implies Q$) zu beweisen, dann ist `intro p`ein guter Start, da es bedeutet: "Wir nehmen an, dass $p$ ein Beweis von $P$ ist". Um untenstehendes Ziel jetzt zu lösen, musst du eine Funktion von `P` (also der Menge aller Beweise von $P$!) in sich selbst entwickeln. Beginne mit: `intro p,` (z.B.: "sei $p$ ein Beweis von $P$") und beachte, dass unser lokaler Kontext dann wie folgt aussieht: ``` P : Prop, p : P ⊢ P ``` Unser Job ist es jetzt einen Beweis von $P$ zu konstruieren. Aber $p$ ist schon ein Beweis von $P$, also: `exact p,` Das reicht schon um das Ziel zu erfüllen! Beachte, dass `exact P`wieder nicht funktioniert -- verwechsle eine Wahr/Falsch Aussage (die falsch sein könnte!) nicht mit einem Beweis! Wir werden die Konvention mit den Großbuchstaben für Aussagen und den Kleinbuchstaben für Beweise fortfahren.

source: If $P$ is a proposition then $P\implies P$.
de: Wenn $P$ eine Aussage ist, dann gilt $P\implies P$.

source: # Proposition world. ## Level 3: `have`. Say you have a whole bunch of propositions and implications between them, and your goal is to build a certain proof of a certain proposition. If it helps, you can build intermediate proofs of other propositions along the way, using the `have` command. `have q : Q := ...` is the Lean analogue of saying "We now see that we can prove $Q$, because..." in the middle of a proof. It is often not logically necessary, but on the other hand it is very convenient, for example it can save on notation, or it can break proofs up into smaller steps. In the level below, we have a proof of $P$ and we want a proof of $U$; during the proof we will construct proofs of of some of the other propositions involved. The diagram of propositions and implications looks like this pictorially: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/implies_diag.jpg) and so it's clear how to deduce $U$ from $P$. Indeed, we could solve this level in one move by typing `exact l(j(h(p))),` But let us instead stroll more lazily through the level. We can start by using the `have` tactic to make a proof of $Q$: `have q := h(p),` and then we note that $j(q)$ is a proof of $T$: `have t : T := j(q),` (note how we explicitly told Lean what proposition we thought $t$ was a proof of, with that `: T` thing before the `:=`) and we could even define $u$ to be $l(t)$: `have u : U := l(t),` and then finish the level with `exact u,` .
de: # Welt der Aussagen. ## Level 3: `have`. Wir nehmen an, dass wir einige Aussagen und Implikationen zwischen ihnen haben. Unser Ziel ist es, einen Beweis einer bestimmten Aussagen zu konstruieren. Wenn es dir hilft, kannst du Zwischenbeweise für andere Aussagen konstruieren. Dazu kannst du wieder `have` verwenden. `have q : Q := ...` ist Leans Art zu sagen: "Wir können jetzt $Q$ beweisen, weil..." während wir etwas anderes beweisen. Es ist häufig nicht logisch notwendig, aber auf der anderen Seite ist es sehr praktisch. Es kann z.B. einiges an Notation sparen oder den Beweis in kleinere Teile teilen. Im untenstehenden Level haben wir einen Beweis von $P$ und wir wollen einen Beweis von $U$; während des Beweises werden wir Beweise für einige andere Aussagen konstruieren, die involviert sind. Das Diagramm der Aussagen und Implikationen sieht so aus: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/implies_diag.jpg) Es ist also klar, wie wir $U$ aus $P$ ableiten können. Wir könnten das Level leicht in einem Schritt lösen: `exact l(j(h(p))),` Aber lass uns etwas langsamer durch das Level wandern. Wir beginnen, indem wir die `have`Taktik verwenden, um einem Beweis von $Q$ zu erzeugen: `have q := h(p),` Dann können wir sehen, dass $j(q)$ ein Beweis von $T$ ist: `have t : T := j(q),` (Beachte, dass wir Lean explizit gesagt haben, welche Aussage zum Beweis $t$ gehört mit dem `: T` Ding vor dem `:=`) Wir könnten sogar definieren: `have u : U := l(t),` und dann das Level beenden mit: `exact u,`

source: In the maze of logical implications above, if $P$ is true then so is $U$.
de: Im Labyrinth der obigen logischen Implikationen gilt: wenn $P$ wahr ist, dann ist auch $U$ wahr.

source: If you solved the level using `have`, then click on the last line of your proof (you do know you can move your cursor around with the arrow keys and explore your proof, right?) and note that the local context at that point is in something like the following mess: ``` P Q R S T U : Prop, p : P, h : P → Q, i : Q → R, j : Q → T, k : S → T, l : T → U, q : Q, t : T, u : U ⊢ U ``` It was already bad enough to start with, and we added three more terms to it. In level 4 we will learn about the `apply` tactic which solves the level using another technique, without leaving so much junk behind.
de: Wenn du das Level mit `have` gelöst hast, dann klicke in die letzten Zeile deines Beweises. (Du erinnerst dich, dass du die Pfeiltasten nutzen kannst, um deinen Beweis zu erkunden, oder?) Der Kontext dieser letzten Zeile sieht etwa so aus: ``` P Q R S T U : Prop, p : P, h : P → Q, i : Q → R, j : Q → T, k : S → T, l : T → U, q : Q, t : T, u : U ⊢ U ``` Es war am Anfang schon schlimm, aber wir haben drei weitere Terme ergänzt! In Level 4 werden wir lernen, wie die `apply` Taktik funktioniert. So kann man das Level einfacher lösen, ohne soviel Müll zurückzulassen.
