Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Advanced Addition World ## Level 5: `add_right_cancel` The theorem `add_right_cancel` is the theorem that you can cancel on the right when you're doing addition -- if `a + t = b + t` then `a = b`. After `intro h` I'd recommend induction on `t`. Don't forget that `rw add_zero at h` can be used to do rewriting of hypotheses rather than the goal.
de: # Fortgeschrittene Welt der Addition ## Level 5: `add_right_cancel` Der Satz `add_right_cancel` ist ein Satz über das "Kürzen" auf der rechten Seite einer Addition -- wenn `a + t = b + t` gilt, dann ist `a = b`. Nach dem `intro` solltest du eine Induktion über `t` durchführen. Vergiss nicht `rw add_zero at h`, hiermit kannst du deine Hypothesen umschreiben anstelle deines Ziels.

source: On the set of natural numbers, addition has the right cancellation property. In other words, if there are natural numbers $a, b$ and $c$ such that $$ a + t = b + t, $$ then we have $a = b$.
de: In der Menge der natürlichen Zahlen hat die Addition die Eigenschaft des Kürzens auf der rechten Seite. Mit anderen Worten: Wenn wir natürliche Zahlen $a,b$ und $t$ haben mit $$ a + t = b + t,$$ dann gilt $a = b$.

source: # Advanced Addition World ## Level 6: `add_left_cancel` The theorem `add_left_cancel` is the theorem that you can cancel on the left when you're doing addition -- if `t + a = t + b` then `a = b`. There is a three-line proof which ends in `exact add_right_cancel a t b` (or even `exact add_right_cancel _ _ _`); this strategy involves changing the goal to the statement of `add_right_cancel` somehow.
de: # Fortgeschrittene Welt der Addition ## Level 6: `add_left_cancel` Der Satz `add_left_cancel` ist ein Satz über das "Kürzen" auf der linken Seite einer Addition -- wenn `t + a = t + b` gilt, dann ist `a = b`. Es gibt einen Dreizeiler als Beweis, der mit `exact add_right_cancel a t b` endet (oder sogar `exact add_right_cancel _ _ _`). Diese Strategie beinhaltet das Ändern des Ziels zur Aussage von `add_right_cancel`.

source: On the set of natural numbers, addition has the left cancellation property. In other words, if there are natural numbers $a, b$ and $t$ such that $$ t + a = t + b, $$ then we have $a = b$.
de: In der Menge der natürlichen Zahlen hat die Addition die Eigenschaft des Kürzens auf der linken Seite. Mit anderen Worten: Wenn wir natürliche Zahlen $a,b$ und $t$ haben mit $$ t + a = t + b,$$ dann gilt $a = b$.

source: # Advanced Addition World ## Level 7: `add_right_cancel_iff` It's sometimes convenient to have the "if and only if" version of theorems like `add_right_cancel`. Remember that you can use `split` to split an `↔` goal into the `→` goal and the `←` goal. ## Pro tip: `exact add_right_cancel _ _ _` means "let Lean figure out the missing inputs"
de: # Fortgeschrittene Welt der Addition ## Level 7: `add_right_cancel_iff` Es ist manchmal praktisch die "genau dann wenn" Variante von Sätzen wie `add_right_cancel` zu haben. Denk daran, dass du solche Ziele mit `split` in ein `→` und ein `←` Ziel verwandeln kannst. ## Profi Tipp: `exact add_right_cancel _ _ _`bedeutet "Lass Lean die fehlenden Eingaben herausfinden"

source: For all naturals $a$, $b$ and $t$, $$ a + t = b + t\iff a=b. $$
de: Für alle natürlichen Zahlen $a$, $b$ und $t$ gilt: $$ a + t = b + t\iff a=b. $$

source: # Advanced Addition World ## Level 8: `eq_zero_of_add_right_eq_self` The lemma you're about to prove will be useful when we want to prove that $\leq$ is antisymmetric. There are some wrong paths that you can take with this one.
de: # Fortgeschrittene Welt der Addition ## Level 8: `eq_zero_of_add_right_eq_self` Das folgende Lemma wird nützlich sein, wenn wir \leq$ is antisymmetric beweisen werden. Es gibt hier einige falsche Wege die du nehmen könntest.

source: If $a$ and $b$ are natural numbers such that $$ a + b = a, $$ then $b = 0$.
de: Sind $a$ und $b$ natürliche Zahlen mit $$ a + b = a$$ dann gilt $b = 0$.

source: ## Summary `symmetry` turns goals of the form `⊢ A = B` to `⊢ B = A`. Also works with `≠`. Also works on hypotheses: if `h : a ≠ b` then `symmetry at h` gives `h : b ≠ a`. ## Details `symmetry` works on both goals and hypotheses. By default it works on the goal. It will turn a goal of the form `⊢ A = B` to `⊢ B = A`. More generally it will work with any symmetric binary relation (for example `≠`, or more generally any binary relation whose proof of symmetry has been tagged with the `symm` attribute). To get `symmetry` working on a hypothesis, use `symmetry at h`. ## Examples If the tactic state is ``` h : a = b ⊢ c ≠ d ``` then `symmetry` changes the goal to `⊢ d ≠ c` and `symmetry at h` changes `h` to `h : b = a`.
de: ## Zusammenfassung `symmetry` bringt Ziele `⊢ A = B` in die Form `⊢ B = A`. Es funktioniert auch mit `≠` und Hypothesen: gilt `h : a ≠ b`, dann liefert `symmetry at h` `h : b ≠ a`. ## Details `symmetry` funktioniert mit Zielen und Hypothesen. Standardmäßig allerdings verändert es das Ziel. Es wird ein Ziel der Form `⊢ A = B` zu `⊢ B = A` umwandeln. Allgemeiner: es funktioniert mit beliebigen binären Relationen (z.B. `≠`, oder noch allgemeiner eine beliebige binäre binäre Relation deren Beweis der Symmetrie mit dem `symm` Attribut versehen wurde). Um `symmetry` auf Hypothesen anzuwenden verwende: `symmetry at h`. ## Examples Wenn unser Zustand so aussieht: ``` h : a = b ⊢ c ≠ d ``` dann wird `symmetry` das Ziel zu `⊢ d ≠ c` umwandeln und `symmetry at h` bring `h` in die Form `h : b = a`.

source: # Advanced Addition World ## Level 9: `succ_ne_zero` Levels 9 to 13 introduce the last axiom of Peano, namely that $0\not=\operatorname{succ}(a)$. The proof of this is called `zero_ne_succ a`. `zero_ne_succ (a : mynat) : 0 ≠ succ(a)` The `symmetry` tactic will turn any goal of the form `R x y` into `R y x`, if `R` is a symmetric binary relation (for example `=` or `≠`). In particular, you can prove `succ_ne_zero` below by first using `symmetry` and then `exact zero_ne_succ a`.
de: # Fortgeschrittene Welt der Addition ## Level 9: `succ_ne_zero` Die Level 9 bis 13 werden das letzte Axiom von Pean einführen, nämlich dass gilt: $0\not=\operatorname{succ}(a). Dieser Beweis heißt $`zero_ne_succ a`. `zero_ne_succ (a : mynat) : 0 ≠ succ(a)` Die `symmetry` Taktik wird jedes Ziel der Form `R x y` in `R y x` verwandeln, wenn `R` eine symmetrische binäre Relation ist (also z.B. `=` oder `≠`). Insbesondere kannst du `succ_ne_zero` lösen, indem du zuerst `symmetry` verwendest und dann `exact zero_ne_succ a`.

source: Zero is not the successor of any natural number.
de: Null ist kein Nachfolger einer natürlichen Zahl.

source: # Advanced Addition World ## Level 10: `add_left_eq_zero` ## Important: the definition of `≠` In Lean, `a ≠ b` is *defined to mean* `(a = b) → false`. This means that if you see `a ≠ b` you can *literally treat it as saying* `(a = b) → false`. Computer scientists would say that these two terms are *definitionally equal*. The following lemma, $a+b=0\implies b=0$, will be useful in inequality world. Let me go through the proof, because it introduces several new concepts: * `cases b`, where `b : mynat` * `exfalso` * `apply succ_ne_zero` We're going to prove $a+b=0\implies b=0$. Here is the strategy. Each natural number is either `0` or `succ(d)` for some other natural number `d`. So we can start the proof with `cases b with d,` and then we have two goals, the case `b = 0` (which you can solve easily) and the case `b = succ(d)`, which looks like this: ``` a d : mynat, H : a + succ d = 0 ⊢ succ d = 0 ``` Our goal is impossible to prove. However our hypothesis `H` is also impossible, meaning that we still have a chance! First let's see why `H` is impossible. We can `rw add_succ at H,` to turn `H` into `H : succ (a + d) = 0`. Because `succ_ne_zero (a + d)` is a proof that `succ (a + d) ≠ 0`, it is also a proof of the implication `succ (a + d) = 0 → false`. Hence `succ_ne_zero (a + d) H` is a proof of `false`! Unfortunately our goal is not `false`, it's a generic false statement. Recall however that the `exfalso` command turns any goal into `false` (it's logically OK because `false` implies every proposition, true or false). You can probably take it from here.
de: # Fortgeschrittene Welt der Addition ## Level 10: `add_left_eq_zero` ## Wichtig: Die Definition von `≠` In Lean ist `a ≠ b` *definiert* als `(a = b) → false`. Das bedeutet: siehst du `a ≠ b`, dann kannst du es genauso behandeln wie `(a = b) → false`. Informatiker würden sagen, dass diese beiden Aussagen *definitionsmäßig gleich* sind. Das folgende Lemma $a+b=0\implies b=0$ wird in der Welt der Ungleichheit nützlich sein. Wir sehen den Beweis gemeinsam durch, denn er enthält einige neue Konzepte: * `cases b`, where `b : mynat` * `exfalso` * `apply succ_ne_zero` Wir werden $a+b=0\implies b=0$ beweisen. Hier kommt die Strategie: Jede natürliche Zahl ist entweder `0` oder `succ(d)` für eine andere natürliche Zahl `d`. Wir können also anfangen mit: `cases b with d,` Jetzt haben wir zwei Ziele, den Fall `b=0`(den du einfach lösen kannst) und den Fall `b=succ(d)`, der so aussieht: ``` a d : mynat, H : a + succ d = 0 ⊢ succ d = 0 ``` Unser Ziel ist unmöglich zu beweisen. Allerdings auch unsere Hypothese H, wir haben also noch eine Chance! Wir können `rw add_succ at H,` schreiben, um `H` in `H : succ (a + d) = 0` umzuschreiben. Da `succ_ne_zero(a+d)` ein Beweis für `succ (a + d) ≠ 0` ist, ist es auch ein Beweis für die Implikation `succ (a + d) = 0 → false`. Also ist `succ_ne_zero (a + d) H` ein beweis für `false`! Leider ist unser Ziel nicht `false`, sondern eine allgemeine falsche Aussage. Denk daran, das wir für solche Fälle `exfalso` haben, dass beliebige Ziele in `false` umwandelt. (Das ist logisch in Ordnung, da `false` jede andere logische Aussage, egal ob wahr oder falsch, impliziert). Von hier aus solltest du vermutlich alleine zurecht kommen.

source: If $a$ and $b$ are natural numbers such that $$ a + b = 0, $$ then $b = 0$.
de: Sind $a$ und $b$ natürliche Zahlen mit $$ a + b = 0, $$ dann gilt $b=0$.

source: # Advanced Addition World ## Level 11: `add_right_eq_zero` We just proved `add_left_eq_zero (a b : mynat) : a + b = 0 → b = 0`. Hopefully `add_right_eq_zero` shouldn't be too hard now.
de: # Fortgeschrittene Welt der Addition ## Level 11: `add_right_eq_zero` Wir haben gerade `add_left_eq_zero (a b : mynat) : a + b = 0 → b = 0` bewiesen. `add_right_eq_zero` sollte dann hoffentlich nicht zu schwer sein.

source: If $a$ and $b$ are natural numbers such that $$ a + b = 0, $$ then $a = 0$.
de: Sind $a$ und $b$ natürliche Zahlen mit $$ a + b = 0,$$ dann gilt $a = 0$.

source: # Advanced Addition World ## Level 12: `add_one_eq_succ` We have * `succ_eq_add_one (n : mynat) : succ n = n + 1` but sometimes the other way is also convenient.
de: # Fortgeschrittene Welt der Addition ## Level 12: `add_one_eq_succ` Wir haben: * `succ_eq_add_one (n : mynat) : succ n = n + 1` Manchmal ist die Rückrichtung aber auch nützlich.

source: For any natural number $d$, we have $$ d+1 = \operatorname{succ}(d). $$
de: Für eine natürliche Zahl $d$ gilt: $$ d+1 = \operatorname{succ}(d). $$

source: # Advanced Addition World ## Level 13: `ne_succ_self` The last level in Advanced Addition World is the statement that $n\not=\operatorname{succ}(n)$. When you've done this you've completed Advanced Addition World and can move on to Advanced Multiplication World (after first doing Multiplication World, if you didn't do it already).
de: # Fortgeschrittene Welt der Addition ## Level 13: `ne_succ_self` Im letzten Level der fortgeschrittenen Welt der Addition geht es um die Aussage $n\not=\operatorname{succ}(n)$. Wenn du hiermit fertig bist, has du die fortgeschrittene Welt der Addition abgeschlossen und kannst in die fortgeschrittene Welt der Multiplikation vorrücken. (Wenn du die Welt der Multiplikation schon hast).

source: For any natural number $n$, we have $$ n \neq \operatorname{succ}(n). $$
de: Für eine natürliche Zahl $n$ gilt $$ n \neq \operatorname{succ}(n). $$

source: Advanced Multiplication world
de: Fortgeschrittene Welt der Multiplikation

source: # Advanced Multiplication World ## Level 1: `mul_pos` Welcome to Advanced Multiplication World! Before attempting this world you should have completed seven other worlds, including Multiplication World and Advanced Addition World. There are four levels in this world. Recall that if `b : mynat` is a hypothesis and you do `cases b with n`, your one goal will split into two goals, namely the cases `b = 0` and `b = succ(n)`. So `cases` here is like a weaker version of induction (you don't get the inductive hypothesis). ## Tricks 1) if your goal is `⊢ X ≠ Y` then `intro h` will give you `h : X = Y` and a goal of `⊢ false`. This is because `X ≠ Y` *means* `(X = Y) → false`. Conversely if your goal is `false` and you have `h : X ≠ Y` as a hypothesis then `apply h` will turn the goal into `X = Y`. 2) if `hab : succ (3 * x + 2 * y + 1) = 0` is a hypothesis and your goal is `⊢ false`, then `exact succ_ne_zero _ hab` will solve the goal, because Lean will figure out that `_` is supposed to be `3 * x + 2 * y + 1`.
de: # Fortgeschrittene Welt der Multiplikation ## Level 1: `mul_pos` Willkommen in der fortgeschrittenen Welt der Multiplikation! Bevor du dich an dieser Welt versuchst solltest du sieben andere Welten besucht haben. Das gilt insbesondere für die Welt der Multiplikation und der fortgeschrittenen Addition. Es gibt nur vier Level in dieser Welt. Erinnere dich daran, dass die Hypothese `b : mynat` mit `cases b with n` in zwei Ziele aufgeteilt werden kann, nämlich `b=0` und `b= succ(n)`. `cases` ist demnach eine schwächere Version der Induktion (man bekommt keine Induktionsvoraussetzung). ## Tricks 1) Wenn dein Ziel `⊢ X ≠ Y` lautet, dann wird `intro h` dir `h : X = Y` liefern und ein Ziel `⊢ false`. Das liegt daran, dass `X ≠ Y` eben `(X = Y) → false` *bedeutet*. Umgekehrt gilt: ist dein Ziel `false`und du hast eine Hypothese `h : X ≠ Y`, dann wird `apply h` das Ziel in `X = Y` verwandeln. 2) Ist `hab : succ (3 * x + 2 * y + 1) = 0` eine Hypothese und dein Ziel ist `⊢ false`, dann wird `exact succ_ne_zero _ hab` das Ziel erfüllen, da Lean von selbst herausfindet, dass `_` `3 * x + 2 * y + 1` sein soll.

source: The product of two non-zero natural numbers is non-zero.
de: Das Produkt zweier natürlichen Zahlen ungleich Null ist ungleich null.

source: # Advanced Multiplication World ## Level 2: `eq_zero_or_eq_zero_of_mul_eq_zero` A variant on the previous level.
de: # Fortgeschrittene Welt der Multiplikation ## Level 2: `eq_zero_or_eq_zero_of_mul_eq_zero` Eine Variation des vorherigen Levels.

source: If $ab = 0$, then at least one of $a$ or $b$ is equal to zero.
de: Wenn $ab=0$ ist, dann ist $a=0$ und/oder $b=0$.

source: # Advanced Multiplication World ## Level 3: `mul_eq_zero_iff` Now you have `eq_zero_or_eq_zero_of_mul_eq_zero` this is pretty straightforward.
de: # Fortgeschrittene Welt der Multiplikation ## Level 3: `mul_eq_zero_iff` Da du `eq_zero_or_eq_zero_of_mul_eq_zero` hast ist dieses Level einfach.

source: $ab = 0$, if and only if at least one of $a$ or $b$ is equal to zero.
de: $ab = 0$ gilt genau dann, wenn $a=0$ und/oder $b=0$.

source: # Advanced Multiplication World ## Level 4: `mul_left_cancel` This is the last of the bonus multiplication levels. `mul_left_cancel` will be useful in inequality world. People find this level hard. I have probably had more questions about this level than all the other levels put together, in fact. Many levels in this game can just be solved by "running at it" -- do induction on one of the variables, keep your head, and you're done. In fact, if you like a challenge, it might be instructive if you stop reading after the end of this paragraph and try solving this level now by induction, seeing the trouble you run into, and reading the rest of these comments afterwards. This level has a sting in the tail. If you are a competent mathematician, try and figure out what is going on. Write down a maths proof of the theorem in this level. Exactly what statement do you want to prove by induction? It is subtle. Ok so here are some spoilers. The problem with naively running at it, is that if you try induction on, say, $c$, then you are imagining a and b as fixed, and your inductive hypothesis $P(c)$ is $ab=ac \implies b=c$. So for your inductive step you will be able to assume $ab=ad \implies b=d$ and your goal will be to show $ab=a(d+1) \implies b=d+1$. When you also assume $ab=a(d+1)$ you will realise that your inductive hypothesis is *useless*, because $ab=ad$ is not true! The statement $P(c)$ (with $a$ and $b$ regarded as constants) is not provable by induction. What you *can* prove by induction is the following *stronger* statement. Imagine $a\not=0$ as fixed, and then prove "for all $b$, if $ab=ac$ then $b=c$" by induction on $c$. This gives us the extra flexibility we require. Note that we are quantifying over all $b$ in the inductive hypothesis -- it is essential that $b$ is not fixed. You can do this in two ways in Lean -- before you start the induction you can write `revert b,`. The `revert` tactic is the opposite of the `intro` tactic; it replaces the `b` in the hypotheses with "for all $b$" in the goal. Alternatively, you can write `induction c with d hd generalizing b` as the first line of the proof. If you do not modify your technique in this way, then this level seems to be impossible (judging by the comments I've had about it!)
de: # Fortgeschrittene Welt der Multiplikation ## Level 4: `mul_left_cancel` Dies ist das letzte der Bonus Level der Multiplikation. `mul_left_cancel` wird in der Welt der Ungleichheit nützlich sein. Dieses Level scheint schwer zu sein. Ich habe wahrscheinlich mehr Fragen zu diesem Level erhalten, als zu allen anderen leveln zusammen. Viele Level in diesem Spiel können durch "mit dem Kopf dagegen hämmern" gelöst werden -- Wende Induktion auf eine der Variablen an, denke ein wenig und fertig. Wenn du also eine Herausforderung möchtest, dann höre nach diesem Abschnitt auf zu lesen und versuche es mit Induktion. Wenn du Probleme bekommst, dann lies den Rest dieser Anweisungen danach. Dieses Level ist stachlig, wenn du ein kompetenter Mathematiker bist, dann versuche herauszufinden was hier los ist. Schreibe einen mathematischen Beweis auf. Was genau willst du hier mit Induktion beweisen? Es ist subtil! Ok, also einige Spoiler. Das Problem mit dem naiven Ansatz ist hier, dass die Anwendung von Induktion auf z.B. $c$ bedeutet, dass du dir vorstellst, dass $a$ und $b$ fixiert sind und die Induktionsvoraussetzung $P(c)$$ bedeutet: $ab=ac \implies b=c$. Für den Induktionsschritt wirst du dann $ab=ad \implies b=d$ nutzen können und dein Ziel wird sein $ab=a(d+1) \implies b=d+1$ zu zeigen. Nimmst du auch noch $ab=a(d+1)$ an wirst du feststellen, dass die Induktions- voraussetzung *nutzlos* ist, da $ab=ad$ nicht wahr ist! Die Aussage $P(c)$ (mit $a$ und $b$ als Konstanten) ist nicht mit Induktion beweisbar. Was du aber mit Induktion beweisen *kannst* ist die folgende, sogar *stärkere* Aussage. Nimm $a\not=0$ als fixiert an und beweise dann "für alle $b$ ist $b=c$, wenn $ab=ac$ gilt" mit Induktion auf $c$. Das liefert uns die zusätzliche Flexibilität, die wir benötigen. Beachte außerdem, dass wir unsere Induktionsvoraussetzung für alle $b$ setzen -- es ist wichtig, dass $b$ nicht fixiert ist. In Lean kannst du das auf zwei Arten rreichen -- bevor du die Induktion startest kannst du `revert b,` schreiben. Die `revert` Taktik ist das Gegenteil von `intro`; sie ersetzt die `b`s in der Hypothese mit " für alle $b$ gilt" im Ziel. Alternativ kannst du auch `induction c with d hd generalizing b`als erste Zeile im Beweis schreiben. Falls du dein Vorgehen nicht in dieser Weise anpasst, dann scheint dieses Level unmöglich (zumindest wenn man den Kommentaren glaibt!)

source: If $a \neq 0$, $b$ and $c$ are natural numbers such that $ ab = ac, $ then $b = c$.
de: Seien $\neq 0$, $b$ und $c$ natürliche Zahlen mit $ab = ac,$ dann gilt $b = c$.

source: You should now be ready for inequality world.
de: Du solltest jetzt für die Welt der Ungleichheit bereit sein.

source: ## Summary `revert x` is the opposite to `intro x`. ## Details If the tactic state looks like this ``` P Q : Prop, h : P ⊢ Q ``` then `revert h` will change it to ``` P Q : Prop ⊢ P → Q ``` `revert` also works with things like natural numbers: if the tactic state looks like this ``` m : mynat ⊢ m + 1 = succ m ``` then `revert m` will turn it into ``` ⊢ ∀ (m : mynat), m + 1 = mynat.succ m ```
de: ## Zusammenfassung `revert x` ist das Gegenteil von `intro x`. ## Details Wenn dein Zustand wie folgt aussieht, ``` P Q : Prop, h : P ⊢ Q ``` dann wird `revert h` folgenden Effekt haben: ``` P Q : Prop ⊢ P → Q ``` `revert`funktioniert auch mit natürlichen Zahlen: ``` m : mynat ⊢ m + 1 = succ m ``` `revert m` wird dies umschreiben zu: ``` ⊢ ∀ (m : mynat), m + 1 = mynat.succ m ```

source: Inequality world
de: Welt der Ungleichheit

source: import mynat.le -- import definition of ≤
de: import mynat.le -- importiere die Definition von of ≤

source: ## Summary `use` works on the goal. If your goal is `⊢ ∃ c : mynat, 1 + x = x + c` then `use 1` will turn the goal into `⊢ 1 + x = x + 1`, and the rather more unwise `use 0` will turn it into the impossible-to-prove `⊢ 1 + x = x + 0`. ## Details `use` is a tactic which works on goals of the form `⊢ ∃ c, P(c)` where `P(c)` is some proposition which depends on `c`. With a goal of this form, `use 0` will turn the goal into `⊢ P(0)`, `use x + y` (assuming `x` and `y` are natural numbers in your local context) will turn the goal into `P(x + y)` and so on.
de: ##Zusammenfassung `use` arbeitet auf dem Ziel. Wenn dein Ziel aussieht wie `⊢ ∃ c : mynat, 1 + x = x + c`, dann wird `use 1` es in `⊢ 1 + x = x + 1` verwandeln und das wesentlich weniger weise `use 0` erzeugt das unmöglich zu beweisende `⊢ 1 + x = x + 0`. ## Details `use` ist eine Taktik, die für Ziele der Form `⊢ ∃ c, P(c)` funktioniert, bei denen `P(c)` eine Aussage ist, die von `c`abhängt. Mit einem Ziel dieser Form wird `use 0` `⊢ P(0)` erzeugen und `use x + y` wird `P(x + y)` erzeugen (wenn `x` und `y` natürliche Zahlen sind), usw.
