Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: Natural number game
de: Die Natürlichen Zahlen - Das Spiel

source: # The Natural Number Game, version 1.3.3 ## By Kevin Buzzard and Mohammad Pedramfar. # What is this game? Welcome to the natural number game -- a part-book part-game which shows the power of induction. Blue nodes on the graph are ones that you are ready to enter. Grey nodes you should stay away from -- a grey node turns blue when *all* nodes above it are complete. Green nodes are completed. (Actually you can try any level at any time, but you might not know enough to complete it if it's grey). In this game, you get own version of the natural numbers, called `mynat`, in an interactive theorem prover called Lean. Your version of the natural numbers satisfies something called the principle of mathematical induction, and a couple of other things too (Peano's axioms). Unfortunately, nobody has proved any theorems about these natural numbers yet! For example, addition will be defined for you, but nobody has proved that `x + y = y + x` yet. This is your job. You're going to prove mathematical theorems using the Lean theorem prover. In other words, you're going to solve levels in a computer game. You're going to prove these theorems using *tactics*. The introductory world, Tutorial World, will take you through some of these tactics. During your proofs, your "goal" (i.e. what you're supposed to be proving) will be displayed with a `⊢` symbol in front of it. If the top right hand box reports "Theorem Proved!", you have closed all the goals in the level and can move on to the next level in the world you're in. When you've finished a world, hit "main menu" in the top left to get back here. For more info, see the <a href="http://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/FAQ.html" target="blank">FAQ</a>. # What's new in v1.3? The game now saves your progress! Thanks to everyone who asked for it, and to Mohammad for making it happen :-) Cute little clipboard to copy your solutions. # Thanks Special thanks to Rob Lewis for tactic hackery, Bryan Gin-Ge Chen for javascript hackery, Patrick Massot for his <a href="https://github.com/leanprover-community/format_lean" target="blank">Lean to html formatter</a>, Sian Carey for Power World, and, last but not least, all the people who fed back comments, including the 2019-20 Imperial College 1st year maths beta tester students, Marie-Amélie Lawn, Toby Gee, Joseph Myers, and all the people who have been in touch via the <a href="https://leanprover.zulipchat.com/" target="blank">Lean Zulip chat</a> or the <a href="https://xenaproject.wordpress.com/" target="blank">Xena Project blog</a> or via <a href="https://twitter.com/XenaProject" target="blank">Twitter</a>. The natural number game is brought to you by the Xena project, a project based at Imperial College London whose aim is to get mathematics undergraduates using computer theorem provers. Lean is a computer theorem prover being developed at Microsoft Research. Prove a theorem. Write a function. <a href="https://twitter.com/XenaProject" target="blank">@XenaProject</a>.
de: # Die Natürlichen Zahlen - Das Spiel ## Von Kevin Buzzard und Mohammad Pedramfar. # Worum geht es in diesem Spiel? Willkommen zum Spiel rund um natürliche Zahlen -- teilweise Buch und teilweise Spiel, das die Stärke der Induktion zeigt Blaue Knoten auf dem Graphen können direkt betreten werden. Graue Knoten solltennoch nicht betreten werden Ein grauer Knoten wird blau, wenn *alle* Knoten über ihm bearbeitet wurden.Grüne Knoten sind fertig bearbeitet(Eigentlich kann jedes beliebige Level zu jeder Zeit bearbeitet werden,aber solange es grau ist, reichen deine Kenntnisse möglicherweisenoch nicht aus, um es zu schaffen!) In diesem Spiel baust du deine eigene Version der Natürlichen Zahlen, die 'mynat'genannt werden, in einem interaktiven Programm für das Schreiben mathematischer Beweise, das Lean genannt wird. Deine Version der natürlichen Zahlen gehorcht dem Prinzip der vollständigen Induktion, wie auch einige anderen grundlegenden Dingen (Die Axiome von Peano) Unglücklicherweise hat bisher niemand irgendwelche Sätze für diese natürlichen Zahlen bewiesen! Beispielsweise ist die Addition bereits definiert, aber niemand hat bewiesen, dass gilt: 'x+y=y+x Das ist deine Aufgabe! Du wirst mathematische Sätze mit Lean beweisen. Mit anderen Worten: Du wirst 'Rätsel' in Levels eines Computerspiel lösen! Um diese Sätze zu beweisen, wirst du *Taktiken* verwenden.In der einleitenden Tutorial-Welt wirst du einige dieser Taktiken lernen Während deiner Beweise wird deine "Ziel" (also das, was du beweist) hinter dem Symbol `⊢` stehen. Wenn die Box in der rechten oberen Ecke "Satz bewiesen!" anzeigt, hast du alle Ziele in diesem Level erreicht und kannst zum nächsten Level in deiner derzeitigen Welt weiter. Wenn du eine Welt geschafft hast, kannst du über "Hauptmenü"in der oberen linken Ecke hierher zurückkehren. If the top Für weitere Informationen (auf Englisch) <a href="http://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/FAQ.html" target="blank">FAQ</a>. # Was ist neu in der Version 1.3.2? Das Spiel kann jetzt deinen Fortschritt speichern. Vielen Dank an alle, die danach gefragt haben und an Mohammad, der es realisiert hat! :-) # Dank Ein spezieller Dank gilt Rob Lewis für Taktik-Zauber, Bryan Gine-Ge Chen für javascript-Zauber, Patrick Massot für: <a href="https://github.com/leanprover-community/format_lean" target="blank">Lean zu html Formattierer</a>, Sian Carey für die Potenz Welt, und natürlich allen Leuten, die das Spiel durch Rückmeldungen verbessert haben, insbesondere die 2019-20 Imperal College Ersti Mathematik Studenten Beta-Tester: Marie-Amélie Lawn, Toby Gee, Joseph Myers, aber auch überden <a href="https://leanprover.zulipchat.com/" target="blank">Lean Zulip chat</a>, oder den <a href="https://xenaproject.wordpress.com/" target="blank">Xena Projekt blog</a> oder über <a href="https://twitter.com/XenaProject" target="blank">Twitter</a>. Die Natürlichen Zahlen - Das Spiel, wird dir vom Xena Projekt präsentiert, ein Projekt, dass auf dem Imperial College London entstnaden ist. Das Ziel dieses Projekts ist es, Studenten die Arbeit mit Programmen zur mathematischen Beweisführung näherzubringen. Lean ist so ein Program, dass von Microsoft Research entwickelt wurde. Beweise einen Satz. Schreibe eine Funktion! <a href="https://twitter.com/XenaProject" target="blank">@XenaProject</a>.

source: Tutorial world
de: Tutorial Welt

source: import mynat.definition -- imports the natural numbers {0,1,2,3,4,...}.
de: import mynat.definition -- importiert die natürlichen Zahlen {0,1,2,3,4,...}.

source: import mynat.add -- imports definition of addition on the natural numbers.
de: import mynat.add -- import die Definition der Addition auf den natürlichen Zahlen.

source: import mynat.mul -- imports definition of multiplication on the natural numbers.
de: import mynat.mul -- importiert die Definition der Multiplikation auf den natürlichen Zahlen

source: # Tutorial World ## Level 1: the `refl` tactic. Let's learn some tactics! Let's start with the `refl` tactic. `refl` stands for "reflexivity", which is a fancy way of saying that it will prove any goal of the form `A = A`. It doesn't matter how complicated `A` is, all that matters is that the left hand side is *exactly equal* to the right hand side (a computer scientist would say "definitionally equal"). I really mean "press the same buttons on your computer in the same order" equal. For example, `x * y + z = x * y + z` can be proved by `refl`, but `x + y = y + x` cannot. Each level in this game involves proving a theorem or a lemma (a lemma is just a baby theorem). The goal of the theorem will be a mathematical statement with a `⊢` just before it. We will use tactics to manipulate and ultimately close (i.e. prove) these goals. Let's see `refl` in action! At the bottom of the text in this box, there's a lemma, which says that if $x$, $y$ and $z$ are natural numbers then $xy + z = xy + z$. Locate this lemma (if you can't see the lemma and these instructions at the same time, make this box wider by dragging the sides). Let's supply the proof. Click on the word `sorry` and then delete it. When the system finishes being busy, you'll be able to see your goal -- the objective of this level -- in the box on the top right. [NB if your system never finishes being busy, then your computer is not running the javascript Lean which powers everything behind the scenes. Try Chrome? Try not using private browsing?] Remember that the goal is the thing with the weird `⊢` thing just before it. The goal in this case is `x * y + z = x * y + z`, where `x`, `y` and `z` are some of your very own natural numbers. That's a pretty easy goal to prove -- you can just prove it with the `refl` tactic. Where it used to say `sorry`, write `refl,` **and don't forget the comma**. Then hit enter to go onto the next line. If all is well, Lean should tell you "Proof complete!" in the top right box, and there should be no errors in the bottom right box. You just did the first level of the tutorial! And you also learnt how to avoid by *far* the most common mistake that beginner users make -- **every line must end with a comma**. If things go weird and you don't understand why the top right box is empty, check for missing commas. Also check you've spelt `refl` correctly: it's REFL for "reflexivity". For each level, the idea is to get Lean into this state: with the top right box saying "Proof complete!" and the bottom right box empty (i.e. with no errors in). If you want to be reminded about the `refl` tactic, you can click on the "Tactics" drop down menu on the left. Resize the window if it's too small. Now click on "next level" in the top right of your browser to go onto the second level of tutorial world, where we'll learn about the `rw` tactic.
de: # Tutorial Welt ## Level 1: Die `refl` Taktik. Fangen wir mit Taktiken an! Wir starten mit der 'refl' Taktik.'refl' steht für "Reflexivität", was nur eine schlaue Art ist zu sagen, dass jedes Ziel der Form `A = A` erfüllt wird. Es spielt dabei keine Rolle, wie kompliziert 'A' ist. Das Einzige was zählt ist, dass die linke Seite und die rechte Seite *exakt* gleich sind! (Ein Informatiker würde sagen "nach Definition gleich") Ich meine wirklich: "Drücke die gleichen Knöpfe auf deinem PC in der gleichen Reihenfolge " - gleich. Zum Beispiel: `x * y + z = x * y + z` kann mit 'refl' bewiesen werden, aber `x + y = y + x` funktioniert nicht. In jedem Level dieses Spiels muss ein Satz oder ein Lemma bewiesen werden(ein Lemma ist nur ein Mini-Satz) Das Ziel jedes Satzes wird ein mathematischer Ausdruck mit einem `⊢` davor sein. Wer werden Taktiken verwenden, um die Ziele zu verändern und am Ende zu beweisen Sehen wir uns 'refl' in Aktion an! Unter diesem Text ist eine Box mit einem Lemma. Dieses Lemma behauptet: Wenn $x$, $y$ und $z$ natürliche Zahlen sind, dann ist $xy + z = xy + z$. Finde das Lemma (wenn du das Lemma und die Anweisungen nicht zur selben Zeit sehen kannst, vergrößere die Box, indem du an den Seiten ziehst). Lass uns den Beweis schreiben.Klicke auf das Wort 'sorry' und lösche es. Wenn Lean nicht mehr beschäftigt ist, wirst du dein Ziel für dieses Level in der Box in der oberen rechten Ecke finden. [Wenn das Ziel nie erscheint, dann funktioniert das javascript Lean, das alles hinter den Kulissen betreibt. Versuche es mit Chrome, schalte 'private browsing' aus.] Zur Erinnerung: Das Ziel ist das Zeug hinter dem komischen `⊢` Symbol. In unserem Fall: `x * y + z = x * y + z`, wobei 'x', 'y' und 'z' drei deiner eigenen natürlichen Zahlen sind. Dieses Ziel ist recht leicht zu beweisen, du kannst es einfach mit 'refl' zeigen. Schreibe `refl,` an die Stelle, an der vorher 'sorry' stand. **vergiss nicht das Komma!** Drücke auf enter und spring zur nächsten Zeile. Wenn alles funktioniert hat, sollte Lean "Satz bewiesen" anzeigen. Außerdem sollte kein Fehler mehr in der unteren rechten Box angezeigt werden. Du hast gerade dein erstes Level des Tutorials geschafft! Außerdem hast du den *mit Abstand* häufigsten Anfängerfehler kennengelernt: **Jede Zeile muss mit einem Komma enden!** Falls merkwürdige Dinge passieren und dir nicht klar ist, warum die Box oben rechts plötzlich leer ist: sieh nach den Kommas! Beachte außerdem, dass 'refl' richtig geschrieben ist. Es ist REFL für "Reflexivität". Die zentrale Idee ist es, in jedem Level Lean in diesen Zustand zu bringen: Die Box oben rechts zeigt "Satz bewiesen" und die Box unten links ist leer (also keine Fehler mehr!) Wenn du noch einmal an 'refl' erinnert werden möchtest, kannst du auf das "Taktik" Menü links klicken. Vergrößere das Fenster, wenn es zu klein ist. Klicke jetzt auf "nächstes Level" in der oberen rechten Ecke deines Browsers, um zum zweiten Level der Tutorial Welt zu gelangen. Dort werden wir die 'rw' Taktik kennenlernen.Now click on "next level" in the top right of your browser to go onto the

source: For all natural numbers $x$, $y$ and $z$, we have $xy + z = xy + z$.
de: Für alle natürlichen Zahlen $x$, $y$ und $z$ gilt: $xy + z=xy +z$.

source: ## Summary `refl` proves goals of the form `X = X`. ## Details The `refl` tactic will close any goal of the form `A = B` where `A` and `B` are *exactly the same thing*. ### Example: If it looks like this in the top right hand box: ``` a b c d : mynat ⊢ (a + b) * (c + d) = (a + b) * (c + d) ``` then `refl,` will close the goal and solve the level. Don't forget the comma.
de: ## Zusammenfassung `refl` beweist Ziele der Form `X = X`. ## Details Die`refl` Taktik wird alle Ziele der Form `A = B abschließen, ` wenn `A` und `B` *exakt gleich* sind. ### Beispiel: Wenn die Box oben rechts so aussieht: ``` a b c d : mynat ⊢ (a + b) * (c + d) = (a + b) * (c + d) ``` dann wird `refl,` das Ziel erfüllen und das Level lösen. Vergiss das Komma nicht!

source: # Tutorial world ## level 2: The rewrite (`rw`) tactic. The rewrite tactic is the way to "substitute in" the value of a variable. In general, if you have a hypothesis of the form `A = B`, and your goal mentions the left hand side `A` somewhere, then the `rewrite` tactic will replace the `A` in your goal with a `B`. Below is a theorem which cannot be proved using `refl` -- you need a rewrite first. Delete the sorry and take a look in the top right box at what we have. The variables $x$ and $y$ are natural numbers, and we have a proof `h` that $y = x + 7$. Our goal is to prove that $2y=2(x+7)$. This goal is obvious -- we just substitute in $y = x+7$ and we're done. In Lean, we do this substitution using the `rw` tactic. So start your proof with `rw h,` and then hit enter. **Don't forget the comma.** Did you see what happened to the goal? The goal doesn't close, but it *changes* from `⊢ 2 * y = 2 * (x + 7)` to `⊢ 2 * (x + 7) = 2 * (x + 7)`. We can just close this goal with `refl,` by writing it on the line after `rw h,`. Don't forget the comma, hit enter, and enjoy seeing the "Proof complete!" message in the top right window. The other reason you'll know you're done is that the bottom right window (the error window) becomes empty. When you've finished reading the comments below the proof, click "Next Level" in the top right to proceed to the next level in this world.
de: # Tutorial Welt ## Level 2: Die Umschreiben (`rw`) Taktik (von 'rewrite'). Mit dem Umschreiben kann der Wert einer Variablen "ersetzt" werden. Grundlegend gilt: wenn du eine Hypothese der Form 'A = B' hast und dein Ziel erwähnt auf der linken Seite irgendwo 'A', dann wird 'rw' das 'A' in deinem Ziel mit einem 'B' ersetzen. Unter diesem Text ist ein Satz, der nicht mit 'refl' bewiesen werden kann. Du musst es zuerst umschreiben. Lösche das 'sorry' und sieh dir zuerst die Box oben rechts an. Die Variablen $x$ und $y$ sind natürlichen Zahlen und wir sehen einen Beweis 'h', der $y = x + 7$ zeigt. Unser Ziel ist es zu zeigen, dass gilt: $2y=2(x+7)$ Das Ziel ist klar, wir müssen nur $y = x+7$ einsetzen (also y ersetzen) und wir sind fertig. In Lean erreichen wir das, indem wir 'rw' verwenden. Beginne also mit is to prove that $2y=2(x+7)$. This goal is obvious -- we just `rw h,` und drücke auf enter. **Vergiss das Komma nicht.** Hast du gesehen, was mit dem Ziel passiert ist? Es ist nicht erfüllt, aber es hat sich *verändert*, von `⊢ 2 * y = 2 * (x + 7)` zu `⊢ 2 * (x + 7) = 2 * (x + 7)` Dieses Ziel können wir aber leicht mit `refl,` erfüllen, indem wir es in die nächste Zeile nach 'rw h' schreiben. Vergiss das Komma nicht und bestätige, dann kannst du die Nachricht "Satz bewiesen " oben rechts genießen. Ein zweiter Hinweis, dass du fertig bist ist, dass die Fehlerbox unten links leer ist. Wenn du die Kommentare unter dem Beweis gelesen hast, dann klicke auf "Nächstes Level" oben rechts, um zum nächsten Level dieser Welt weiterzugehen.

source: If $x$ and $y$ are natural numbers, and $y=x+7$, then $2y=2(x+7)$.
de: Sind $x$ und $y$ natürliche Zahlen und gilt: $y=x+7$, dann ist $2y = 2(x+7)$.

source: ## Summary If `h` is a proof of `X = Y`, then `rw h,` will change all `X`s in the goal to `Y`s. Variants: `rw ← h` (changes `Y` to `X`) and `rw h at h2` (changes `X` to `Y` in hypothesis `h2` instead of the goal). ## Details The `rw` tactic is a way to do "substituting in". There are two distinct situations where use this tactics. 1) If `h : A = B` is a hypothesis (i.e., a proof of `A = B`) in your local context (the box in the top right) and if your goal contains one or more `A`s, then `rw h` will change them all to `B`'s. 2) The `rw` tactic will also work with proofs of theorems which are equalities (look for them in the drop down menu on the left, within Theorem Statements). For example, in world 1 level 4 we learn about `add_zero x : x + 0 = x`, and `rw add_zero` will change `x + 0` into `x` in your goal (or fail with an error if Lean cannot find `x + 0` in the goal). Important note: if `h` is not a proof of the form `A = B` or `A ↔ B` (for example if `h` is a function, an implication, or perhaps even a proposition itself rather than its proof), then `rw` is not the tactic you want to use. For example, `rw (P = Q)` is never correct: `P = Q` is the true-false statement itself, not the proof. If `h : P = Q` is its proof, then `rw h` will work. Pro tip 1: If `h : A = B` and you want to change `B`s to `A`s instead, try `rw ←h` (get the arrow with `\l` and note that this is a small letter L, not a number 1). ### Example: If it looks like this in the top right hand box: ``` x y : mynat h : x = y + y ⊢ succ (x + 0) = succ (y + y) ``` then `rw add_zero,` will change the goal into `⊢ succ x = succ (y + y)`, and then `rw h,` will change the goal into `⊢ succ (y + y) = succ (y + y)`, which can be solved with `refl,`. ### Example: You can use `rw` to change a hypothesis as well. For example, if your local context looks like this: ``` x y : mynat h1 : x = y + 3 h2 : 2 * y = x ⊢ y = 3 ``` then `rw h1 at h2` will turn `h2` into `h2 : 2 * y = y + 3`.
de: ## Zusammenfassung Wenn 'h' ein Beweis für 'X = Y' ist, dann wird 'rw h' alle 'X'e im Ziel zu 'Y' umschreiben. Varianten: `rw ← h` (schreibt 'Y' zu 'X' um). 'rw h at h2 (schreibt 'X' zu 'Y' in Hypothese 'h2' an Stelle desZiels um) ## Details Die 'rw' Taktik ist ein weg, um etwas zu "ersetzen ". Es gibt zwei verschiedenen Situationen, um sie einzusetzen. 1) Wenn 'h: A = B' eine Hypothese in deinem Kontext ist (zum Beispiel ein Beweis für 'A = B' oben rechts) und eines deiner Ziele eines oder mehr 'A's enthält, dann wird 'rw h' sie alle zu 'B' umschreiben. 2) 'rw' funktioniert auch bei Beweisen von Sätzen, die Gleichungen sind (sie sind im Dropdown Menü auf der linken Seite zu finden). Zum Beispiel lernen wir in Welt 1, Level 4 `add_zero x : x + 0 = x` und 'rw add_zero' ersetzt im Ziel 'x + 0' mit 'x' (oder geht in einen Fehlerzustand um, wenn Lean kein 'x + 0' im Ziel findet). Wichtig: wenn 'h' kein Beweis der Form 'A = B' oder `A ↔ B` ist (zum Beispiel könnte 'h' eine Funktion, eine Implikation oder vielleicht eine Aussage und nicht ihr Beweis sein), dann sollte 'rw' nicht verwendet werden. Zum Beispiel ist 'rw (P = Q)' ist niemals richtig: 'P = Q' ist selbst eine Wahr-Falsch-Aussage, nicht der Beweis. Wenn 'h : P = Q' der zugehörige Beweis ist, dann funktioniert es. Profi Tipp 1: Wenn gilt: 'h : A = B' und du 'B's zu 'A's ersetzen willst, versuche es mit `rw ←h` (der Pfeil kann mit '\l' geschrieben werden, es ist ein kleines L und keine 1). ### Beispiel: Wenn die Box oben rechts so aussieht: ``` x y : mynat h : x = y + y ⊢ succ (x + 0) = succ (y + y) ``` dann wird `rw add_zero,` das Ziel zu `⊢ succ x = succ (y + y)` umschreiben und dann wird `rw h,` das Ziel zu `⊢ succ (y + y) = succ (y + y)` umschreiben, was mit 'refl' bewiesen werden kann. ### Beispiel: 'rw' kann auch für Hypothesen verwendet werden. Sieht die Box oben rechts so aus: ``` x y : mynat h1 : x = y + 3 h2 : 2 * y = x ⊢ y = 3 ``` Dann wird `rw h1 at h2``h2` zu `h2 : 2 * y = y + 3` umschreiben.

source: ## Exploring your proof. Click on `refl,` and then use the arrow keys to move your cursor around the proof. Go up and down and note that the goal changes -- indeed you can inspect Lean's "state" at each line of the proof (the hypotheses, and the goal). Try to figure out the exact place where the goal changes. The comma tells Lean "I've finished writing this tactic now, please process it." Lean ignores newlines, but pays great attention to commas. ## The tactic index The documentation for `rw` just appeared in the list of tactics in the box on the left. Play around with the menus on the left and see what is there currently. More information will appear as you progress. ## Bewildered? Doesn't work? Weird error that won't go away? You can check out the <a href="https://github.com/ImperialCollegeLondon/natural_number_game/blob/master/SOLUTIONS.md" target="blank">solutions</a> (github.com, opens in new window). Solutions to every level are here.
de: ## Erkunde deinen Beweis! Klicke auf 'refl' und benutze die Pfeiltasten, um den Cursor durch den Beweis zu bewegen. Gehe auf und ab und du wirst feststellen, dass sich das Ziel verändert. Du kannst Leans "Zustand" in jeder Zeile des Beweises (der Hypothese und dem Ziel) untersuchen. Versuche genau herauszufinden, wo das Ziel sich verändert. Das Komma erklärt Lean "Ich habe diese Taktik fertig angewendet, bitte wende sie jetzt an. ". Lean ignoriert Leerzeilen, aber es passt sehr genau auf Kommas auf. ## Die Taktik Liste Die Dokumentation für 'rw' ist gerade in der Liste der Taktiken auf der linken Seite erschienen. Teste die Menüs und erkunde ihren derzeitigen Inhalt. Der Inhalt wird ergänzt, sobald du Fortschritte machst. ## Verwirrt? Es funktioniert nicht? Seltsamer Fehler, der nicht weggeht? Du findest hier <a href="https://github.com/ImperialCollegeLondon/natural_number_game/blob/master/SOLUTIONS.md" target="blank">Lösungen</a> (github.com, opens in new window). Lösungen für jedes Level.

source: We just restarted Lean behind the scenes, so let's re-import the natural numbers, but this time without addition and multiplication.
de: Wir haben gerade Lean im Hintergrund neu gestartet, lass uns also die natürlichen Zahlen neu importiert, aber dieses Mal ohne Addition und Multiplikation.

source: import mynat.definition -- import Peano's definition of the natural numbers {0,1,2,3,4,...}
de: import mynat.definition -- importiert die Definition nach den Peano Axiomen.
