Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Advanced proposition world. ## Level 5: `iff_trans` easter eggs. Let's try `iff_trans` again. Try proving it in other ways. ### A trick. Instead of using `cases` on `h : P ↔ Q` you can just access the proofs of `P → Q` and `Q → P` directly with `h.1` and `h.2`. So you can solve this level with ``` intros hpq hqr, split, intro p, apply hqr.1, ... ``` ### Another trick Instead of using `cases` on `h : P ↔ Q`, you can just `rw h`, and this will change all `P`s to `Q`s in the goal. You can use this to create a much shorter proof. Note that this is an argument for *not* running the `cases` tactic on an iff statement; you cannot rewrite one-way implications, but you can rewrite two-way implications. ### Another trick `cc` works on this sort of goal too.
de: Fortgeschrittene Welt der Aussagen. ## Level 5: `iff_trans` easter eggs. Lass uns noch einmal `iff_trans` ansehen. Versuche es anders zu beweisen! ### Ein Trick: Anstelle von `cases` für `h : P ↔ Q` zu verwenden kannst du einfach die Beweise von `P → Q` und `Q → P` direkt verwenden, indem du `h.1` und `h.2`tippst. Du kannst das Level mit folgender Kommandofolge lösen: ``` intros hpq hqr, split, intro p, apply hqr.1, ... ``` ### Noch ein Trick Anstelle von `cases` kannst du auch einfach `rw h` verwenden und alle `P`s in `Q`s im Ziel verwandeln. Damit kann man einen deutlich kürzeren Beweis schreiben. Beachte, dass dies ein Argument dafür ist, die `cases` Taktik nicht auf eine Äquivalenz anzuwenden. Du kannst keine einseitigen Implikationen umschreiben, aber zweiseitige! ### Und noch ein Trick! `cc` funktioniert auch für solche Ziele!

source: If $P$, $Q$ and $R$ are true/false statements, then `P ↔ Q` and `Q ↔ R` together imply `P ↔ R`.
de: Wenn $P$, $Q$ und $R$ Wahr/Falsch Aussagen sind, dann implizieren `P ↔ Q` und `Q ↔ R` zusammen `P ↔ R`.

source: # Advanced proposition world. ## Level 6: Or, and the `left` and `right` tactics. `P ∨ Q` means "$P$ or $Q$". So to prove it, you need to choose one of `P` or `Q`, and prove that one. If `⊢ P ∨ Q` is your goal, then `left` changes this goal to `⊢ P`, and `right` changes it to `⊢ Q`. Note that you can take a wrong turn here. Let's start with trying to prove $Q\implies (P\lor Q)$. After the `intro`, one of `left` and `right` leads to an impossible goal, the other to an easy finish.
de: # Fortgeschrittene Welt der Aussagen. ## Level 6: Oder und die `left` und `right` Taktiken. `P ∨ Q` bedeutet "$P$ oder $Q$". Um das zu beweisen genügt es, sich `P` oder `Q` auszusuchen und das zu beweisen. Wenn dein Ziel `⊢ P ∨ Q` ist, dann wird `left` `P` auswählen, also `⊢ P` und `right``Q`, also `⊢ Q`. Beachte, dass man sich hier leicht verirren kann. Lass uns damit anfangen $Q\implies (P\lor Q)$ zu beweisen. Nach dem `intro` wird entweder `left` oder `right` zu einem unmöglichen Ziel führen, das andere dagegen ist leicht zu lösen.

source: If $P$ and $Q$ are true/false statements, then $$Q\implies(P\lor Q).$$
de: Sind $P$ und $Q$ Wahr/Falsch Aussagen, dann gilt: $$Q\implies(P\lor Q).$$

source: ## Summary `left` and `right` work on the goal, and they change `⊢ P ∨ Q` to `⊢ P` and `⊢ Q` respectively. ## Details The tactics `left` and `right` work on a goal which is a type with two constructors, the classic example being `P ∨ Q`. To prove `P ∨ Q` it suffices to either prove `P` or prove `Q`, and once you know which one you are going for you can change the goal with `left` or `right` to the appropriate choice.
de: ## Zusammenfassung `left` und `right` operieren auf dem Ziel und verändern `⊢ P ∨ Q` zu `⊢ P` oder `⊢ Q`. ## Details Die Taktiken `left` und `right` operieren auf einem Ziel, das einem Typ mit zwei Konstruktoren entspricht. Das einfachste Beispiel ist `P ∨ Q`. Um `P ∨ Q` zu beweisen genügt es, entweder `P` oder `Q`zu beweisen. Sobald du doch für eines entscheiden hast kannst du entweder `left` oder `right` verwenden, je nachdem, was einfacher ist.

source: # Advanced proposition world. ## Level 7: `or_symm` Proving that $(P\lor Q)\implies(Q\lor P)$ involves an element of danger. `intro h,` is the obvious start. But now, even though the goal is an `∨` statement, both `left` and `right` put you in a situation with an impossible goal. Fortunately, after `intro h,` you can do `cases h with p q`. Then something new happens: because there are two ways to prove `P ∨ Q` (namely, proving `P` or proving `Q`), the `cases` tactic turns one goal into two, one for each case. You should be able to make it home from there.
de: # Fortgeschrittene Welt der Aussagen. ## Level 7: `or_symm` Zu beweisen, dass $(P\lor Q)\implies(Q\lor P)$ gilt, beinhaltet eine Gefahr. `intro h,` ist der offensichtliche Startpunkt, aber dann haben wir ein Problem. Sowohl `left` als auch `right` bringen uns zu einem unmöglichen Ziel. Glücklicherweise kannst du stattdessen `cases h with p q` verwenden. Es passiert dann etwas neues! Da es zwei Wege gibt `P ∨ Q` zu beweisen (nämlich `P` oder `Q` beweisen), splittet `cases` ein Ziel in zwei Ziele auf. Von hier aus solltest du alleine weiterkommen.

source: If $P$ and $Q$ are true/false statements, then $$P\lor Q\implies Q\lor P.$$
de: Wenn $P$ und $Q$ Wahr/Falsch Aussagen sind, dann gilt: $$P\lor Q\implies Q\lor P.$$

source: # Advanced proposition world. ## Level 8: `and_or_distrib_left` We know that `x(y+z)=xy+xz` for numbers, and this is called distributivity of multiplication over addition. The same is true for `∧` and `∨` -- in fact `∧` distributes over `∨` and `∨` distributes over `∧`. Let's prove one of these.
de: # Fortgeschrittene Welt der Aussagen. ## Level 8: `and_or_distrib_left` Wir wissen, dass für Zahlen gilt: `x(y+z)=xy+xz` Dieses Gesetz wird das Distributivgesetz der Multiplikation genannt. Für `∧` und `∨` gilt dasselbe - tatsächlich ist `∧` distributiv über `∨` und auch umgekehrt! Lass uns eins davon beweisen.

source: If $P$. $Q$ and $R$ are true/false statements, then $$P\land(Q\lor R)\iff(P\land Q)\lor (P\land R).$$
de: Wenn $P$, $Q$ und $R$ Wahr/Falsch Aussagen, dann gilt: $$P\land(Q\lor R)\iff(P\land Q)\lor (P\land R).$$

source: ## Pro tip Did you spot the import? What do you think it does? If you follow the instructions at <a href="https://github.com/leanprover-community/mathlib#installation" target="blank">the mathlib github page</a> you will be able to install Lean and mathlib on your own system, and then you can create a new project and experiment with such imports yourself.
de: ## Profi Tipp Hast du den Import bemerkt? Was glaubst du tut er?Wenn du den Anweisungen auf der <a href="https://github.com/leanprover-community/mathlib#installation" target="blank">mathlib github Seite</a> folgst kannst du Lean und mathlib auf deinem eigenen System installieren. Dann kannst du eigene Projekte anlegen und solche Importe selbst ausprobieren.

source: import tactic.tauto -- useful high-powered tactic
de: import tactic.tauto -- eine nützliche, mächtige Taktik

source: # Advanced proposition world. You already know enough to embark on advanced addition world. But here are just a couple more things. ## Level 9: `exfalso` and proof by contradiction. It's certainly true that $P\land(\lnot P)\implies Q$ for any propositions $P$ and $Q$, because the left hand side of the implication is false. But how do we prove that `false` implies any proposition $Q$? A cheap way of doing it in Lean is using the `exfalso` tactic, which changes any goal at all to `false`. You might think this is a step backwards, but if you have a hypothesis `h : ¬ P` then after `rw not_iff_imp_false at h,` you can `apply h,` to make progress. Try solving this level without using `cc` or `tauto`, but using `exfalso` instead.
de: # Fortgeschrittene Welt der Aussagen. Du weißt jetzt schon genug, um die fortgeschrittene Welt der Addition zu betreten, aber hier gibt es noch ein paar nützliche Dinge: ## Level 9: `exfalso` und der Beweis durch Widerspruch. Es ist natürlich wahr, dass $P\land(\lnot P)\implies Q$ für beliebige Aussagen $P$ und $Q$ gilt. Das liegt daran, dass die linke Seite der Implikation schon falsch ist. Aber wie kann man beweisen, dass aus `false` eine beliebige Aussage $Q$ folgt? Eine einfache Methode wäre die `exfalso` Taktik. Diese Taktik dreht beliebige Ziele zu `false`. Man könnte jetzt denken, dass das ein Schritt rückwärts ist, aber wenn man eine Hypothese `h : ¬ P` betrachtet, dann wird nach `rw not_iff_imp_false at h,` `apply h`große Fortschritte machen . Versuche das Level ohne `cc` oder `tauto` zu lösen, sondern stattdessen mit `exfalso`.

source: If $P$ and $Q$ are true/false statements, then $$(P\land(\lnot P))\implies Q.$$
de: Wenn $P$ und $Q$ Wahr/Falsch Aussagen sind, dann gilt: $$(P\land(\lnot P))\implies Q.$$

source: ## Pro tip. `¬ P` is actually `P → false` *by definition*. Try commenting out `rw not_iff_imp_false at ...` by putting two minus signs `--` before the `rw`. Does it still compile?
de: ## Profi Tipp: `¬ P` ist eigentlich `P → false` *nach Definition*. Versuche `rw not_iff_imp_false at ...` auszukommentieren, indem du zwei Minuszeichen `--` vor `rw` schreibst. Kompiliert es immer noch?

source: ## Summary `exfalso` changes your goal to `false`. ## Details We know that `false` implies `P` for any proposition `P`, and so if your goal is `P` then you should be able to `apply` `false → P` and reduce your goal to `false`. This is what the `exfalso` tactic does. The theorem that `false → P` is called `false.elim` so one can achieve the same effect with `apply false.elim`. This tactic can be used in a proof by contradiction, where the hypotheses are enough to deduce a contradiction and the goal happens to be some random statement (possibly a false one) which you just want to simplify to `false`.
de: ## Zusammenfassung `exfalso` verändert dein Ziel zu `false`. ## Details Wir wissen, dass `false` eine beliebige Aussage `P` impliziert. Wenn dein Ziel also `P`ist, dann kannst du mit `apply` `false → P` verwenden und dein Ziel auf `false` reduzieren. Das ist es, was `exfalso` kann. Der Satz, der `false → P` beinhaltet wird `false.elim` genannt. Deswegen hat `apply false.elim` denselben Effekt. Diese Taktik kann in einem Beweis durch Widerspruch benutzt werden, in dem die Hypothesen ausreichen, um einen Widerspruch zu erzeugen und das Ziel eine zufällige Aussage (möglicherweise eine falsche) ist. Dann kannst du es zu `false` vereinfachen.

source: local attribute [instance, priority 10] classical.prop_decidable -- we are mathematicians
de: lokales Attribut [Instanz, Priorität 10] classical.prop_decidable -- wir sind Mathematiker.

source: # Advanced proposition world. ## Level 10: the law of the excluded middle. We proved earlier that `(P → Q) → (¬ Q → ¬ P)`. The converse, that `(¬ Q → ¬ P) → (P → Q)` is certainly true, but trying to prove it using what we've learnt so far is impossible (because it is not provable in constructive logic). For example, after ``` intro h, intro p, repeat {rw not_iff_imp_false at h}, ``` in the below, you are left with ``` P Q : Prop, h : (Q → false) → P → false p : P ⊢ Q ``` The tools you have are not sufficient to continue. But you can just prove this, and any other basic lemmas of this form like `¬ ¬ P → P`, using the `by_cases` tactic. Instead of starting with all the `intro`s, try this instead: `by_cases p : P; by_cases q : Q,` **Note the semicolon**! It means "do the next tactic to all the goals, not just the top one". After it, there are four goals, one for each of the four possibilities PQ=TT, TF, FT, FF. You can see that `p` is a proof of `P` in some of the goals, and a proof of `¬ P` in others. Similar comments apply to `q`. `repeat {cc}` then finishes the job. This approach assumed that `P ∨ ¬ P` was true; the `by_cases` tactic just does `cases` on this result. This is called the law of the excluded middle, and it cannot be proved just using tactics such as `intro` and `apply`.
de: # Fortgeschrittene Welt der Aussagen. ## Level 10: Der Satz vom ausgeschlossenen Dritten. We haben schon bewiesen, dass `(P → Q) → (¬ Q → ¬ P)` gilt. Die Umkehrung `(¬ Q → ¬ P) → (P → Q)` ist sicherlich wahr, aber wenn wir versuchen würden, dies mit allem zu beweisen, was wir bisher wissen, würden wir scheitern. (das liegt daran, dass es mit konstruktiver Logik nicht beweisbar ist!) Zum Beispiel: ``` intro h, intro p, repeat {rw not_iff_imp_false at h}, ``` Danach bleibt noch übrig: ``` P Q : Prop, h : (Q → false) → P → false p : P ⊢ Q ``` Unsere Werkzeuge reichen nicht aus, um weiterzumachen. Aber man kann diese Aussage und andere grundlegende Lemmata dieser Form wie `¬ ¬ P → P` beweisen, indem man die `by_cases` Taktik verwendet. Anstatt mit `intro`s, versuche stattdessen das: `by_cases p : P; by_cases q : Q,` **Beachte den Strichpunkt**! Er bedeutet "wende die nächste Taktik auf alle Ziele an, nicht nur das oberste". Danach gibt es vier Ziele, eines für jede der vier Möglichkeiten PQ=TT, TF, FT, FF. `p` ist ein Beweis für `P` in einigen der Ziele und für `¬ P` in anderen. Ähnliches gilt auch für `q`. `repeat {cc}` beendet dann alle Ziele. In diesem Ansatz nehmen wir an, dass `P ∨ ¬ P` wahr ist; die `by_cases` Taktik wendet `cases` auf dieses Ergebnis an. Das nennt man den Satz vom ausgeschlossenen Dritten und es kann nicht mit Taktiken wie `intro` und `apply` bewiesen werden.

source: If $P$ and $Q$ are true/false statements, then $$(\lnot Q\implies \lnot P)\implies(P\implies Q).$$
de: Wenn $P$ und $Q$ Wahr/Falsch Aussagen sind, dann gilt: $$(\lnot Q\implies \lnot P)\implies(P\implies Q).$$

source: OK that's enough logic -- now perhaps it's time to go on to Advanced Addition World! Get to it via the main menu.
de: In Ordnung, das ist jetzt genug Logik -- es ist vielleicht ander Zeit in die fortgeschrittene Welt der Addition zu gehen. Du findest sie über das Hauptmenü!

source: ## Pro tip In fact the tactic `tauto!` just kills this goal (and many other logic goals) immediately.
de: ## Profi Tipp Tatsächlich kann die Taktik `tauto` dieses Ziel direkt erfüllen (undviele andere logische Ziele).

source: ## Summary `by_cases h : P` does a cases split on whether `P` is true or false. ## Details Some logic goals cannot be proved with `intro` and `apply` and `exact`. The simplest example is the law of the excluded middle `¬ ¬ P → P`. You can prove this using truth tables but not with `intro`, `apply` etc. To do a truth table proof, the tactic `by_cases h : P` will turn a goal of `⊢ ¬ ¬ P → P` into two goals ``` P : Prop, h : P ⊢ ¬¬P → P P : Prop, h : ¬P ⊢ ¬¬P → P ``` Each of these can now be proved using `intro`, `apply`, `exact` and `exfalso`. Remember though that in these simple logic cases, high-powered logic tactics like `cc` and `tauto!` will just prove everything.
de: ## Zusammenfassung `by_cases h : P` erzeugt eine Fallunterscheidung, ob `P` wahr oder fasch ist. ## Details Einige logische Ziele können nicht mit `intro`, `apply` und `exact` gelöst werden. Das einfachste Beispiel ist der Satz vom ausgeschlossenen Dritten: `¬ ¬ P → P`. Man kan dies mit Wahrheitstabellen beweisen, aber nicht mit `intro`, `apply`, etc. Um eine Wahrheitstabelle zu erzeugen kann `by_cases h : P` verwendet werden, um ein Ziel `⊢ ¬ ¬ P → P` in zwei Ziele zu zerlegen. ``` P : Prop, h : P ⊢ ¬¬P → P P : Prop, h : ¬P ⊢ ¬¬P → P ``` Jedes Einzelne davon kann jetzt mit `intro`, `apply`, `exact`und `exfalso` bewiesen werden. Denk daran, dass in diesen einfachen logischen Fällen mächtige Taktiken wie `cc` und `tauto` direkt alles beweisen.

source: ## Summary The `tauto` tactic (and its variant `tauto!`) will close various logic goals. ## Details `tauto` is an all-purpose logic tactic which will try to solve goals using pure logical reasoning -- for example it will close the following goal: ``` P Q : Prop, hP : P, hQ : Q ⊢ P ∧ Q ``` `tauto` is supposed to only use constructive logic, but its big brother `tauto!` uses classical logic and hence closes more goals.
de: ## Zusammenfassung Die `tauto`Taktik (und seine Variante `tauto!`) wird verschiedene logische Ziele erfüllen. ## Details `tauto` ist eine Allzweck Logik Taktik, die versucht Ziele nur durch reines logisches Argumentieren zu erfüllen -- zum Beispiel schließt es das folgende Ziel: ``` P Q : Prop, hP : P, hQ : Q ⊢ P ∧ Q ``` `tauto` kann nur konstruktive Logik verwenden, aber sein großer Bruder `tauto!` benutzt klassische Logik und kann deswegen mehr.

source: Advanced Addition world
de: Fortgeschrittene Welt der Addition

source: # Advanced Addition World ## Level 1: `succ_inj`. A function. Peano's original collection of axioms for the natural numbers contained two further assumptions, which have not yet been mentioned in the game: ``` succ_inj {a b : mynat} : succ(a) = succ(b) → a = b zero_ne_succ (a : mynat) : zero ≠ succ(a) ``` The reason they have not been used yet is that they are both implications, that is, of the form $P\implies Q$. This is clear for `succ_inj a b`, which says that for all $a$ and $b$ we have $succ(a)=succ(b)\implies a=b$. For `zero_ne_succ` the trick is that $X\ne Y$ is *defined to mean* $X = Y\implies{\tt false}$. If you have played through Proposition world, you now have the required Lean skills (i.e., you know the required tactics) to work with these implications. Let's finally learn how to use `succ_inj`. You should know a couple of ways to prove the below -- one directly using an `exact`, and one which uses an `apply` first. But either way you'll need to use `succ_inj`.
de: # Fortgeschrittene Welt der Addition ## Level 1: `succ_inj`. Eine Funktion Peanos ursprüngliche Axiome für die natürlichen Zahlen enthalten zwei weitere Annahmen, die wir bis jetzt noch nicht im Spiel erwähnt wurden: ``` succ_inj {a b : mynat} : succ(a) = succ(b) → a = b zero_ne_succ (a : mynat) : zero ≠ succ(a) ``` Der Grund dafür, dass sie bisher noch nicht verwendet wurden ist, dass sie beide Implikationen der Form $P\implies Q$ sind. Für `succ_inj a b` ist das klar, da es sagt, dass für alle $a$ und $b$ gilt: $succ(a)=succ(b)\implies a=b$.Für `zero_ne_succ` liegt der Trick in der Tatsache, dass $X\ne Y$ *definiert* ist als $X = Y\implies{\tt false}$. Wenn du die Welt der Aussagen gespielt hast, hast du jetzt alle erforderlichen Fähigkeiten (also die entsprechenden Taktiken), um mit diesen Implikationen zu arbeiten. Lass uns endlich lernen, wie wir `succ_inj` verwenden können. Du solltest einige Wege kennen das zu beweisen -- einen direkten mit Hilfe von `exact` und eine weitere mit `apply`. In jedem Fall brauchst du `succ_inj`.

source: For all naturals $a$ and $b$, if we assume $succ(a)=succ(b)$, then we can deduce $a=b$.
de: Für alle natürlichen Zahlen $a$ und $b$ können wir, wenn $succ(a)=succ(b)$ gilt folger, dass gilt: $a=b$.

source: ## Important thing. You can rewrite proofs of *equalities*. If `h : A = B` then `rw h` changes `A`s to `B`s. But you *cannot rewrite proofs of implications*. `rw succ_inj` will *never work* because `succ_inj` isn't of the form $A = B$, it's of the form $A\implies B$. This is one of the most common mistakes I see from beginners. $\implies$ and $=$ are *two different things* and you need to be clear about which one you are using.
de: ## Wichtig. Du kannst Beweise mit *Gleichungen* umschreiben. Wenn `h : A = B` gilt, dann wird `rw h` `A`s zu `B`s umschreiben. Du kannst aber *keine Beweise mit Implikationen* umschreiben. `rw succ_inj` wird *nie* funktionieren. Das liegt daran, dass `succ_inj` nicht von der Form $A = B$ ist. Es ist von der Form $A\implies B$. Das ist einer der häufigsten Fehler, den Anfänger machen. $\implies$ und $=$ sind zwei *unterschiedliche Dinge* und dir muss klar sein, welches du benutzt.

source: # Advanced Addition World ## Level 2: `succ_succ_inj`.
de: # Fortgeschrittene Welt der Addition ## Level 2: `succ_succ_inj`.

source: In the below theorem, we need to apply `succ_inj` twice. Once to prove $succ(succ(a))=succ(succ(b))\implies succ(a)=succ(b)$, and then again to prove $succ(a)=succ(b)\implies a=b$. However `succ(a)=succ(b)` is nowhere to be found, it's neither an assumption or a goal when we start this level. You can make it with `have` or you can use `apply`.
de: Für den Satz unten brauchen wir `succ_inj` zweimal. Zuerst, um $succ(succ(a))=succ(succ(b))\implies succ(a)=succ(b)$ zu beweisen, dann für $succ(a)=succ(b)\implies a=b$. Allerdings ist `succ(a)=succ(b)` nicht vorhanden. Es ist weder eine Annahme noch ein Ziel, wenn das Level startet. Du kannst es mit mit `have` erzeugen oder einfach `apply` verwenden.

source: For all naturals $a$ and $b$, if we assume $succ(succ(a))=succ(succ(b))$, then we can deduce $a=b$.
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: aus $succ(succ(a))=succ(succ(b))$ folgt $a=b$.

source: ## Sample solutions to this level. Make sure you understand them all. And remember that `rw` should not be used with `succ_inj` -- `rw` works only with equalities or `↔` statements, not implications or functions.
de: ## Beispiellösungen für dieses Level. Du solltest alle verstehen, denk außerdem daran, dass `rw` nicht mit `succ_inj` funktioniert -- `rw` kann nur Gleichheiten oder `↔` Aussagen verwenden, keine Implikationen oder Funktionen.

source: # Advanced Addition World ## Level 3: `succ_eq_succ_of_eq`.
de: # Fortgeschrittene Welt der Addition ## Level 3: `succ_eq_succ_of_eq`.

source: We are going to prove something completely obvious: if $a=b$ then $succ(a)=succ(b)$. This is *not* `succ_inj`! This is trivial -- we can just rewrite our proof of `a=b`. But how do we get to that proof? Use the `intro` tactic.
de: Wir werden etwas völlig offensichtliches beweisen: wenn $a=b$ gilt, dann folgt $succ(a)=succ(b)$. Dies entspricht *nicht* `succ_inj`! Im Prinzip ist dieser Beweis trivial -- wir können einfach unseren Beweis von `a=b` umschreiben. Wie kommen wir aber an diesen heran? Verwende `intro`!

source: For all naturals $a$ and $b$, $a=b\implies succ(a)=succ(b)$.
de: Für alle natürlichen Zahlen $a$ und $b$ gilt: $a=b\implies succ(a)=succ(b)$.

source: # Advanced Addition World ## Level 4: `eq_iff_succ_eq_succ` Here is an `iff` goal. You can split it into two goals (the implications in both directions) using the `split` tactic, which is how you're going to have to start. `split,` Now you have two goals. The first is exactly `succ_inj` so you can close it with `exact succ_inj,` and the second one you could solve by looking up the name of the theorem you proved in the last level and doing `exact <that name>`, or alternatively you could get some more `intro` practice and seeing if you can prove it using `intro`, `rw` and `refl`.
de: # Fortgeschrittene Welt der Addition ## Level 4: `eq_iff_succ_eq_succ` Wir haben hier ein `iff` Ziel. Du kannst es in zwei Ziele aufteilen mit Hilfe von `split`, so musst du auch anfangen! `split,` Jetzt hast du zwei Ziele. Das erste entspricht genau `succ_inj`, du kannst es also mit `exact succ_inj,` lösen. Das zweite Ziel könntest du erreichen, wenn du den Namen des Satzes aus dem letzten Level nachsiehst und `exact <der Name>`verwendest. Alternativ kannst du ein wenig `intro`, `rw` und `refl` üben.

source: Two natural numbers are equal if and only if their successors are equal.
de: Zwei natürliche Zahlen sind genau dann gleich, wenn ihre Nachfolger gleich sind.
