Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: # Tutorial world ## Level 3: Peano's axioms. The import above gives us the type `mynat` of natural numbers. But it also gives us some other things, which we'll take a look at now: * a term `0 : mynat`, interpreted as the number zero. * a function `succ : mynat → mynat`, with `succ n` interpreted as "the number after $n$". * The principle of mathematical induction. These axioms are essentially the axioms isolated by Peano which uniquely characterise the natural numbers (we also need recursion, but we can ignore it for now). The first axiom says that $0$ is a natural number. The second says that there is a `succ` function which eats a number and spits out the number after it, so $\operatorname{succ}(0)=1$, $\operatorname{succ}(1)=2$ and so on. Peano's last axiom is the principle of mathematical induction. This is a deeper fact. It says that if we have infinitely many true/false statements $P(0)$, $P(1)$, $P(2)$ and so on, and if $P(0)$ is true, and if for every natural number $d$ we know that $P(d)$ implies $P(\operatorname{succ}(d))$, then $P(n)$ must be true for every natural number $n$. It's like saying that if you have a long line of dominoes, and if you knock the first one down, and if you know that if a domino falls down then the one after it will fall down too, then you can deduce that all the dominos will fall down. One can also think of it as saying that every natural number can be built by starting at `0` and then applying `succ` a finite number of times. Peano's insights were firstly that these axioms completely characterise the natural numbers, and secondly that these axioms alone can be used to build a whole bunch of other structure on the natural numbers, for example addition, multiplication and so on. This game is all about seeing how far these axioms of Peano can take us. Let's practice our use of the `rw` tactic in the following example. Our hypothesis `h` is a proof that `succ(a) = b` and we want to prove that `succ(succ(a))=succ(b)`. In words, we're going to prove that if `b` is the number after `a` then `succ(b)` is the number after `succ(a)`. Now here's a tricky question. If our goal is `⊢ succ (succ a) = succ b`, and our hypothesis is `h : succ a = b`, then what will the goal change to when we type `rw h,` and hit enter whilst not forgetting the comma? Remember that `rw h` will look for the *left* hand side of `h` in the goal, and will replace it with the *right* hand side. Try and figure out how the goal will change, and then try it. The answer: Lean changed `succ a` into `b`, so the goal became `succ b = succ b`. That goal is of the form `X = X`, so you can prove this new goal with `refl,` on the line after `rw h,`. Don't forget the commas! **Important note** : the tactic `rw` expects a proof afterwards (e.g. `rw h1`). But `refl` is just `refl`. Note also that the system sometimes drops brackets when they're not necessary, and `succ b` just means `succ(b)`. You may be wondering whether we could have just substituted in the definition of `b` and proved the goal that way. To do that, we would want to replace the right hand side of `h` with the left hand side. You do this in Lean by writing `rw ← h`. You get the left-arrow by typing `\l` and then a space; note that this is a small letter L, not a number 1. You can just edit your proof and try it. You may also be wondering why we keep writing `succ(b)` instead of `b+1`. This is because we haven't defined addition yet! On the next level, the final level of Tutorial World, we will introduce addition, and then we'll be ready to enter Addition World.
de: # Tutorial Welt ## Level 3: Die Axiome von Peano. Der obige Import gibt uns den Typ 'mynat' der natürlichen Zahlen. Wir bekommen dadurch aber auch einige andere Dinge, die wir jetzt ansehen: * einen Term '0 : mynat', interpretierbar als die Zahl 0. * eine Funktion 'succ : mynat → mynat', die 'succ n' als "die Zahl nach $n$" interpretiert. (von 'successor') * Die Technik der vollständigen induktion. Diese Axiome sind im Wesentlichen die Axiome von Peano, die eindeutig die natürlichen Zahlen charakterisieren (Wir brauchen auch Rekursion, aber das ignorieren wir erst einmal). Das erste Axiom bestimmt, dass $0$ eine natürliche Zahl ist. Das zweite Axiom legt fest, dass es eine Funktion 'succ' gibt, die eine natürliche Zahl frisst und die nächste Zahl ausspuckt, also ist $\operatorname{succ}(0)=1$, $\operatorname{succ}(1)=2$ und so weiter. Das letzte Axiom von Peano ist das Prinzip der vollständigen Induktion. Bei diesem Axiom handelt es sich um tiefgreifendere Tatsache. Es geht darum, dass wir unendlich viele Aussagen $P(0)$, $P(1)$, usw. haben, wahr oder falsch sein können. Wenn $P(0)$ wahr ist und wir gleichzeitig für jede natürliche Zahl $d$ wissen, dass $P(d)$ $P(\operatorname{succ}(d))$ impliziert, dann muss $P(n)$ für jede natürliche Zahl $n$ wahr sein. Die Argumentation entspricht etwa dem Folgenden: Wir haben eine lange Reihe von Dominosteinen und wissen, dass der erste Stein fällt. Außerdem wissen wir, dass aus dem Fall eines Dominosteins, der Fall des nächsten folgt. Daraus können wir folgern, dass alle Steine fallen werden. Man könnte es auch so sehen: Wir können jede beliebige natürliche Zahl bauen, indem wir bei der '0' anfangen und dann endlich oft 'succ' anwenden. Peano erkannte erstens, dass die natürlichen Zahlen durch die Axiome völlig beschrieben werden. Zweitens, dass diese Axiome allein schon ausreichen, um viele andere Strukturen auf den natürlichen Zahlen zu definieren, zum Beispiel die Addition, die Multiplikation, etc. In diesem Spiel geht es darum zu sehen, wie weit wir mit Peanos Axiomen kommen. Üben wir die Verwendung von 'rw' mit einem Beispiel. Unsere Hypothese 'h' ist der Beweis dafür, dass gilt: 'succ(a)=b'. Wir wollen jetzt 'succ(succ(a))=succ(b)' zeigen. In Worten bedeutet dies: "Wenn 'b' die Zahl nach 'a' ist, dann ist 'succ(b)' die Zahl nach 'succ(a)'. Jetzt eine spannende Frage - wenn unser Ziel `⊢ succ (succ a) = succ b` und unsere Hypothese `h : succ a = b` ist, wie wird unser Ziel aussehen, wenn wir `rw h,` eingeben und auf Enter drücken (sofer wir das Komma nicht vergessen haben)? Zur Erinnerung: 'rw h' wird die *linken' Seite von 'h' im Ziel suchen und sie mit der *rechten* Seite ersetzen. Versuche zuerst, die Veränderung vorherzusehen und probiere es dann einfach aus. Die Antwort: Lean hat 'succ a' zu 'b' umgeschrieben, also ist das neue Ziel'succ b = succ b'. Dieses Ziel hat die Form `X = X`, kann also mit `refl,` in der Zeile nach `rw h,` bewiesen werde. Vergiss die Kommas nicht! **Wichtig**: um die Taktik `rw`anwenden zu können, muss ein Beweis folgen (z.B. 'rw h1'). Aber `refl`bleibt einfach `refl`. Außerdem wird Lean manchmal Klammern schreiben, die nicht notwendig sind. `succ b`bedeutet einfach `succ(b)`. Du fragst dich vielleicht, ob wir nicht einfach die Definition von `b` einsetzen hätten können und so das Ziel beweisen. Um das zu schaffen, könnten wir die rechte Seite von `h`mit der linken Seite ersetzen. Das können wir mit `rw ←h` Der Pfeil nach links kann durch `\l` geschrieben werden. Der Buchstabe ist ein kleines L und keine 1. Ändere deinen Beweis und versuche es. Du könntest dich auch fragen, warum wir `succ(b)* anstelle von `b+1`schreiben. Das liegt daran, dass wir Addition noch nicht definiert haben! Im nächsten Level, dem Bosslevel der Tutorial Welt, werden wir Addition einführen. Anschließend sind wir bereit uns in die Welt der Addition zu stürzen.

source: If $\operatorname{succ}(a) = b$, then $$\operatorname{succ}(\operatorname{succ}(a)) = \operatorname{succ}(b).$$
de: Wenn $\operatorname{succ}(a) = b$ gilt, dann folgt $$\operatorname{succ}(\operatorname{succ}(a)) = \operatorname{succ}(b).$$

source: import mynat.add -- definition of addition
de: import mynat.add -- Definition der Addition

source: # Tutorial world ## Level 4: addition We have a new import -- the definition of addition. Peano defined addition `a + b` by induction on `b`, or, more precisely, by *recursion* on `b`. He first explained how to add 0 to a number: this is the base case. * `add_zero (a : mynat) : a + 0 = a` We will call this theorem `add_zero`. More precisely, `add_zero` is the name of the *proof* of the theorem. **Note the name of this proof**. Mathematicians sometimes call it "Lemma 2.1" or "Hypothesis P6" or something. But computer scientists call it `add_zero` because it tells you what the answer to "$x$ add zero" is. It's a *much* better name than "Lemma 2.1". Even better, we can use the rewrite tactic with `add_zero`. If you ever see `x + 0` in your goal, `rw add_zero` should simplify it to `x`. This is because `add_zero` is a proof that `x + 0 = x` (more precisely, `add_zero x` is a proof that `x + 0 = x` but Lean can figure out the `x` from the context). Now here's the inductive step. If you know how to add `d` to `a`, then Peano tells you how to add `succ(d)` to `a`. It looks like this: * `add_succ (a d : mynat) : a + succ(d) = succ (a + d)` What's going on here is that we assume `a + d` is already defined, and we define `a + succ(d)` to be the number after it. **Note the name of this proof too** -- `add_succ` tells you how to add a successor to something. If you ever see `... + succ ...` in your goal, you should be able to use `rw add_succ,` to make progress. Here is a simple example where we shall see both. Let's prove that $x$ add the number after $0$ is the number after $x$. Delete `sorry` (don't forget you can widen this box if you can't see the sorry). Observe that the goal mentions `... + succ ...`. So type `rw add_succ,` and hit enter; see the goal change. **Don't forget the commma**. Do you see that the goal now mentions ` ... + 0 ...`? So type `rw add_zero,` and then observe that you can close the goal with `refl,` and you're done. You have finished tutorial world! There are important things written below the lemma, including what to do next.
de: # Tutorial Welt ## Level 4: Addition Wir haben einen neuen Import - die Definition der Addition. Peano definiert die Addition `a + b` durch vollständige Induktion über `b`, oder etwas genauer gesagt, durch *Rekursion* über `b`. Er erklärt zuerst, wie man 0 zu einer Zahl addiert: Dies ist unser Basisfall (auch Induktionsanfang genannt). * `add_zero (a : mynat) : a + 0 = a` Wir nennen diesen Satz `add_zero`. Genauer gesagt, `add_zero` ist der Name des *Beweises* des Satzes. **Notiere dir den Namen dieses Beweises**. Mathematiker nennen ihn manchmal "Lemma 2.1" oder "Hypothese P6" oder etwas Ähnliches. Aber Informatiker nennen es `add_zero`, weil dieser Name dir sagt, was die Antwort auf die Frage "$x$ addiere Null" ist. Es ist ein wesentlich *besserer* Name als "Lemma 2.1". Noch besser ist, wir können `rw`mit `add_zero` verwenden. Wenn du jemals `x + 0` im Ziel siehst wird `rw add_zero` das zu `x` vereinfachen. Das liegt daran, dass `add_zero` ein Beweis für `x + 0 = x`` ist (Genauer gesagt ist `add_zero x` der Beweis für `x + 0 = x`, aber Lean kann `x`aus dem Kontext erschließen). Jetzt kommen wir zum Induktionsschritt. Wenn bekannt ist, wie man `d` zu `a` addiert, dann weiß sagt uns Peano, wie man `succ(d)` zu `a` addiert, das sieht so aus: * `add_succ (a d : mynat) : a + succ(d) = succ (a + d)` Wir nehmen an, `a + d` ist schon definiert und definieren weiterhin `a + succ(d)` als die Zahl danach. ** Beachte auch den Namen dieses Beweises** -- `ad_succ` verrät dir, wie man einen Nachfolger zu etwas addiert. Wenn du jemals etwas wie `... + succ ...` in deinem Ziel siehst, solltest du 'rw add_succ' verwenden können, um Fortschritte zu machen. Es folgt ein einfaches Beispiel, um beides zu demonstrieren. Wir beweisen: Wenn wir zu $x$ den Nachfolger von $0$ addieren, ergibt sich der Nachfolger von $x$. Lösche das `sorry` (Vergiss nicht: du kannst diese Box vergrößeren, wenn du es nicht siehst). Du kannst sehen, dass das Ziel `... + succ ... ` enthält. Gib `rw add_succ,` ein und drücke auf enter, du wirst sehen, dass sich das Ziel verändert. **Vergiss das Komma nicht!** Siehst du, dass das Ziel jetzt `... + 0 ...` enthält? Wir schreiben `rw add_zero,` und sofort kann man sehen, dass man das Ziel mit `refl,` erfüllen kann. Wir sind fertig! Du hast die Tutorial Welt abgeschlossen! Unter diesem Lemma findest du einige wichtige Dinge, insbesondere wie es weiter geht.

source: For all natural numbers $a$, we have $$a + \operatorname{succ}(0) = \operatorname{succ}(a).$$
de: Für alle natürlichen Zahlen $a$ gilt: $$a + \operatorname{succ}(0) = \operatorname{succ}(a).$$

source: ## Examining proofs. You might want to review this proof now; at three lines long it is our current record. Click on a line in the proof and use the L/R arrow keys to put your cursor as far left as it will go. Then use the U/D arrow keys to move your cursor up and down from line to line, and you can see what Lean is thinking on each line of the proof. ## No problems? When you're happy, let's move onto Addition World, and learn about proof by induction. Go back to the main menu and select addition world. ## Problems? Question: why has the top right hand box gone blank? Answer: Maybe you tried a tactic which didn't work. Or maybe you're in the middle of typing a tactic. Try deleting up to the last comma, *or adding a comma at the end of your code*. Look at the error message. What line is the first error on? Perhaps Lean thinks you're in the middle of writing a tactic command that you think you finished. If Lean is still attempting to process a tactic command it won't display anything. You can get it to stop processing by adding a comma. If the worst comes to the worst, just delete what you wrote. Most people with problems have written random stuff in the proof box. The only thing you're supposed to be writing is lines like `rw add_zero,` `rw h,` `refl,` One line of code with a comma at the end. Nothing else at all goes in the box. If you cannot see what you have done wrong, you can always <a href="https://github.com/ImperialCollegeLondon/natural_number_game/blob/master/SOLUTIONS.md" target="blank">take a look at the solutions</a> (github.com, opens in new window).
de: ## Beweise überprüfen. Vielleicht möchtest du diesen Beweis jetzt noch einmal ansehen. Mit drei Zeilen ist er unser bisheriger Rekordhalter. Klicke auf eine Zeile im Beweis und verwende die Pfeiltasten, um den Cursor so weit wie möglich nach links zu schieben. Wenn du dann nach oben und unten von Zeile zu Zeile navigierst kannst du sehen, was Lean über jede Zeile des Beweises denkt. ## Keine Probleme? Wenn du glücklich mit allem bist geht es weiter zur Welt der Addition. Dort lernen wir mehr über das Beweisen mit Hilfe der Induktion. Geh zurück zum Hauptmenü und wähle die 'Welt der Addition'. ## Probleme? Frage: warum ist die Box oben rechts leer? Antwort: vielleicht hast du eine Taktik verwendet, die nicht funktioniert. Oder vielleicht hast du eine Taktik noch nicht abgeschlossen. Versuche alles bis zum letzten Komma zu löschen *oder füge ein Komma am Ende deines Codes hinzu!* Sieh dir die Fehlermeldung an. In welcher Zeile ist der erste Fehler? Vielleicht denkt Lean du bist noch in einer Taktik, von der du denkst, du hättest sie bereits abgeschlossen. Wenn Lean immer noch versucht, einen Befehl auszuführen, dann wird es nichts anzeigen. Du kannst Lean dazu zwingen, aufzuhören, indem du ein Komma hinzufügst. Wenn es zum Schlimmsten kommt: lösche, was du geschrieben hast. Die meisten Leute mit Problemen haben irgendetwas unpassendes in die Beweisbox geschrieben. Das Einzige, was in die Box gehört sind Zeilen wie: `rw add_zero,` `rw h,` `refl,` Jede Zeile endet mit einem Komma. Nichts anderes kommt in die Box! Wenn du nicht verstehst, was falsch ist, kannst du immer noch <a href="https://github.com/ImperialCollegeLondon/natural_number_game/blob/master/SOLUTIONS.md" target="blank">die Lösungen ansehen. </a> (github.com, öffnet in einem neuen Fenster).

source: Addition world
de: Welt der Addition

source: import mynat.definition -- Imports the natural numbers.
de: import mynat.definition -- importiert die natürlichen Zahlen.

source: import mynat.add -- imports addition.
de: import mynat.add -- import die Addition.

source: ## Summary if `n : mynat` is in our assumptions, then `induction n with d hd` attempts to prove the goal by induction on `n`, with the inductive assumption in the `succ` case being `hd`. ## Details If you have a natural number `n : mynat` in your context (above the `⊢`) then `induction n with d hd` turns your goal into two goals, a base case with `n = 0` and an inductive step where `hd` is a proof of the `n = d` case and your goal is the `n = succ(d)` case. ### Example: If this is our local context: ``` n : mynat ⊢ 2 * n = n + n ``` then `induction n with d hd` will give us two goals: ``` ⊢ 2 * 0 = 0 + 0 ``` and ``` d : mynat, hd : 2 * d = d + d ⊢ 2 * succ d = succ d + succ d ```
de: ## Zusammenfassung Wenn unsere Annahme `n : mynat` ist, dann wird `induction n with d hd` versuchen das Ziel mit Induktion über `n`zu lösen, wobei die Annahme der Induktion im Fall von `succ` mit `hd` bezeichnet wird. ## Details Wenn eine natürliche Zahl `n : mynat` in deinem Kontext steht (über dem `⊢`), dann wird `induction n with d hd` dein Ziel in zwei Ziele aufteilen. In einen Basisfall mit `n = 0` und einen Induktionsschritt, in dem das Ziel der Fall `n = succ(d) ist. ### Beispiel: Wenn das unser aktueller Kontext ist: ``` n : mynat ⊢ 2 * n = n + n ``` dann wird `induction n with d hd` uns zwei Ziele erzeugen: ``` ⊢ 2 * 0 = 0 + 0 ``` und ``` d : mynat, hd : 2 * d = d + d ⊢ 2 * succ d = succ d + succ d ```
