Repository: ImperialCollegeLondon/natural_number_game
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de

source: ## Summary: `intro p` will turn a goal `⊢ P → Q` into a hypothesis `p : P` and goal `⊢ Q`. If `P` and `Q` are sets `intro p` means "let $p$ be an arbitrary element of $P$". If `P` and `Q` are propositions then `intro p` says "assume $P$ is true". ## Details If your goal is a function or an implication `⊢ P → Q` then `intro` will always make progress. `intro p` turns `⊢ P → Q` into ``` p : P ⊢ Q ``` The opposite tactic to intro is `revert`; given the situation just above, `revert p` turns the goal back into `⊢ P → Q`. There are two points of view with `intro` -- the function point of view (Function World) and the proposition point of view (Proposition World). ## Example (functions) What does it mean to define a function? Given an arbitrary term of type `P` (or an element of the set `P` if you think set-theoretically) you need to come up with a term of type `Q`, so your first step is to choose `p`, an arbitary element of `P`. `intro p,` is Lean's way of saying "let $p\in P$ be arbitrary". The tactic `intro p` changes ``` ⊢ P → Q ``` into ``` p : P ⊢ Q ``` So `p` is an arbitrary element of `P` about which nothing is known, and our task is to come up with an element of `Q` (which can of course depend on `p`). ## Example (propositions) If your goal is an implication $P\implies Q$ then Lean writes this as `⊢ P → Q`, and `intro p,` can be thought of as meaning "let $p$ be a proof of $P$", or more informally "let's assume that $P$ is true". The goal changes to `⊢ Q` and the hypothesis `p : P` appears in the local context.
de: ## Zusammenfassung: `intro` wird jedes Ziel `⊢ P → Q` in eine Hypothese `p : P` und ein Ziel `⊢ Q` verwandeln. Wenn `P` und `Q` Mengen sind bedeutet `intro p`: " Sei $p$ ein beliebiges Element von $P$". Wenn `P`und `Q` Aussagen sind, dann bedeutet `intro p`: "nimm an, dass $P$ wahr ist". ## Details Wenn dein Ziel eine Funktion oder eine Implikation `⊢ P → Q` ist, dann wird `intro` immer Fortschritte machen. `intro p` verwandelt `⊢ P → Q` in ``` p : P ⊢ Q ``` Die umgekehrte Taktik zu intro ist `revert`. Betrachten wir die obige Situation, dann wird `revert p`das Ziel zurück in `⊢ P → Q` verwandeln. Es gibt zwei Möglichkeiten `intro` zu betachten -- den Funktionsstandpunkt (Welt der Funktionen) und den Aussagenstandpunkt (Welt der Aussagen). ## Beispiel (Funktionen) Was bedeutet es eine Funktion zu definieren? Gegeben ist ein beliebiger Term vom Typ `P` (oder ein Element der Menge `P`, wenn du mengentheoretisch denkst). Du musst jetzt einen Term vom Typ `Q` finden, also muss der erste Schritt sein, ein allgemeines Element `p` von `P` zu wählen. `intro p,` ist Leans Art zu sagen: "sei $p\in P$ beliebig"Die Taktik `intro p` verändert ``` ⊢ P → Q ``` zu ``` p : P ⊢ Q ``` Also ist `p` ein beliebiges Element von `P` worüber wir nichts wissen. Unsere Aufgabe ist es jetzt ein Element von `Q` zu finden (welches natürlich von `p` abhängen kann). ## Beispiel (Aussagen) Wenn dein Ziel eine Implikation $P\implies Q$ ist, dann schreibt Lean das als `⊢ P → Q` und `intro p` bedeutet: "sei $p$ ein Beweis für $P$" oder informeller "nehmen wir an, dass $P$ waht ist". Das Ziel verändert sich zu `⊢ Q` und die Hypothese `p : P` erscheint im Kontext.

source: # Function world. ## Level 2: the `intro` tactic. Let's make a function. Let's define the function on the natural numbers which sends a natural number $n$ to $3n+2$. If you delete the `sorry` you will see that our goal is `mynat → mynat`. A mathematician might denote this set with some exotic name such as $\operatorname{Hom}(\mathbb{N},\mathbb{N})$, but computer scientists use notation `X → Y` to denote the set of functions from `X` to `Y` and this name definitely has its merits. In type theory, `X → Y` is a type (the type of all functions from $X$ to $Y$), and `f : X → Y` means that `f` is a term of this type, i.e., $f$ is a function from $X$ to $Y$. To define a function $X\to Y$ we need to choose an arbitrary element $x\in X$ and then, perhaps using $x$, make an element of $Y$. The Lean tactic for "let $x\in X$ be arbitrary" is `intro x`. ## Rule of thumb: If your goal is `P → Q` then `intro p` will make progress. To solve the goal below, you have to come up with a function from `mynat` to `mynat`. Start with `intro n,` (i.e. "let $n\in\mathbb{N}$ be arbitrary") and note that our local context now looks like this: ``` n : mynat ⊢ mynat ``` Our job now is to construct a natural number, which is allowed to depend on $n$. We can do this using `exact` and writing a formula for the function we want to define. For example we imported addition and multiplication at the top of this file, so `exact 3*n+2,` will close the goal, ultimately defining the function $f(n)=3n+2$.
de: # Welt der Funktionen. ## Level 2: die `intro` Taktik. Lass uns eine Funktion bauen. Wir definieren eine Funktion auf den natürlichen Zahlen, die eine natürliche Zahl $n$ auf $3n+2$ schickt. Wenn du das `sorry` löscht, dann wirst du sehen, dass unser Ziel `mynat → mynat` lautet. Ein Mathematiker würde das vielleicht mit einem exotischen Namen wie $\operatorname{Hom}(\mathbb{N},\mathbb{N})$ bezeichnen. Aber Informatiker verwenden die Schreibweise `X → Y`, um die Menge an Funktionen von `X` zu `Y` zu schreiben und dieser Name hat definitiv seine Vorzüge. In der Typentheorie ist `X → Y` ein Typ (der Typ aller Funktionen von $X$ zu $Y$) und `f : X → Y` bedeutet, dass `f` ein Term dieses Typs ist, zum Beispiel ist $f$ eine Funktion von $X$ nach $Y$. Um eine Funktion $X \to Y$ zu definieren müssen wir ein beliebiges Element $x \in X$ auswählen und dann, möglicherweise mit Hilfe von $x$, ein Element von $Y$ konstruieren. Die Lean Taktik für "sei $x \in X$ beliebig" ist `intro x`. ## Daumenregel: Wenn dein Ziel `P → Q` lautet, dann wird `intro p` nützlich sein. Um das untenstehende Ziel zu lösen musst du eine Funktion von ' mynat' zu `mynat` bauen. Starte mit `intro n,` (z.B. "sei $n \in \mathbb{N}$ beliebig") und beachte, dass unser lokaler Kontext jetzt so aussieht: ``` n : mynat ⊢ mynat ``` Unsere Aufgabe ist es jetzt, eine natürliche Zahl zu konstruieren, die von $n$ abhängen darf. Wir können das mit `exact` lösen und eine Formel für die zu definierende Funktion schreiben. Beispielsweise haben wir die Addition und die Multiplikation bereits importiert, also wird `exact 3*n+2,` das Ziel lösen, was uns im Prinzip die Funktion $f(n)=3n+2$ definiert.

source: We define a function from mynat to mynat.
de: Wir definieren eine Funktion von `mynat` zu `mynat`.

source: ## Summary `have h : P,` will create a new goal of creating a term of type `P`, and will add `h : P` to the hypotheses for the goal you were working on. ## Details If you want to name a term of some type (because you want it in your local context for some reason), and if you have the formula for the term, you can use `have` to give the term a name. ## Example (`have q := ...` or `have q : Q := ...`) If the local context contains ``` f : P → Q p : P ``` then the tactic `have q := f(p),` will add `q` to our local context, leaving it like this: ``` f : P → Q p : P q : Q ``` If you think about it, you don't ever really need `q`, because whenever you think you need it you coudl just use `f(p)` instead. But it's good that we can introduce convenient notation like this. ## Example (`have q : Q,`) A variant of this tactic can be used where you just declare the type of the term you want to have, finish the tactic statement with a comma and no `:=`, and then Lean just adds it as a new goal. The number of goals goes up by one if you use `have` like this. For example if the local context is ``` P Q R : Prop/Type, f : P → Q, g : Q → R, p : P ⊢ R ``` then after `have q : Q,`, there will be the new goal ``` f : P → Q, g : Q → R, p : P, ⊢ Q ``` and your original goal will have `q : Q` added to the list of hypotheses.
de: ## Zusammenfassung `have h : P,` wird ein neues Ziel erzeugen und ein Term vom Typ `P`ist nötig, um es zu erfüllen. Außerdem wird eine Hypothese `h : P` zu deinem derzeitgen Ziel hinzugefügt. ## Details Wenn du einen Term eines Typs bennenen willst (weil du es z.B. in deinem lokalen kontext haben willst) und du hast eine Formel für diesen Term, dann kannst du `have` zur Benennung verwenden. ## Beispiel (`have q := ...` or `have q : Q := ...`) Wenn der lokale Kontext ``` f : P → Q p : P ``` enthält, dann wird die Taktik `have q := f(p),` `q` zu unserem lokalen Kontext hinzufügen: ``` f : P → Q p : P q : Q ``` Wenn du darüber nachdenkst, dann brauchst du `q` eigentlich nie, denn du kannst stattdessen einfach `f(p)` benutzen. Aber es ist gut, dass wir eine praktische Schreibweise wie diese haben. ## Beispiel (`have q : Q,`) Eine Variante dieser Taktik kann verwendet werden, bei der nur der Typ des Terms angegeben wird, den man haben möchte. Beende dazu deine Eingabe mit einem Komma und ohne `:=`. Lean fügt es dann als neues Ziel hinzu. Die Anzahl der Ziele vergrößert sich dadurch natürlich um eins. Ein Beispiel: ``` P Q R : Prop/Type, f : P → Q, g : Q → R, p : P ⊢ R ``` Nach der Eingabe `have q : Q,`wird dann das folgende Ziel erscheinen: ``` f : P → Q, g : Q → R, p : P, ⊢ Q ``` und das ursprüngliche Ziel wird zu `q : Q` in der Liste der Hypothesen werden.

source: # Function world. ## Level 3: the `have` tactic. Say you have a whole bunch of sets and functions between them, and your goal is to build a certain element of a certain set. If it helps, you can build intermediate elements of other sets along the way, using the `have` command. `have` is the Lean analogue of saying "let's define an element $q\in Q$ by..." in the middle of a calculation. It is often not logically necessary, but on the other hand it is very convenient, for example it can save on notation, or it can break proofs or calculations up into smaller steps. In the level below, we have an element of $P$ and we want an element of $U$; during the proof we will make several intermediate elements of some of the other sets involved. The diagram of sets and functions looks like this pictorially: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/function_diag.jpg) and so it's clear how to make the element of $U$ from the element of $P.$ Indeed, we could solve this level in one move by typing `exact l(j(h(p))),` But let us instead stroll more lazily through the level. We can start by using the `have` tactic to make an element of $Q$: `have q := h(p),` and then we note that $j(q)$ is an element of $T$ `have t : T := j(q),` (notice how on this occasion we explicitly told Lean what set we thought $t$ was in, with that `: T` thing before the `:=`) and we could even define $u$ to be $l(t)$: `have u : U := l(t),` and then finish the level with `exact u,` .
de: # Function world. ## Level 3: die `have` Taktik. Sagen wir, wir haben eine ganze Menge an Mengen und Funktionen zwischen ihnen. Außerdem soll das Ziel sein, ein bestimmtes Element einer bestimmten menge zu erzeugen. Wenn es hilft, können wir dazwischenliegende Elemente anderer Mengen bestimmen. Dazu können wir wieder `have` verwenden. `have` ist das Lean Äquivalent zu sagen: "Wir definieren ein Element $q\in Q$ mit... ". Es ist häufig nicht logisch notwendig, aber auf der anderen Seite ist es sehr praktisch. Es kann z.B. einiges an Notation sparen oder den Beweis in kleinere Teile teilen. Im untenstehenden Level haben wir ein Element von $P$ und wir wollen ein Element von $U$ konstruieren; während des Beweises werden wir verschiedene Zwischenelemente anderer Mengen verwenden. Das Diagramm der Mengen und Funktionen sieht so aus: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/function_diag.jpg) Wir können den Weg von $P$ nach $U$ so leicht nachvollziehen! Tatsächlich könnten wir dieses Level sofort lösen, indem wir schreiben: `exact l(j(h(p))),` Aber lass uns etwas langsamer durch das Level wandern. Wir beginnen, indem wir die `have`Taktik verwenden, um ein Element von $Q$ zu erzeugen: `have q := h(p),` Jetzt können wir erkennen, dass $j(q)$ ein Element von $T$ ist: `have t : T := j(q),` (Beachte: wir haben Lean explizit gesagt, welche Menge $t$ enthält, indem wir dieses `: T` Ding vor das `:=` geschrieben haben.) Ähnlich geht es mit $u$ weiter: `have u : U := l(t),` Und zum Schluss: `exact u,`

source: Given an element of $P$ we can define an element of $U$.
de: Gegeben sei ein Element von $P$, dann können wir ein Element von $U$ konstruieren.

source: If you solved the level using `have`, then click on the last line of your proof (you do know you can move your cursor around with the arrow keys and explore your proof, right?) and note that the local context at that point is in something like the following mess: ``` P Q R S T U : Type, p : P, h : P → Q, i : Q → R, j : Q → T, k : S → T, l : T → U, q : Q, t : T, u : U ⊢ U ``` It was already bad enough to start with, and we added three more terms to it. In level 4 we will learn about the `apply` tactic which solves the level using another technique, without leaving so much junk behind.
de: Wenn du das Level mit `have` gelöst hast, dann klicke in die letzten Zeile deines Beweises. (Du erinnerst dich, dass du die Pfeiltasten nutzen kannst, um deinen Beweis zu erkunden, oder?) Der Kontext dieser letzten Zeile sieht etwa so aus: ``` P Q R S T U : Type, p : P, h : P → Q, i : Q → R, j : Q → T, k : S → T, l : T → U, q : Q, t : T, u : U ⊢ U ``` Es war am Anfang schon schlimm, aber wir haben drei weitere Terme ergänzt! In Level 4 werden wir lernen, wie die `apply` Taktik funktioniert. So kann man das Level einfacher lösen, ohne soviel Müll zurückzulassen.

source: ## Summary If `h : P → Q` is a hypothesis, and the goal is `⊢ Q` then `apply h` changes the goal to `⊢ P`. ## Details If you have a function `h : P → Q` and your goal is `⊢ Q` then `apply h` changes the goal to `⊢ P`. The logic is simple: if you are trying to create a term of type `Q`, but `h` is a function which turns terms of type `P` into terms of type `Q`, then it will suffice to construct a term of type `P`. A mathematician might say: "we need to construct an element of $Q$, but we have a function $h:P\to Q$ so it suffices to construct an element of $P$". Or alternatively "we need to prove $Q$, but we have a proof $h$ that $P\implies Q$ so it suffices to prove $P$".
de: ## Zusammenfassung Wenn `h : P → Q` eine Hypothese und `⊢ Q` das Ziel ist, dann wird `apply h` das Ziel zu `⊢ P` verändern. ## Details Wenn du eine Funktion `h : P → Q` hast und dein Ziel `⊢ Q` ist, dann wird `apply h`das Ziel ändern zu: `⊢ P`. Die Logik dahinter ist recht einfach: wenn du einen Term vom Typ `Q` erzeugen möchtest und `h` eine Funktion ist, die Terme vom Typ `P` in den Typ `Q` verwandelt, dann wird das ausreichen, um einen Term vom Typ `P` zu bastlen!. Ein Mathematiker würde sagen: " Wir müssen ein Element von $Q$ konstruieren, aber wir haben eine Funktion $h:P\to Q$, also genügt es, ein Element von $P$ zu erzeugen.". Oder alternativ: "Wir müssen $Q$ beweisen, aber wir haben einen Beweis $h$, der zeigt: $P\implies Q$, also genügt es $P$ zu beweisen. ".

source: # Function world. ## Level 4: the `apply` tactic. Let's do the same level again: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/function_diag.jpg) We are given $p \in P$ and our goal is to find an element of $U$, or in other words to find a path through the maze that links $P$ to $U$. In level 3 we solved this by using `have`s to move forward, from $P$ to $Q$ to $T$ to $U$. Using the `apply` tactic we can instead construct the path backwards, moving from $U$ to $T$ to $Q$ to $P$. Our goal is to construct an element of the set $U$. But $l:T\to U$ is a function, so it would suffice to construct an element of $T$. Tell Lean this by starting the proof below with `apply l,` and notice that our assumptions don't change but *the goal changes* from `⊢ U` to `⊢ T`. Keep `apply`ing functions until your goal is `P`, and try not to get lost! Now solve this goal with `exact p`. Note: you will need to learn the difference between `exact p` (which works) and `exact P` (which doesn't, because $P$ is not an element of $P$).
de: # Welt der Funktionen. ## Level 4: Die `apply` Taktik. Lass uns dasselbe Level nochmal machen: ![diagram](https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game_images/function_diag.jpg) Wir haben $p \in P$ gegeben und unser Ziel ist es, ein Element von $U$ zu finden. Mit anderen Worten: Wir suchen uns einen Weg durch das Labyrinth von $P$ nach $U$. Im dritten level haben wir das Level mit `have` gelöst. Wir haben uns dabei langsam durch das Labyrinth von $P$ nach $Q$ nach $T$ nach $U$ bewegt. Wenn wir die `apply` Taktik nutzen, können wir stattdessen einen Weg rückwärts, also von $U$ nach $T$ nach $Q$ nach $P$ bewegen. Unser Ziel ist es, ein Element der Menge $U$ zu konstruieren. Aber $l:T\to U$ ist eine Funktion, also wird es genügen, ein Element von $T$ zu konstruieren. Das kannst du Lean sagen, indem wir den Beweis wie folgt starten: `apply l,` Wir bemekeren, dass unsere Annahmen sich nicht verändert haben, aber das Ziel! von `⊢ U` zu `⊢ T`. Mache genau so weiter und benutze `apply`, bis dein Ziel nur noch `P` ist. Versuche nicht verloren zu gehen! Am Ende löse mit `exact p`. Anmerkung: `exact p` funktioniert, `exact P` aber nicht, weil $P$ kein Element von $P$ ist!

source: # Function world. ## Level 5: `P → (Q → P)`. In this level, our goal is to construct a function, like in level 2. ``` ⊢ P → (Q → P) ``` So $P$ and $Q$ are sets, and our goal is to construct a function which takes an element of $P$ and outputs a function from $Q$ to $P$. We don't know anything at all about the sets $P$ and $Q$, so initially this seems like a bit of a tall order. But let's give it a go. Delete the `sorry` and let's think about how to proceed. Our goal is `P → X` for some set $X=\operatorname{Hom}(Q,P)$, and if our goal is to construct a function then we almost always want to use the `intro` tactic from level 2, Lean's version of "let $p\in P$ be arbitrary." So let's start with `intro p,` and we then find ourselves in this state: ``` P Q : Type, p : P ⊢ Q → P ``` We now have an arbitrary element $p\in P$ and we are supposed to be constructing a function $Q\to P$. Well, how about the constant function, which sends everything to $p$? This will work. So let $q\in Q$ be arbitrary: `intro q,` and then let's output `p`. `exact p,`
de: # Welt der Funktionen. ## Level 5: `P → (Q → P)`. In diesem Level wollen wir eine Funktion wie in Level 2 konstruieren. ``` ⊢ P → (Q → P) ``` $P$ und $Q$ are Mengen und unser Ziel ist es, eine Funktion zu konstruieren, die ein Element von $P$ als Eingabe hat und eine Funktion von $Q$ nach $P$ als Ausgabe. Wir wissen nichts über die Mengen $P$ und $Q$, auf den ersten Blick wirkt dies wie eine recht anspruchsvolle Aufgabe. Aber wir versuchen es trotzdem. Lösche das `sorry` und denken wir über das weitere Vorgehen nach. Unser Ziel ist `P → X` für eine Menge $X=\operatorname{Hom}(Q,P)$. Wenn unser Ziel die Konstruktion einer Funktion ist, dann wollen wir fast immer die `intro` Taktik aus Level 2 verwenden, also Leans Version von: "Sei $p\in P$ beliebig:" Fangen wir also an: `intro p,` Dann finden wir uns plötzlich hier wieder: ``` P Q : Type, p : P ⊢ Q → P ``` Wir haben jetzt ein beliebiges Element $p \in P$ und wir sollen eine Funktion $Q\to P$ konstruieren. Na ja, wir könnten zum Beispiel eine konstante Funktion definieren, die alles immer auf $p$ abbildet. Das wird funktionieren, also sei $q \in Q$ ein beliebiges Element: `intro q,` Dann können wir jetzt `p` ausgeben. `exact p,`

source: We define an element of $\operatorname{Hom}(P,\operatorname{Hom}(Q,P))$.
de: Wir definieren ein Element von $\operatorname{Hom}(P,\operatorname{Hom}(Q,P))$.

source: A mathematician would treat the set `P → (Q → P)` as the same as the set `P × Q → P`, because to give an element of either function space is just to give a rule which takes an element of $P$ and an element of $Q$, and returns an element of $P$. Thinking of the goal as a function from `P × Q` to `P` we realise that it's just projection onto the first factor. ## Did you notice? I wrote `P → (Q → P)` but Lean just writes `P → Q → P`. This is because computer scientists adopt the convention that `→` is *right associative*, which is a fancy way of saying "when we write `P → Q → R`, we mean `P → (Q → R)`." Mathematicians use right associativity as a convention for powers: if a mathematician says $10^{10^{10}}$ they don't mean $(10^{10})^{10}=10^{100}$, they mean $10^{(10^{10})}$. So `10 ^ 10 ^ 10` in Lean means `10 ^ (10 ^ 10)` and not `(10 ^ 10) ^ 10`. However they use left associativity as a convention for subtraction: if a mathematician writes $6 - 2 - 1$ they mean $(6 - 2) - 1$ and not $6 - (2 - 1)$. ## Pro tip `intros p q,` is the same as `intro p, intro q,`.
de: Ein Mathematiker würde die Menge `P → (Q → P)` genauso wie die Menge `P × Q → P` behandeln. Das liegt daran, dass die Angabe eines Elements eines Funktionenraums nur bedeutet, dass eine Regel angegeben werden muss, die ein Element von $P$ und ein Element von $Q$ nimmt und ein Element von $P$ wieder ausgibt. Denken wir an das Ziel als Funktion von `P × Q nach `P`, so können wir verstehen, dass es nur die Projektion auf den ersten Faktor ist! ## Hast du es bemerkt? Ich habe `P → (Q → P)` geschrieben, aber Lean schreibt nur `P → Q → P`. Das liegt daran, dass Informatiker die Konvention benutzen, dass `→` rechtsassoziativ ist. Das ist wieder nur eine schlaue Art zu sagen: " wenn wir `P → Q → R` schreiben, dann meinen wir `P → (Q → R)` " Mathematiker benutzen Rechtsassoziativität als eine Konvention für Potenzen: wenn ein Mathematiker $10^{10^{10}} sagt, dann meint er nicht $(10^{10})^{10}=10^{100}, sondern $10^{(10^{10})}$. In Lean ist `10 ^ 10 ^ 10` also `10 ^ (10 ^ 10)` und nicht `(10 ^ 10) ^ 10`. Leider nutzen Mathematiker Linksassoziativität für Differenzen: wenn ein Mathematiker $6-2-1$ schreibt, meinen sie $(6-2)-1$ und nicht $6-(2-1)$. ##Profi Tipp: `intros p q,` ist das Gleiche wie: `intro p, intro q,`.
